
date_O0_debug:     file format elf64-x86-64

Contents of the .eh_frame section (loaded from date_O0_debug):


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000000000000014 0000001c FDE cie=00000000 pc=00000000000038a0..00000000000038cf
  DW_CFA_advance_loc: 4 to 00000000000038a4
  DW_CFA_undefined: r16 (rip)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000030 0000000000000024 00000034 FDE cie=00000000 pc=0000000000003020..0000000000003450
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000003026
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000003030
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit10; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 0000000000000014 0000005c FDE cie=00000000 pc=0000000000003450..0000000000003480
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 0000000000000014 00000074 FDE cie=00000000 pc=0000000000003480..00000000000038a0
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop


    <43>   DW_AT_name        : (indirect string, offset: 0x1bfb): unsigned int
 <1><47>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <48>   DW_AT_byte_size   : 8
 <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 8	(unsigned char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x7bf): unsigned char
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 7	(unsigned)
    <53>   DW_AT_name        : (indirect string, offset: 0x1116): short unsigned int
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 1
    <59>   DW_AT_encoding    : 6	(signed char)
    <5a>   DW_AT_name        : (indirect string, offset: 0x7c1): signed char
 <1><5e>: Abbrev Number: 3 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x21d3): short int
 <1><65>: Abbrev Number: 5 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x1ea4): long int
 <1><73>: Abbrev Number: 2 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x169a): __intmax_t
    <78>   DW_AT_decl_file   : 4
    <79>   DW_AT_decl_line   : 72
    <7a>   DW_AT_decl_column : 18
    <7b>   DW_AT_type        : <0x6c>
 <1><7f>: Abbrev Number: 2 (DW_TAG_typedef)
    <80>   DW_AT_name        : (indirect string, offset: 0x1671): __dev_t
    <84>   DW_AT_decl_file   : 4
    <85>   DW_AT_decl_line   : 145
    <86>   DW_AT_decl_column : 25
    <87>   DW_AT_type        : <0x39>
 <1><8b>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x6ac): __uid_t
    <90>   DW_AT_decl_file   : 4
    <91>   DW_AT_decl_line   : 146
    <92>   DW_AT_decl_column : 25
    <93>   DW_AT_type        : <0x40>
 <1><97>: Abbrev Number: 2 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x1b85): __gid_t
    <9c>   DW_AT_decl_file   : 4
    <9d>   DW_AT_decl_line   : 147
    <9e>   DW_AT_decl_column : 25
    <9f>   DW_AT_type        : <0x40>
 <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x1f60): __ino_t
    <a8>   DW_AT_decl_file   : 4
    <a9>   DW_AT_decl_line   : 148
    <aa>   DW_AT_decl_column : 25
    <ab>   DW_AT_type        : <0x39>
 <1><af>: Abbrev Number: 2 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0x925): __mode_t
    <b4>   DW_AT_decl_file   : 4
    <b5>   DW_AT_decl_line   : 150
    <b6>   DW_AT_decl_column : 26
    <b7>   DW_AT_type        : <0x40>
 <1><bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <bc>   DW_AT_name        : (indirect string, offset: 0xc88): __nlink_t
    <c0>   DW_AT_decl_file   : 4
    <c1>   DW_AT_decl_line   : 151
    <c2>   DW_AT_decl_column : 27
    <c3>   DW_AT_type        : <0x39>
 <1><c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <c8>   DW_AT_name        : (indirect string, offset: 0x2c5): __off_t
    <cc>   DW_AT_decl_file   : 4
    <cd>   DW_AT_decl_line   : 152
    <ce>   DW_AT_decl_column : 25
    <cf>   DW_AT_type        : <0x6c>
 <1><d3>: Abbrev Number: 2 (DW_TAG_typedef)
    <d4>   DW_AT_name        : (indirect string, offset: 0x120c): __off64_t
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 153
    <da>   DW_AT_decl_column : 27
    <db>   DW_AT_type        : <0x6c>
 <1><df>: Abbrev Number: 2 (DW_TAG_typedef)
    <e0>   DW_AT_name        : (indirect string, offset: 0x104a): __time_t
    <e4>   DW_AT_decl_file   : 4
    <e5>   DW_AT_decl_line   : 160
    <e6>   DW_AT_decl_column : 26
    <e7>   DW_AT_type        : <0x6c>
 <1><eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <ec>   DW_AT_name        : (indirect string, offset: 0x1150): __blksize_t
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 174
    <f2>   DW_AT_decl_column : 29
    <f3>   DW_AT_type        : <0x6c>
 <1><f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <f8>   DW_AT_name        : (indirect string, offset: 0x808): __blkcnt_t
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 179
    <fe>   DW_AT_decl_column : 28
    <ff>   DW_AT_type        : <0x6c>
 <1><103>: Abbrev Number: 2 (DW_TAG_typedef)
    <104>   DW_AT_name        : (indirect string, offset: 0xe2b): __ssize_t
    <108>   DW_AT_decl_file   : 4
    <109>   DW_AT_decl_line   : 193
    <10a>   DW_AT_decl_column : 27
    <10b>   DW_AT_type        : <0x6c>
 <1><10f>: Abbrev Number: 2 (DW_TAG_typedef)
    <110>   DW_AT_name        : (indirect string, offset: 0x46b): __syscall_slong_t
    <114>   DW_AT_decl_file   : 4
    <115>   DW_AT_decl_line   : 196
    <116>   DW_AT_decl_column : 33
    <117>   DW_AT_type        : <0x6c>
 <1><11b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <11c>   DW_AT_byte_size   : 8
    <11d>   DW_AT_type        : <0x126>
 <1><121>: Abbrev Number: 7 (DW_TAG_const_type)
    <122>   DW_AT_type        : <0x11b>
 <1><126>: Abbrev Number: 3 (DW_TAG_base_type)
    <127>   DW_AT_byte_size   : 1
    <128>   DW_AT_encoding    : 6	(signed char)
    <129>   DW_AT_name        : (indirect string, offset: 0x7c8): char
 <1><12d>: Abbrev Number: 7 (DW_TAG_const_type)
    <12e>   DW_AT_type        : <0x126>
 <1><132>: Abbrev Number: 8 (DW_TAG_structure_type)
    <133>   DW_AT_name        : (indirect string, offset: 0x16c9): _IO_FILE
    <137>   DW_AT_byte_size   : 216
    <138>   DW_AT_decl_file   : 5
    <139>   DW_AT_decl_line   : 49
    <13a>   DW_AT_decl_column : 8
    <13b>   DW_AT_sibling     : <0x2b9>
 <2><13f>: Abbrev Number: 9 (DW_TAG_member)
    <140>   DW_AT_name        : (indirect string, offset: 0x160b): _flags
    <144>   DW_AT_decl_file   : 5
    <145>   DW_AT_decl_line   : 51
    <146>   DW_AT_decl_column : 7
    <147>   DW_AT_type        : <0x65>
    <14b>   DW_AT_data_member_location: 0
 <2><14c>: Abbrev Number: 9 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x1cf2): _IO_read_ptr
    <151>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 54
    <153>   DW_AT_decl_column : 9
    <154>   DW_AT_type        : <0x11b>
    <158>   DW_AT_data_member_location: 8
 <2><159>: Abbrev Number: 9 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x16a5): _IO_read_end
    <15e>   DW_AT_decl_file   : 5
    <15f>   DW_AT_decl_line   : 55
    <160>   DW_AT_decl_column : 9
    <161>   DW_AT_type        : <0x11b>
    <165>   DW_AT_data_member_location: 16
 <2><166>: Abbrev Number: 9 (DW_TAG_member)
    <167>   DW_AT_name        : (indirect string, offset: 0x123b): _IO_read_base
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 56
    <16d>   DW_AT_decl_column : 9
    <16e>   DW_AT_type        : <0x11b>
    <172>   DW_AT_data_member_location: 24
 <2><173>: Abbrev Number: 9 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0x12dd): _IO_write_base
    <178>   DW_AT_decl_file   : 5
    <179>   DW_AT_decl_line   : 57
    <17a>   DW_AT_decl_column : 9
    <17b>   DW_AT_type        : <0x11b>
    <17f>   DW_AT_data_member_location: 32
 <2><180>: Abbrev Number: 9 (DW_TAG_member)
    <181>   DW_AT_name        : (indirect string, offset: 0x9ba): _IO_write_ptr
    <185>   DW_AT_decl_file   : 5
    <186>   DW_AT_decl_line   : 58
    <187>   DW_AT_decl_column : 9
    <188>   DW_AT_type        : <0x11b>
    <18c>   DW_AT_data_member_location: 40
 <2><18d>: Abbrev Number: 9 (DW_TAG_member)
    <18e>   DW_AT_name        : (indirect string, offset: 0x4b3): _IO_write_end
    <192>   DW_AT_decl_file   : 5
    <193>   DW_AT_decl_line   : 59
    <194>   DW_AT_decl_column : 9
    <195>   DW_AT_type        : <0x11b>
    <199>   DW_AT_data_member_location: 48
 <2><19a>: Abbrev Number: 9 (DW_TAG_member)
    <19b>   DW_AT_name        : (indirect string, offset: 0x163e): _IO_buf_base
    <19f>   DW_AT_decl_file   : 5
    <1a0>   DW_AT_decl_line   : 60
    <1a1>   DW_AT_decl_column : 9
    <1a2>   DW_AT_type        : <0x11b>
    <1a6>   DW_AT_data_member_location: 56
 <2><1a7>: Abbrev Number: 9 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x1276): _IO_buf_end
    <1ac>   DW_AT_decl_file   : 5
    <1ad>   DW_AT_decl_line   : 61
    <1ae>   DW_AT_decl_column : 9
    <1af>   DW_AT_type        : <0x11b>
    <1b3>   DW_AT_data_member_location: 64
 <2><1b4>: Abbrev Number: 9 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xbe6): _IO_save_base
    <1b9>   DW_AT_decl_file   : 5
    <1ba>   DW_AT_decl_line   : 64
    <1bb>   DW_AT_decl_column : 9
    <1bc>   DW_AT_type        : <0x11b>
    <1c0>   DW_AT_data_member_location: 72
 <2><1c1>: Abbrev Number: 9 (DW_TAG_member)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x1ccd): _IO_backup_base
    <1c6>   DW_AT_decl_file   : 5
    <1c7>   DW_AT_decl_line   : 65
    <1c8>   DW_AT_decl_column : 9
    <1c9>   DW_AT_type        : <0x11b>
    <1cd>   DW_AT_data_member_location: 80
 <2><1ce>: Abbrev Number: 9 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0xf91): _IO_save_end
    <1d3>   DW_AT_decl_file   : 5
    <1d4>   DW_AT_decl_line   : 66
    <1d5>   DW_AT_decl_column : 9
    <1d6>   DW_AT_type        : <0x11b>
    <1da>   DW_AT_data_member_location: 88
 <2><1db>: Abbrev Number: 9 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x18dd): _markers
    <1e0>   DW_AT_decl_file   : 5
    <1e1>   DW_AT_decl_line   : 68
    <1e2>   DW_AT_decl_column : 22
    <1e3>   DW_AT_type        : <0x2d2>
    <1e7>   DW_AT_data_member_location: 96
 <2><1e8>: Abbrev Number: 9 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x76d): _chain
    <1ed>   DW_AT_decl_file   : 5
    <1ee>   DW_AT_decl_line   : 70
    <1ef>   DW_AT_decl_column : 20
    <1f0>   DW_AT_type        : <0x2d8>
    <1f4>   DW_AT_data_member_location: 104
 <2><1f5>: Abbrev Number: 9 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x41): _fileno
    <1fa>   DW_AT_decl_file   : 5
    <1fb>   DW_AT_decl_line   : 72
    <1fc>   DW_AT_decl_column : 7
    <1fd>   DW_AT_type        : <0x65>
    <201>   DW_AT_data_member_location: 112
 <2><202>: Abbrev Number: 9 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0x1ead): _flags2
    <207>   DW_AT_decl_file   : 5
    <208>   DW_AT_decl_line   : 73
    <209>   DW_AT_decl_column : 7
    <20a>   DW_AT_type        : <0x65>
    <20e>   DW_AT_data_member_location: 116
 <2><20f>: Abbrev Number: 9 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x1e2c): _old_offset
    <214>   DW_AT_decl_file   : 5
    <215>   DW_AT_decl_line   : 74
    <216>   DW_AT_decl_column : 11
    <217>   DW_AT_type        : <0xc7>
    <21b>   DW_AT_data_member_location: 120
 <2><21c>: Abbrev Number: 9 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0x1c21): _cur_column
    <221>   DW_AT_decl_file   : 5
    <222>   DW_AT_decl_line   : 77
    <223>   DW_AT_decl_column : 18
    <224>   DW_AT_type        : <0x50>
    <228>   DW_AT_data_member_location: 128
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x2217): _vtable_offset
    <22e>   DW_AT_decl_file   : 5
    <22f>   DW_AT_decl_line   : 78
    <230>   DW_AT_decl_column : 15
    <231>   DW_AT_type        : <0x57>
    <235>   DW_AT_data_member_location: 130
 <2><236>: Abbrev Number: 9 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x22a): _shortbuf
    <23b>   DW_AT_decl_file   : 5
    <23c>   DW_AT_decl_line   : 79
    <23d>   DW_AT_decl_column : 8
    <23e>   DW_AT_type        : <0x2de>
    <242>   DW_AT_data_member_location: 131
 <2><243>: Abbrev Number: 9 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x311): _lock
    <248>   DW_AT_decl_file   : 5
    <249>   DW_AT_decl_line   : 81
    <24a>   DW_AT_decl_column : 15
    <24b>   DW_AT_type        : <0x2ee>
    <24f>   DW_AT_data_member_location: 136
 <2><250>: Abbrev Number: 9 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0x1e30): _offset
    <255>   DW_AT_decl_file   : 5
    <256>   DW_AT_decl_line   : 89
    <257>   DW_AT_decl_column : 13
    <258>   DW_AT_type        : <0xd3>
    <25c>   DW_AT_data_member_location: 144
 <2><25d>: Abbrev Number: 9 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x14c2): _codecvt
    <262>   DW_AT_decl_file   : 5
    <263>   DW_AT_decl_line   : 91
    <264>   DW_AT_decl_column : 23
    <265>   DW_AT_type        : <0x2f9>
    <269>   DW_AT_data_member_location: 152
 <2><26a>: Abbrev Number: 9 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x16d5): _wide_data
    <26f>   DW_AT_decl_file   : 5
    <270>   DW_AT_decl_line   : 92
    <271>   DW_AT_decl_column : 25
    <272>   DW_AT_type        : <0x304>
    <276>   DW_AT_data_member_location: 160
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x1d57): _freeres_list
    <27c>   DW_AT_decl_file   : 5
    <27d>   DW_AT_decl_line   : 93
    <27e>   DW_AT_decl_column : 20
    <27f>   DW_AT_type        : <0x2d8>
    <283>   DW_AT_data_member_location: 168
 <2><284>: Abbrev Number: 9 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x1bbb): _freeres_buf
    <289>   DW_AT_decl_file   : 5
    <28a>   DW_AT_decl_line   : 94
    <28b>   DW_AT_decl_column : 9
    <28c>   DW_AT_type        : <0x47>
    <290>   DW_AT_data_member_location: 176
 <2><291>: Abbrev Number: 9 (DW_TAG_member)
    <292>   DW_AT_name        : (indirect string, offset: 0x187b): __pad5
    <296>   DW_AT_decl_file   : 5
    <297>   DW_AT_decl_line   : 95
    <298>   DW_AT_decl_column : 10
    <299>   DW_AT_type        : <0x2d>
    <29d>   DW_AT_data_member_location: 184
 <2><29e>: Abbrev Number: 9 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0x150): _mode
    <2a3>   DW_AT_decl_file   : 5
    <2a4>   DW_AT_decl_line   : 96
    <2a5>   DW_AT_decl_column : 7
    <2a6>   DW_AT_type        : <0x65>
    <2aa>   DW_AT_data_member_location: 192
 <2><2ab>: Abbrev Number: 9 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x17): _unused2
    <2b0>   DW_AT_decl_file   : 5
    <2b1>   DW_AT_decl_line   : 98
    <2b2>   DW_AT_decl_column : 8
    <2b3>   DW_AT_type        : <0x30a>
    <2b7>   DW_AT_data_member_location: 196
 <2><2b8>: Abbrev Number: 0
 <1><2b9>: Abbrev Number: 2 (DW_TAG_typedef)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x16cd): FILE
    <2be>   DW_AT_decl_file   : 6
    <2bf>   DW_AT_decl_line   : 7
    <2c0>   DW_AT_decl_column : 25
    <2c1>   DW_AT_type        : <0x132>
 <1><2c5>: Abbrev Number: 10 (DW_TAG_typedef)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x813): _IO_lock_t
    <2ca>   DW_AT_decl_file   : 5
    <2cb>   DW_AT_decl_line   : 43
    <2cc>   DW_AT_decl_column : 14
 <1><2cd>: Abbrev Number: 11 (DW_TAG_structure_type)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x143e): _IO_marker
    <2d2>   DW_AT_declaration : 1
 <1><2d2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2d3>   DW_AT_byte_size   : 8
    <2d4>   DW_AT_type        : <0x2cd>
 <1><2d8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2d9>   DW_AT_byte_size   : 8
    <2da>   DW_AT_type        : <0x132>
 <1><2de>: Abbrev Number: 12 (DW_TAG_array_type)
    <2df>   DW_AT_type        : <0x126>
    <2e3>   DW_AT_sibling     : <0x2ee>
 <2><2e7>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <2e8>   DW_AT_type        : <0x39>
    <2ec>   DW_AT_upper_bound : 0
 <2><2ed>: Abbrev Number: 0
 <1><2ee>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2ef>   DW_AT_byte_size   : 8
    <2f0>   DW_AT_type        : <0x2c5>
 <1><2f4>: Abbrev Number: 11 (DW_TAG_structure_type)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x14bf): _IO_codecvt
    <2f9>   DW_AT_declaration : 1
 <1><2f9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2fa>   DW_AT_byte_size   : 8
    <2fb>   DW_AT_type        : <0x2f4>
 <1><2ff>: Abbrev Number: 11 (DW_TAG_structure_type)
    <300>   DW_AT_name        : (indirect string, offset: 0x16d2): _IO_wide_data
    <304>   DW_AT_declaration : 1
 <1><304>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <305>   DW_AT_byte_size   : 8
    <306>   DW_AT_type        : <0x2ff>
 <1><30a>: Abbrev Number: 12 (DW_TAG_array_type)
    <30b>   DW_AT_type        : <0x126>
    <30f>   DW_AT_sibling     : <0x31a>
 <2><313>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <314>   DW_AT_type        : <0x39>
    <318>   DW_AT_upper_bound : 19
 <2><319>: Abbrev Number: 0
 <1><31a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <31b>   DW_AT_byte_size   : 8
    <31c>   DW_AT_type        : <0x12d>
 <1><320>: Abbrev Number: 7 (DW_TAG_const_type)
    <321>   DW_AT_type        : <0x31a>
 <1><325>: Abbrev Number: 14 (DW_TAG_restrict_type)
    <326>   DW_AT_type        : <0x31a>
 <1><32a>: Abbrev Number: 2 (DW_TAG_typedef)
    <32b>   DW_AT_name        : (indirect string, offset: 0xe2d): ssize_t
    <32f>   DW_AT_decl_file   : 7
    <330>   DW_AT_decl_line   : 77
    <331>   DW_AT_decl_column : 19
    <332>   DW_AT_type        : <0x103>
 <1><336>: Abbrev Number: 15 (DW_TAG_variable)
    <337>   DW_AT_name        : (indirect string, offset: 0x1638): stdin
    <33b>   DW_AT_decl_file   : 7
    <33c>   DW_AT_decl_line   : 137
    <33d>   DW_AT_decl_column : 14
    <33e>   DW_AT_type        : <0x342>
    <342>   DW_AT_external    : 1
    <342>   DW_AT_declaration : 1
 <1><342>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <343>   DW_AT_byte_size   : 8
    <344>   DW_AT_type        : <0x2b9>
 <1><348>: Abbrev Number: 14 (DW_TAG_restrict_type)
    <349>   DW_AT_type        : <0x342>
 <1><34d>: Abbrev Number: 15 (DW_TAG_variable)
    <34e>   DW_AT_name        : (indirect string, offset: 0x1228): stdout
    <352>   DW_AT_decl_file   : 7
    <353>   DW_AT_decl_line   : 138
    <354>   DW_AT_decl_column : 14
    <355>   DW_AT_type        : <0x342>
    <359>   DW_AT_external    : 1
    <359>   DW_AT_declaration : 1
 <1><359>: Abbrev Number: 15 (DW_TAG_variable)
    <35a>   DW_AT_name        : (indirect string, offset: 0xf6d): stderr
    <35e>   DW_AT_decl_file   : 7
    <35f>   DW_AT_decl_line   : 139
    <360>   DW_AT_decl_column : 14
    <361>   DW_AT_type        : <0x342>
    <365>   DW_AT_external    : 1
    <365>   DW_AT_declaration : 1
 <1><365>: Abbrev Number: 2 (DW_TAG_typedef)
    <366>   DW_AT_name        : (indirect string, offset: 0x11a3): ptrdiff_t
    <36a>   DW_AT_decl_file   : 3
    <36b>   DW_AT_decl_line   : 143
    <36c>   DW_AT_decl_column : 26
    <36d>   DW_AT_type        : <0x6c>
 <1><371>: Abbrev Number: 3 (DW_TAG_base_type)
    <372>   DW_AT_byte_size   : 8
    <373>   DW_AT_encoding    : 5	(signed)
    <374>   DW_AT_name        : (indirect string, offset: 0x1e9f): long long int
 <1><378>: Abbrev Number: 3 (DW_TAG_base_type)
    <379>   DW_AT_byte_size   : 16
    <37a>   DW_AT_encoding    : 4	(float)
    <37b>   DW_AT_name        : (indirect string, offset: 0x1507): long double
 <1><37f>: Abbrev Number: 2 (DW_TAG_typedef)
    <380>   DW_AT_name        : (indirect string, offset: 0x104c): time_t
    <384>   DW_AT_decl_file   : 8
    <385>   DW_AT_decl_line   : 7
    <386>   DW_AT_decl_column : 18
    <387>   DW_AT_type        : <0xdf>
 <1><38b>: Abbrev Number: 7 (DW_TAG_const_type)
    <38c>   DW_AT_type        : <0x37f>
 <1><390>: Abbrev Number: 8 (DW_TAG_structure_type)
    <391>   DW_AT_name        : (indirect string, offset: 0x2d7d): timespec
    <395>   DW_AT_byte_size   : 16
    <396>   DW_AT_decl_file   : 9
    <397>   DW_AT_decl_line   : 10
    <398>   DW_AT_decl_column : 8
    <399>   DW_AT_sibling     : <0x3b8>
 <2><39d>: Abbrev Number: 9 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x1bc8): tv_sec
    <3a2>   DW_AT_decl_file   : 9
    <3a3>   DW_AT_decl_line   : 12
    <3a4>   DW_AT_decl_column : 12
    <3a5>   DW_AT_type        : <0xdf>
    <3a9>   DW_AT_data_member_location: 0
 <2><3aa>: Abbrev Number: 9 (DW_TAG_member)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x1edc): tv_nsec
    <3af>   DW_AT_decl_file   : 9
    <3b0>   DW_AT_decl_line   : 16
    <3b1>   DW_AT_decl_column : 21
    <3b2>   DW_AT_type        : <0x10f>
    <3b6>   DW_AT_data_member_location: 8
 <2><3b7>: Abbrev Number: 0
 <1><3b8>: Abbrev Number: 7 (DW_TAG_const_type)
    <3b9>   DW_AT_type        : <0x390>
 <1><3bd>: Abbrev Number: 3 (DW_TAG_base_type)
    <3be>   DW_AT_byte_size   : 8
    <3bf>   DW_AT_encoding    : 7	(unsigned)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x1bf1): long long unsigned int
 <1><3c4>: Abbrev Number: 15 (DW_TAG_variable)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x63b): optarg
    <3c9>   DW_AT_decl_file   : 10
    <3ca>   DW_AT_decl_line   : 36
    <3cb>   DW_AT_decl_column : 14
    <3cc>   DW_AT_type        : <0x11b>
    <3d0>   DW_AT_external    : 1
    <3d0>   DW_AT_declaration : 1
 <1><3d0>: Abbrev Number: 15 (DW_TAG_variable)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x1e98): optind
    <3d5>   DW_AT_decl_file   : 10
    <3d6>   DW_AT_decl_line   : 50
    <3d7>   DW_AT_decl_column : 12
    <3d8>   DW_AT_type        : <0x65>
    <3dc>   DW_AT_external    : 1
    <3dc>   DW_AT_declaration : 1
 <1><3dc>: Abbrev Number: 8 (DW_TAG_structure_type)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x1f04): option
    <3e1>   DW_AT_byte_size   : 32
    <3e2>   DW_AT_decl_file   : 11
    <3e3>   DW_AT_decl_line   : 50
    <3e4>   DW_AT_decl_column : 8
    <3e5>   DW_AT_sibling     : <0x41e>
 <2><3e9>: Abbrev Number: 9 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x3d1e): name
    <3ee>   DW_AT_decl_file   : 11
    <3ef>   DW_AT_decl_line   : 52
    <3f0>   DW_AT_decl_column : 15
    <3f1>   DW_AT_type        : <0x31a>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 9 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x363): has_arg
    <3fb>   DW_AT_decl_file   : 11
    <3fc>   DW_AT_decl_line   : 55
    <3fd>   DW_AT_decl_column : 7
    <3fe>   DW_AT_type        : <0x65>
    <402>   DW_AT_data_member_location: 8
 <2><403>: Abbrev Number: 9 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xfcd): flag
    <408>   DW_AT_decl_file   : 11
    <409>   DW_AT_decl_line   : 56
    <40a>   DW_AT_decl_column : 8
    <40b>   DW_AT_type        : <0x423>
    <40f>   DW_AT_data_member_location: 16
 <2><410>: Abbrev Number: 16 (DW_TAG_member)
    <411>   DW_AT_name        : val
    <415>   DW_AT_decl_file   : 11
    <416>   DW_AT_decl_line   : 57
    <417>   DW_AT_decl_column : 7
    <418>   DW_AT_type        : <0x65>
    <41c>   DW_AT_data_member_location: 24
 <2><41d>: Abbrev Number: 0
 <1><41e>: Abbrev Number: 7 (DW_TAG_const_type)
    <41f>   DW_AT_type        : <0x3dc>
 <1><423>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <424>   DW_AT_byte_size   : 8
    <425>   DW_AT_type        : <0x65>
 <1><429>: Abbrev Number: 2 (DW_TAG_typedef)
    <42a>   DW_AT_name        : (indirect string, offset: 0x56e): nl_item
    <42e>   DW_AT_decl_file   : 12
    <42f>   DW_AT_decl_line   : 36
    <430>   DW_AT_decl_column : 13
    <431>   DW_AT_type        : <0x65>
 <1><435>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <436>   DW_AT_encoding    : 7	(unsigned)
    <437>   DW_AT_byte_size   : 4
    <438>   DW_AT_type        : <0x40>
    <43c>   DW_AT_decl_file   : 18
    <43d>   DW_AT_decl_line   : 42
    <43e>   DW_AT_decl_column : 1
    <43f>   DW_AT_sibling     : <0x10b3>
 <2><443>: Abbrev Number: 18 (DW_TAG_enumerator)
    <444>   DW_AT_name        : (indirect string, offset: 0xfb8): ABDAY_1
    <448>   DW_AT_const_value : 0x20000
 <2><44c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <44d>   DW_AT_name        : (indirect string, offset: 0xfc5): ABDAY_2
    <451>   DW_AT_const_value : 0x20001
 <2><455>: Abbrev Number: 18 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0xb37): ABDAY_3
    <45a>   DW_AT_const_value : 0x20002
 <2><45e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <45f>   DW_AT_name        : (indirect string, offset: 0xfd7): ABDAY_4
    <463>   DW_AT_const_value : 0x20003
 <2><467>: Abbrev Number: 18 (DW_TAG_enumerator)
    <468>   DW_AT_name        : (indirect string, offset: 0xfe4): ABDAY_5
    <46c>   DW_AT_const_value : 0x20004
 <2><470>: Abbrev Number: 18 (DW_TAG_enumerator)
    <471>   DW_AT_name        : (indirect string, offset: 0xff1): ABDAY_6
    <475>   DW_AT_const_value : 0x20005
 <2><479>: Abbrev Number: 18 (DW_TAG_enumerator)
    <47a>   DW_AT_name        : (indirect string, offset: 0xffe): ABDAY_7
    <47e>   DW_AT_const_value : 0x20006
 <2><482>: Abbrev Number: 18 (DW_TAG_enumerator)
    <483>   DW_AT_name        : (indirect string, offset: 0xfba): DAY_1
    <487>   DW_AT_const_value : 0x20007
 <2><48b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <48c>   DW_AT_name        : (indirect string, offset: 0xfc7): DAY_2
    <490>   DW_AT_const_value : 0x20008
 <2><494>: Abbrev Number: 18 (DW_TAG_enumerator)
    <495>   DW_AT_name        : (indirect string, offset: 0xb39): DAY_3
    <499>   DW_AT_const_value : 0x20009
 <2><49d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <49e>   DW_AT_name        : (indirect string, offset: 0xfd9): DAY_4
    <4a2>   DW_AT_const_value : 0x2000a
 <2><4a6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4a7>   DW_AT_name        : (indirect string, offset: 0xfe6): DAY_5
    <4ab>   DW_AT_const_value : 0x2000b
 <2><4af>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4b0>   DW_AT_name        : (indirect string, offset: 0xff3): DAY_6
    <4b4>   DW_AT_const_value : 0x2000c
 <2><4b8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x1000): DAY_7
    <4bd>   DW_AT_const_value : 0x2000d
 <2><4c1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xde): ABMON_1
    <4c6>   DW_AT_const_value : 0x2000e
 <2><4ca>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4cb>   DW_AT_name        : (indirect string, offset: 0xeb): ABMON_2
    <4cf>   DW_AT_const_value : 0x2000f
 <2><4d3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xf8): ABMON_3
    <4d8>   DW_AT_const_value : 0x20010
 <2><4dc>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x105): ABMON_4
    <4e1>   DW_AT_const_value : 0x20011
 <2><4e5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4e6>   DW_AT_name        : (indirect string, offset: 0x112): ABMON_5
    <4ea>   DW_AT_const_value : 0x20012
 <2><4ee>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x11f): ABMON_6
    <4f3>   DW_AT_const_value : 0x20013
 <2><4f7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x12c): ABMON_7
    <4fc>   DW_AT_const_value : 0x20014
 <2><500>: Abbrev Number: 18 (DW_TAG_enumerator)
    <501>   DW_AT_name        : (indirect string, offset: 0x139): ABMON_8
    <505>   DW_AT_const_value : 0x20015
 <2><509>: Abbrev Number: 18 (DW_TAG_enumerator)
    <50a>   DW_AT_name        : (indirect string, offset: 0x146): ABMON_9
    <50e>   DW_AT_const_value : 0x20016
 <2><512>: Abbrev Number: 18 (DW_TAG_enumerator)
    <513>   DW_AT_name        : (indirect string, offset: 0x17f): ABMON_10
    <517>   DW_AT_const_value : 0x20017
 <2><51b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x18d): ABMON_11
    <520>   DW_AT_const_value : 0x20018
 <2><524>: Abbrev Number: 18 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0x19b): ABMON_12
    <529>   DW_AT_const_value : 0x20019
 <2><52d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <52e>   DW_AT_name        : (indirect string, offset: 0xe0): MON_1
    <532>   DW_AT_const_value : 0x2001a
 <2><536>: Abbrev Number: 18 (DW_TAG_enumerator)
    <537>   DW_AT_name        : (indirect string, offset: 0xed): MON_2
    <53b>   DW_AT_const_value : 0x2001b
 <2><53f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <540>   DW_AT_name        : (indirect string, offset: 0xfa): MON_3
    <544>   DW_AT_const_value : 0x2001c
 <2><548>: Abbrev Number: 18 (DW_TAG_enumerator)
    <549>   DW_AT_name        : (indirect string, offset: 0x107): MON_4
    <54d>   DW_AT_const_value : 0x2001d
 <2><551>: Abbrev Number: 18 (DW_TAG_enumerator)
    <552>   DW_AT_name        : (indirect string, offset: 0x114): MON_5
    <556>   DW_AT_const_value : 0x2001e
 <2><55a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <55b>   DW_AT_name        : (indirect string, offset: 0x121): MON_6
    <55f>   DW_AT_const_value : 0x2001f
 <2><563>: Abbrev Number: 18 (DW_TAG_enumerator)
    <564>   DW_AT_name        : (indirect string, offset: 0x12e): MON_7
    <568>   DW_AT_const_value : 0x20020
 <2><56c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <56d>   DW_AT_name        : (indirect string, offset: 0x13b): MON_8
    <571>   DW_AT_const_value : 0x20021
 <2><575>: Abbrev Number: 18 (DW_TAG_enumerator)
    <576>   DW_AT_name        : (indirect string, offset: 0x148): MON_9
    <57a>   DW_AT_const_value : 0x20022
 <2><57e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <57f>   DW_AT_name        : (indirect string, offset: 0x181): MON_10
    <583>   DW_AT_const_value : 0x20023
 <2><587>: Abbrev Number: 18 (DW_TAG_enumerator)
    <588>   DW_AT_name        : (indirect string, offset: 0x18f): MON_11
    <58c>   DW_AT_const_value : 0x20024
 <2><590>: Abbrev Number: 18 (DW_TAG_enumerator)
    <591>   DW_AT_name        : (indirect string, offset: 0x19d): MON_12
    <595>   DW_AT_const_value : 0x20025
 <2><599>: Abbrev Number: 18 (DW_TAG_enumerator)
    <59a>   DW_AT_name        : (indirect string, offset: 0xe05): AM_STR
    <59e>   DW_AT_const_value : 0x20026
 <2><5a2>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5a3>   DW_AT_name        : (indirect string, offset: 0xcfd): PM_STR
    <5a7>   DW_AT_const_value : 0x20027
 <2><5ab>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5ac>   DW_AT_name        : (indirect string, offset: 0xe3a): D_T_FMT
    <5b0>   DW_AT_const_value : 0x20028
 <2><5b4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x5af): D_FMT
    <5b9>   DW_AT_const_value : 0x20029
 <2><5bd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5be>   DW_AT_name        : (indirect string, offset: 0x2e1): T_FMT
    <5c2>   DW_AT_const_value : 0x2002a
 <2><5c6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x156d): T_FMT_AMPM
    <5cb>   DW_AT_const_value : 0x2002b
 <2><5cf>: Abbrev Number: 19 (DW_TAG_enumerator)
    <5d0>   DW_AT_name        : ERA
    <5d4>   DW_AT_const_value : 0x2002c
 <2><5d8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5d9>   DW_AT_name        : (indirect string, offset: 0xbb6): __ERA_YEAR
    <5dd>   DW_AT_const_value : 0x2002d
 <2><5e1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x1287): ERA_D_FMT
    <5e6>   DW_AT_const_value : 0x2002e
 <2><5ea>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x1afa): ALT_DIGITS
    <5ef>   DW_AT_const_value : 0x2002f
 <2><5f3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x1d6a): ERA_D_T_FMT
    <5f8>   DW_AT_const_value : 0x20030
 <2><5fc>: Abbrev Number: 18 (DW_TAG_enumerator)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x12bf): ERA_T_FMT
    <601>   DW_AT_const_value : 0x20031
 <2><605>: Abbrev Number: 18 (DW_TAG_enumerator)
    <606>   DW_AT_name        : (indirect string, offset: 0x1710): _NL_TIME_ERA_NUM_ENTRIES
    <60a>   DW_AT_const_value : 0x20032
 <2><60e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <60f>   DW_AT_name        : (indirect string, offset: 0x11ad): _NL_TIME_ERA_ENTRIES
    <613>   DW_AT_const_value : 0x20033
 <2><617>: Abbrev Number: 18 (DW_TAG_enumerator)
    <618>   DW_AT_name        : (indirect string, offset: 0xfb3): _NL_WABDAY_1
    <61c>   DW_AT_const_value : 0x20034
 <2><620>: Abbrev Number: 18 (DW_TAG_enumerator)
    <621>   DW_AT_name        : (indirect string, offset: 0xfc0): _NL_WABDAY_2
    <625>   DW_AT_const_value : 0x20035
 <2><629>: Abbrev Number: 18 (DW_TAG_enumerator)
    <62a>   DW_AT_name        : (indirect string, offset: 0xb32): _NL_WABDAY_3
    <62e>   DW_AT_const_value : 0x20036
 <2><632>: Abbrev Number: 18 (DW_TAG_enumerator)
    <633>   DW_AT_name        : (indirect string, offset: 0xfd2): _NL_WABDAY_4
    <637>   DW_AT_const_value : 0x20037
 <2><63b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <63c>   DW_AT_name        : (indirect string, offset: 0xfdf): _NL_WABDAY_5
    <640>   DW_AT_const_value : 0x20038
 <2><644>: Abbrev Number: 18 (DW_TAG_enumerator)
    <645>   DW_AT_name        : (indirect string, offset: 0xfec): _NL_WABDAY_6
    <649>   DW_AT_const_value : 0x20039
 <2><64d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <64e>   DW_AT_name        : (indirect string, offset: 0xff9): _NL_WABDAY_7
    <652>   DW_AT_const_value : 0x2003a
 <2><656>: Abbrev Number: 18 (DW_TAG_enumerator)
    <657>   DW_AT_name        : (indirect string, offset: 0x1b15): _NL_WDAY_1
    <65b>   DW_AT_const_value : 0x2003b
 <2><65f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <660>   DW_AT_name        : (indirect string, offset: 0x1b20): _NL_WDAY_2
    <664>   DW_AT_const_value : 0x2003c
 <2><668>: Abbrev Number: 18 (DW_TAG_enumerator)
    <669>   DW_AT_name        : (indirect string, offset: 0x1b2b): _NL_WDAY_3
    <66d>   DW_AT_const_value : 0x2003d
 <2><671>: Abbrev Number: 18 (DW_TAG_enumerator)
    <672>   DW_AT_name        : (indirect string, offset: 0x1b36): _NL_WDAY_4
    <676>   DW_AT_const_value : 0x2003e
 <2><67a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <67b>   DW_AT_name        : (indirect string, offset: 0x1b41): _NL_WDAY_5
    <67f>   DW_AT_const_value : 0x2003f
 <2><683>: Abbrev Number: 18 (DW_TAG_enumerator)
    <684>   DW_AT_name        : (indirect string, offset: 0x1b4c): _NL_WDAY_6
    <688>   DW_AT_const_value : 0x20040
 <2><68c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <68d>   DW_AT_name        : (indirect string, offset: 0x1b57): _NL_WDAY_7
    <691>   DW_AT_const_value : 0x20041
 <2><695>: Abbrev Number: 18 (DW_TAG_enumerator)
    <696>   DW_AT_name        : (indirect string, offset: 0xd9): _NL_WABMON_1
    <69a>   DW_AT_const_value : 0x20042
 <2><69e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <69f>   DW_AT_name        : (indirect string, offset: 0xe6): _NL_WABMON_2
    <6a3>   DW_AT_const_value : 0x20043
 <2><6a7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6a8>   DW_AT_name        : (indirect string, offset: 0xf3): _NL_WABMON_3
    <6ac>   DW_AT_const_value : 0x20044
 <2><6b0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x100): _NL_WABMON_4
    <6b5>   DW_AT_const_value : 0x20045
 <2><6b9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x10d): _NL_WABMON_5
    <6be>   DW_AT_const_value : 0x20046
 <2><6c2>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x11a): _NL_WABMON_6
    <6c7>   DW_AT_const_value : 0x20047
 <2><6cb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x127): _NL_WABMON_7
    <6d0>   DW_AT_const_value : 0x20048
 <2><6d4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x134): _NL_WABMON_8
    <6d9>   DW_AT_const_value : 0x20049
 <2><6dd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x141): _NL_WABMON_9
    <6e2>   DW_AT_const_value : 0x2004a
 <2><6e6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x17a): _NL_WABMON_10
    <6eb>   DW_AT_const_value : 0x2004b
 <2><6ef>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x188): _NL_WABMON_11
    <6f4>   DW_AT_const_value : 0x2004c
 <2><6f8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x196): _NL_WABMON_12
    <6fd>   DW_AT_const_value : 0x2004d
 <2><701>: Abbrev Number: 18 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0x9f7): _NL_WMON_1
    <706>   DW_AT_const_value : 0x2004e
 <2><70a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <70b>   DW_AT_name        : (indirect string, offset: 0xa02): _NL_WMON_2
    <70f>   DW_AT_const_value : 0x2004f
 <2><713>: Abbrev Number: 18 (DW_TAG_enumerator)
    <714>   DW_AT_name        : (indirect string, offset: 0xa0d): _NL_WMON_3
    <718>   DW_AT_const_value : 0x20050
 <2><71c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <71d>   DW_AT_name        : (indirect string, offset: 0xa18): _NL_WMON_4
    <721>   DW_AT_const_value : 0x20051
 <2><725>: Abbrev Number: 18 (DW_TAG_enumerator)
    <726>   DW_AT_name        : (indirect string, offset: 0xa23): _NL_WMON_5
    <72a>   DW_AT_const_value : 0x20052
 <2><72e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <72f>   DW_AT_name        : (indirect string, offset: 0xa2e): _NL_WMON_6
    <733>   DW_AT_const_value : 0x20053
 <2><737>: Abbrev Number: 18 (DW_TAG_enumerator)
    <738>   DW_AT_name        : (indirect string, offset: 0xa39): _NL_WMON_7
    <73c>   DW_AT_const_value : 0x20054
 <2><740>: Abbrev Number: 18 (DW_TAG_enumerator)
    <741>   DW_AT_name        : (indirect string, offset: 0xa44): _NL_WMON_8
    <745>   DW_AT_const_value : 0x20055
 <2><749>: Abbrev Number: 18 (DW_TAG_enumerator)
    <74a>   DW_AT_name        : (indirect string, offset: 0xa4f): _NL_WMON_9
    <74e>   DW_AT_const_value : 0x20056
 <2><752>: Abbrev Number: 18 (DW_TAG_enumerator)
    <753>   DW_AT_name        : (indirect string, offset: 0x156): _NL_WMON_10
    <757>   DW_AT_const_value : 0x20057
 <2><75b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <75c>   DW_AT_name        : (indirect string, offset: 0x162): _NL_WMON_11
    <760>   DW_AT_const_value : 0x20058
 <2><764>: Abbrev Number: 18 (DW_TAG_enumerator)
    <765>   DW_AT_name        : (indirect string, offset: 0x16e): _NL_WMON_12
    <769>   DW_AT_const_value : 0x20059
 <2><76d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <76e>   DW_AT_name        : (indirect string, offset: 0xe00): _NL_WAM_STR
    <772>   DW_AT_const_value : 0x2005a
 <2><776>: Abbrev Number: 18 (DW_TAG_enumerator)
    <777>   DW_AT_name        : (indirect string, offset: 0xcf8): _NL_WPM_STR
    <77b>   DW_AT_const_value : 0x2005b
 <2><77f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0xe35): _NL_WD_T_FMT
    <784>   DW_AT_const_value : 0x2005c
 <2><788>: Abbrev Number: 18 (DW_TAG_enumerator)
    <789>   DW_AT_name        : (indirect string, offset: 0x5aa): _NL_WD_FMT
    <78d>   DW_AT_const_value : 0x2005d
 <2><791>: Abbrev Number: 18 (DW_TAG_enumerator)
    <792>   DW_AT_name        : (indirect string, offset: 0x5ce): _NL_WT_FMT
    <796>   DW_AT_const_value : 0x2005e
 <2><79a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <79b>   DW_AT_name        : (indirect string, offset: 0x1568): _NL_WT_FMT_AMPM
    <79f>   DW_AT_const_value : 0x2005f
 <2><7a3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x1be3): _NL_WERA_YEAR
    <7a8>   DW_AT_const_value : 0x20060
 <2><7ac>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x1282): _NL_WERA_D_FMT
    <7b1>   DW_AT_const_value : 0x20061
 <2><7b5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7b6>   DW_AT_name        : (indirect string, offset: 0x1af5): _NL_WALT_DIGITS
    <7ba>   DW_AT_const_value : 0x20062
 <2><7be>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7bf>   DW_AT_name        : (indirect string, offset: 0x1d65): _NL_WERA_D_T_FMT
    <7c3>   DW_AT_const_value : 0x20063
 <2><7c7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7c8>   DW_AT_name        : (indirect string, offset: 0x12ba): _NL_WERA_T_FMT
    <7cc>   DW_AT_const_value : 0x20064
 <2><7d0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7d1>   DW_AT_name        : (indirect string, offset: 0x13f5): _NL_TIME_WEEK_NDAYS
    <7d5>   DW_AT_const_value : 0x20065
 <2><7d9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7da>   DW_AT_name        : (indirect string, offset: 0x1da): _NL_TIME_WEEK_1STDAY
    <7de>   DW_AT_const_value : 0x20066
 <2><7e2>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xa5a): _NL_TIME_WEEK_1STWEEK
    <7e7>   DW_AT_const_value : 0x20067
 <2><7eb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xd3e): _NL_TIME_FIRST_WEEKDAY
    <7f0>   DW_AT_const_value : 0x20068
 <2><7f4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x158f): _NL_TIME_FIRST_WORKDAY
    <7f9>   DW_AT_const_value : 0x20069
 <2><7fd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x20): _NL_TIME_CAL_DIRECTION
    <802>   DW_AT_const_value : 0x2006a
 <2><806>: Abbrev Number: 18 (DW_TAG_enumerator)
    <807>   DW_AT_name        : (indirect string, offset: 0xf39): _NL_TIME_TIMEZONE
    <80b>   DW_AT_const_value : 0x2006b
 <2><80f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <810>   DW_AT_name        : (indirect string, offset: 0x13cf): _DATE_FMT
    <814>   DW_AT_const_value : 0x2006c
 <2><818>: Abbrev Number: 18 (DW_TAG_enumerator)
    <819>   DW_AT_name        : (indirect string, offset: 0x13ca): _NL_W_DATE_FMT
    <81d>   DW_AT_const_value : 0x2006d
 <2><821>: Abbrev Number: 18 (DW_TAG_enumerator)
    <822>   DW_AT_name        : (indirect string, offset: 0x16f7): _NL_TIME_CODESET
    <826>   DW_AT_const_value : 0x2006e
 <2><82a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <82b>   DW_AT_name        : (indirect string, offset: 0x1a87): __ALTMON_1
    <82f>   DW_AT_const_value : 0x2006f
 <2><833>: Abbrev Number: 18 (DW_TAG_enumerator)
    <834>   DW_AT_name        : (indirect string, offset: 0x1a92): __ALTMON_2
    <838>   DW_AT_const_value : 0x20070
 <2><83c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <83d>   DW_AT_name        : (indirect string, offset: 0x1a9d): __ALTMON_3
    <841>   DW_AT_const_value : 0x20071
 <2><845>: Abbrev Number: 18 (DW_TAG_enumerator)
    <846>   DW_AT_name        : (indirect string, offset: 0x1aa8): __ALTMON_4
    <84a>   DW_AT_const_value : 0x20072
 <2><84e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <84f>   DW_AT_name        : (indirect string, offset: 0x1ab3): __ALTMON_5
    <853>   DW_AT_const_value : 0x20073
 <2><857>: Abbrev Number: 18 (DW_TAG_enumerator)
    <858>   DW_AT_name        : (indirect string, offset: 0x1abe): __ALTMON_6
    <85c>   DW_AT_const_value : 0x20074
 <2><860>: Abbrev Number: 18 (DW_TAG_enumerator)
    <861>   DW_AT_name        : (indirect string, offset: 0x1ac9): __ALTMON_7
    <865>   DW_AT_const_value : 0x20075
 <2><869>: Abbrev Number: 18 (DW_TAG_enumerator)
    <86a>   DW_AT_name        : (indirect string, offset: 0x1ad4): __ALTMON_8
    <86e>   DW_AT_const_value : 0x20076
 <2><872>: Abbrev Number: 18 (DW_TAG_enumerator)
    <873>   DW_AT_name        : (indirect string, offset: 0x1adf): __ALTMON_9
    <877>   DW_AT_const_value : 0x20077
 <2><87b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <87c>   DW_AT_name        : (indirect string, offset: 0x789): __ALTMON_10
    <880>   DW_AT_const_value : 0x20078
 <2><884>: Abbrev Number: 18 (DW_TAG_enumerator)
    <885>   DW_AT_name        : (indirect string, offset: 0x795): __ALTMON_11
    <889>   DW_AT_const_value : 0x20079
 <2><88d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <88e>   DW_AT_name        : (indirect string, offset: 0x7a1): __ALTMON_12
    <892>   DW_AT_const_value : 0x2007a
 <2><896>: Abbrev Number: 18 (DW_TAG_enumerator)
    <897>   DW_AT_name        : (indirect string, offset: 0xa70): _NL_WALTMON_1
    <89b>   DW_AT_const_value : 0x2007b
 <2><89f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a0>   DW_AT_name        : (indirect string, offset: 0xa7e): _NL_WALTMON_2
    <8a4>   DW_AT_const_value : 0x2007c
 <2><8a8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xa8c): _NL_WALTMON_3
    <8ad>   DW_AT_const_value : 0x2007d
 <2><8b1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xa9a): _NL_WALTMON_4
    <8b6>   DW_AT_const_value : 0x2007e
 <2><8ba>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xaa8): _NL_WALTMON_5
    <8bf>   DW_AT_const_value : 0x2007f
 <2><8c3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xab6): _NL_WALTMON_6
    <8c8>   DW_AT_const_value : 0x20080
 <2><8cc>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8cd>   DW_AT_name        : (indirect string, offset: 0xac4): _NL_WALTMON_7
    <8d1>   DW_AT_const_value : 0x20081
 <2><8d5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xad2): _NL_WALTMON_8
    <8da>   DW_AT_const_value : 0x20082
 <2><8de>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8df>   DW_AT_name        : (indirect string, offset: 0xae0): _NL_WALTMON_9
    <8e3>   DW_AT_const_value : 0x20083
 <2><8e7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x18b0): _NL_WALTMON_10
    <8ec>   DW_AT_const_value : 0x20084
 <2><8f0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x18bf): _NL_WALTMON_11
    <8f5>   DW_AT_const_value : 0x20085
 <2><8f9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x18ce): _NL_WALTMON_12
    <8fe>   DW_AT_const_value : 0x20086
 <2><902>: Abbrev Number: 18 (DW_TAG_enumerator)
    <903>   DW_AT_name        : (indirect string, offset: 0x49): _NL_ABALTMON_1
    <907>   DW_AT_const_value : 0x20087
 <2><90b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <90c>   DW_AT_name        : (indirect string, offset: 0x58): _NL_ABALTMON_2
    <910>   DW_AT_const_value : 0x20088
 <2><914>: Abbrev Number: 18 (DW_TAG_enumerator)
    <915>   DW_AT_name        : (indirect string, offset: 0x67): _NL_ABALTMON_3
    <919>   DW_AT_const_value : 0x20089
 <2><91d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0x76): _NL_ABALTMON_4
    <922>   DW_AT_const_value : 0x2008a
 <2><926>: Abbrev Number: 18 (DW_TAG_enumerator)
    <927>   DW_AT_name        : (indirect string, offset: 0x85): _NL_ABALTMON_5
    <92b>   DW_AT_const_value : 0x2008b
 <2><92f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x94): _NL_ABALTMON_6
    <934>   DW_AT_const_value : 0x2008c
 <2><938>: Abbrev Number: 18 (DW_TAG_enumerator)
    <939>   DW_AT_name        : (indirect string, offset: 0xa3): _NL_ABALTMON_7
    <93d>   DW_AT_const_value : 0x2008d
 <2><941>: Abbrev Number: 18 (DW_TAG_enumerator)
    <942>   DW_AT_name        : (indirect string, offset: 0xb2): _NL_ABALTMON_8
    <946>   DW_AT_const_value : 0x2008e
 <2><94a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <94b>   DW_AT_name        : (indirect string, offset: 0xc1): _NL_ABALTMON_9
    <94f>   DW_AT_const_value : 0x2008f
 <2><953>: Abbrev Number: 18 (DW_TAG_enumerator)
    <954>   DW_AT_name        : (indirect string, offset: 0x196e): _NL_ABALTMON_10
    <958>   DW_AT_const_value : 0x20090
 <2><95c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <95d>   DW_AT_name        : (indirect string, offset: 0x197e): _NL_ABALTMON_11
    <961>   DW_AT_const_value : 0x20091
 <2><965>: Abbrev Number: 18 (DW_TAG_enumerator)
    <966>   DW_AT_name        : (indirect string, offset: 0x198e): _NL_ABALTMON_12
    <96a>   DW_AT_const_value : 0x20092
 <2><96e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <96f>   DW_AT_name        : (indirect string, offset: 0x173b): _NL_WABALTMON_1
    <973>   DW_AT_const_value : 0x20093
 <2><977>: Abbrev Number: 18 (DW_TAG_enumerator)
    <978>   DW_AT_name        : (indirect string, offset: 0x174b): _NL_WABALTMON_2
    <97c>   DW_AT_const_value : 0x20094
 <2><980>: Abbrev Number: 18 (DW_TAG_enumerator)
    <981>   DW_AT_name        : (indirect string, offset: 0x175b): _NL_WABALTMON_3
    <985>   DW_AT_const_value : 0x20095
 <2><989>: Abbrev Number: 18 (DW_TAG_enumerator)
    <98a>   DW_AT_name        : (indirect string, offset: 0x176b): _NL_WABALTMON_4
    <98e>   DW_AT_const_value : 0x20096
 <2><992>: Abbrev Number: 18 (DW_TAG_enumerator)
    <993>   DW_AT_name        : (indirect string, offset: 0x177b): _NL_WABALTMON_5
    <997>   DW_AT_const_value : 0x20097
 <2><99b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <99c>   DW_AT_name        : (indirect string, offset: 0x178b): _NL_WABALTMON_6
    <9a0>   DW_AT_const_value : 0x20098
 <2><9a4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x179b): _NL_WABALTMON_7
    <9a9>   DW_AT_const_value : 0x20099
 <2><9ad>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x17ab): _NL_WABALTMON_8
    <9b2>   DW_AT_const_value : 0x2009a
 <2><9b6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x17bb): _NL_WABALTMON_9
    <9bb>   DW_AT_const_value : 0x2009b
 <2><9bf>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x133f): _NL_WABALTMON_10
    <9c4>   DW_AT_const_value : 0x2009c
 <2><9c8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x1350): _NL_WABALTMON_11
    <9cd>   DW_AT_const_value : 0x2009d
 <2><9d1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x1361): _NL_WABALTMON_12
    <9d6>   DW_AT_const_value : 0x2009e
 <2><9da>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9db>   DW_AT_name        : (indirect string, offset: 0x1f50): _NL_NUM_LC_TIME
    <9df>   DW_AT_const_value : 0x2009f
 <2><9e3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x15c2): _NL_COLLATE_NRULES
    <9e8>   DW_AT_const_value : 0x30000
 <2><9ec>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x748): _NL_COLLATE_RULESETS
    <9f1>   DW_AT_const_value : 0x30001
 <2><9f5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x1532): _NL_COLLATE_TABLEMB
    <9fa>   DW_AT_const_value : 0x30002
 <2><9fe>: Abbrev Number: 18 (DW_TAG_enumerator)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x1f92): _NL_COLLATE_WEIGHTMB
    <a03>   DW_AT_const_value : 0x30003
 <2><a07>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a08>   DW_AT_name        : (indirect string, offset: 0x12c9): _NL_COLLATE_EXTRAMB
    <a0c>   DW_AT_const_value : 0x30004
 <2><a10>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a11>   DW_AT_name        : (indirect string, offset: 0x504): _NL_COLLATE_INDIRECTMB
    <a15>   DW_AT_const_value : 0x30005
 <2><a19>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x2198): _NL_COLLATE_GAP1
    <a1e>   DW_AT_const_value : 0x30006
 <2><a22>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a23>   DW_AT_name        : (indirect string, offset: 0x21a9): _NL_COLLATE_GAP2
    <a27>   DW_AT_const_value : 0x30007
 <2><a2b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x21ba): _NL_COLLATE_GAP3
    <a30>   DW_AT_const_value : 0x30008
 <2><a34>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a35>   DW_AT_name        : (indirect string, offset: 0x3bc): _NL_COLLATE_TABLEWC
    <a39>   DW_AT_const_value : 0x30009
 <2><a3d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x328): _NL_COLLATE_WEIGHTWC
    <a42>   DW_AT_const_value : 0x3000a
 <2><a46>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a47>   DW_AT_name        : (indirect string, offset: 0xf4b): _NL_COLLATE_EXTRAWC
    <a4b>   DW_AT_const_value : 0x3000b
 <2><a4f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a50>   DW_AT_name        : (indirect string, offset: 0x9e0): _NL_COLLATE_INDIRECTWC
    <a54>   DW_AT_const_value : 0x3000c
 <2><a58>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0x576): _NL_COLLATE_SYMB_HASH_SIZEMB
    <a5d>   DW_AT_const_value : 0x3000d
 <2><a61>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a62>   DW_AT_name        : (indirect string, offset: 0x1390): _NL_COLLATE_SYMB_TABLEMB
    <a66>   DW_AT_const_value : 0x3000e
 <2><a6a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x92e): _NL_COLLATE_SYMB_EXTRAMB
    <a6f>   DW_AT_const_value : 0x3000f
 <2><a73>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a74>   DW_AT_name        : (indirect string, offset: 0x1428): _NL_COLLATE_COLLSEQMB
    <a78>   DW_AT_const_value : 0x30010
 <2><a7c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x1a0b): _NL_COLLATE_COLLSEQWC
    <a81>   DW_AT_const_value : 0x30011
 <2><a85>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a86>   DW_AT_name        : (indirect string, offset: 0x264): _NL_COLLATE_CODESET
    <a8a>   DW_AT_const_value : 0x30012
 <2><a8e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x2085): _NL_NUM_LC_COLLATE
    <a93>   DW_AT_const_value : 0x30013
 <2><a97>: Abbrev Number: 20 (DW_TAG_enumerator)
    <a98>   DW_AT_name        : (indirect string, offset: 0x915): _NL_CTYPE_CLASS
    <a9c>   DW_AT_const_value : 0
 <2><a9d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x722): _NL_CTYPE_TOUPPER
    <aa2>   DW_AT_const_value : 1
 <2><aa3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aa4>   DW_AT_name        : (indirect string, offset: 0xd6c): _NL_CTYPE_GAP1
    <aa8>   DW_AT_const_value : 2
 <2><aa9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aaa>   DW_AT_name        : (indirect string, offset: 0x132d): _NL_CTYPE_TOLOWER
    <aae>   DW_AT_const_value : 3
 <2><aaf>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ab0>   DW_AT_name        : (indirect string, offset: 0xd7b): _NL_CTYPE_GAP2
    <ab4>   DW_AT_const_value : 4
 <2><ab5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x1fa7): _NL_CTYPE_CLASS32
    <aba>   DW_AT_const_value : 5
 <2><abb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0xd8a): _NL_CTYPE_GAP3
    <ac0>   DW_AT_const_value : 6
 <2><ac1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ac2>   DW_AT_name        : (indirect string, offset: 0xd99): _NL_CTYPE_GAP4
    <ac6>   DW_AT_const_value : 7
 <2><ac7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ac8>   DW_AT_name        : (indirect string, offset: 0xda8): _NL_CTYPE_GAP5
    <acc>   DW_AT_const_value : 8
 <2><acd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ace>   DW_AT_name        : (indirect string, offset: 0xdb7): _NL_CTYPE_GAP6
    <ad2>   DW_AT_const_value : 9
 <2><ad3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x696): _NL_CTYPE_CLASS_NAMES
    <ad8>   DW_AT_const_value : 10
 <2><ad9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ada>   DW_AT_name        : (indirect string, offset: 0xaee): _NL_CTYPE_MAP_NAMES
    <ade>   DW_AT_const_value : 11
 <2><adf>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x1c11): _NL_CTYPE_WIDTH
    <ae4>   DW_AT_const_value : 12
 <2><ae5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x655): _NL_CTYPE_MB_CUR_MAX
    <aea>   DW_AT_const_value : 13
 <2><aeb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <aec>   DW_AT_name        : (indirect string, offset: 0xc06): _NL_CTYPE_CODESET_NAME
    <af0>   DW_AT_const_value : 14
 <2><af1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <af2>   DW_AT_name        : (indirect string, offset: 0x17eb): CODESET
    <af6>   DW_AT_const_value : 14
 <2><af7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <af8>   DW_AT_name        : (indirect string, offset: 0xbc1): _NL_CTYPE_TOUPPER32
    <afc>   DW_AT_const_value : 15
 <2><afd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <afe>   DW_AT_name        : (indirect string, offset: 0x734): _NL_CTYPE_TOLOWER32
    <b02>   DW_AT_const_value : 16
 <2><b03>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b04>   DW_AT_name        : (indirect string, offset: 0x1551): _NL_CTYPE_CLASS_OFFSET
    <b08>   DW_AT_const_value : 17
 <2><b09>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x1cdd): _NL_CTYPE_MAP_OFFSET
    <b0e>   DW_AT_const_value : 18
 <2><b0f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b10>   DW_AT_name        : (indirect string, offset: 0xc92): _NL_CTYPE_INDIGITS_MB_LEN
    <b14>   DW_AT_const_value : 19
 <2><b15>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b16>   DW_AT_name        : (indirect string, offset: 0x1187): _NL_CTYPE_INDIGITS0_MB
    <b1a>   DW_AT_const_value : 20
 <2><b1b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x1bd): _NL_CTYPE_INDIGITS1_MB
    <b20>   DW_AT_const_value : 21
 <2><b21>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b22>   DW_AT_name        : (indirect string, offset: 0x1006): _NL_CTYPE_INDIGITS2_MB
    <b26>   DW_AT_const_value : 22
 <2><b27>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b28>   DW_AT_name        : (indirect string, offset: 0x2293): _NL_CTYPE_INDIGITS3_MB
    <b2c>   DW_AT_const_value : 23
 <2><b2d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xebe): _NL_CTYPE_INDIGITS4_MB
    <b32>   DW_AT_const_value : 24
 <2><b33>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b34>   DW_AT_name        : (indirect string, offset: 0x206e): _NL_CTYPE_INDIGITS5_MB
    <b38>   DW_AT_const_value : 25
 <2><b39>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xe0c): _NL_CTYPE_INDIGITS6_MB
    <b3e>   DW_AT_const_value : 26
 <2><b3f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b40>   DW_AT_name        : (indirect string, offset: 0x1f39): _NL_CTYPE_INDIGITS7_MB
    <b44>   DW_AT_const_value : 27
 <2><b45>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b46>   DW_AT_name        : (indirect string, offset: 0xcac): _NL_CTYPE_INDIGITS8_MB
    <b4a>   DW_AT_const_value : 28
 <2><b4b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x1de3): _NL_CTYPE_INDIGITS9_MB
    <b50>   DW_AT_const_value : 29
 <2><b51>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b52>   DW_AT_name        : (indirect string, offset: 0x1dc9): _NL_CTYPE_INDIGITS_WC_LEN
    <b56>   DW_AT_const_value : 30
 <2><b57>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b58>   DW_AT_name        : (indirect string, offset: 0x16e0): _NL_CTYPE_INDIGITS0_WC
    <b5c>   DW_AT_const_value : 31
 <2><b5d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x6d2): _NL_CTYPE_INDIGITS1_WC
    <b62>   DW_AT_const_value : 32
 <2><b63>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b64>   DW_AT_name        : (indirect string, offset: 0x15e6): _NL_CTYPE_INDIGITS2_WC
    <b68>   DW_AT_const_value : 33
 <2><b69>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x593): _NL_CTYPE_INDIGITS3_WC
    <b6e>   DW_AT_const_value : 34
 <2><b6f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b70>   DW_AT_name        : (indirect string, offset: 0x1487): _NL_CTYPE_INDIGITS4_WC
    <b74>   DW_AT_const_value : 35
 <2><b75>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b76>   DW_AT_name        : (indirect string, offset: 0x3dc): _NL_CTYPE_INDIGITS5_WC
    <b7a>   DW_AT_const_value : 36
 <2><b7b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x1379): _NL_CTYPE_INDIGITS6_WC
    <b80>   DW_AT_const_value : 37
 <2><b81>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b82>   DW_AT_name        : (indirect string, offset: 0x2fa): _NL_CTYPE_INDIGITS7_WC
    <b86>   DW_AT_const_value : 38
 <2><b87>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b88>   DW_AT_name        : (indirect string, offset: 0x1249): _NL_CTYPE_INDIGITS8_WC
    <b8c>   DW_AT_const_value : 39
 <2><b8d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x24d): _NL_CTYPE_INDIGITS9_WC
    <b92>   DW_AT_const_value : 40
 <2><b93>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b94>   DW_AT_name        : (indirect string, offset: 0xf74): _NL_CTYPE_OUTDIGIT0_MB
    <b98>   DW_AT_const_value : 41
 <2><b99>: Abbrev Number: 20 (DW_TAG_enumerator)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x21dd): _NL_CTYPE_OUTDIGIT1_MB
    <b9e>   DW_AT_const_value : 42
 <2><b9f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ba0>   DW_AT_name        : (indirect string, offset: 0xe5e): _NL_CTYPE_OUTDIGIT2_MB
    <ba4>   DW_AT_const_value : 43
 <2><ba5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x1fc3): _NL_CTYPE_OUTDIGIT3_MB
    <baa>   DW_AT_const_value : 44
 <2><bab>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bac>   DW_AT_name        : (indirect string, offset: 0xd55): _NL_CTYPE_OUTDIGIT4_MB
    <bb0>   DW_AT_const_value : 45
 <2><bb1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x1eb5): _NL_CTYPE_OUTDIGIT5_MB
    <bb6>   DW_AT_const_value : 46
 <2><bb7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bb8>   DW_AT_name        : (indirect string, offset: 0xc58): _NL_CTYPE_OUTDIGIT6_MB
    <bbc>   DW_AT_const_value : 47
 <2><bbd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x1d39): _NL_CTYPE_OUTDIGIT7_MB
    <bc2>   DW_AT_const_value : 48
 <2><bc3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bc4>   DW_AT_name        : (indirect string, offset: 0xb90): _NL_CTYPE_OUTDIGIT8_MB
    <bc8>   DW_AT_const_value : 49
 <2><bc9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bca>   DW_AT_name        : (indirect string, offset: 0x17f3): _NL_CTYPE_OUTDIGIT9_MB
    <bce>   DW_AT_const_value : 50
 <2><bcf>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x1578): _NL_CTYPE_OUTDIGIT0_WC
    <bd4>   DW_AT_const_value : 51
 <2><bd5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x4d4): _NL_CTYPE_OUTDIGIT1_WC
    <bda>   DW_AT_const_value : 52
 <2><bdb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x1451): _NL_CTYPE_OUTDIGIT2_WC
    <be0>   DW_AT_const_value : 53
 <2><be1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <be2>   DW_AT_name        : (indirect string, offset: 0x388): _NL_CTYPE_OUTDIGIT3_WC
    <be6>   DW_AT_const_value : 54
 <2><be7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <be8>   DW_AT_name        : (indirect string, offset: 0x1307): _NL_CTYPE_OUTDIGIT4_WC
    <bec>   DW_AT_const_value : 55
 <2><bed>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bee>   DW_AT_name        : (indirect string, offset: 0x296): _NL_CTYPE_OUTDIGIT5_WC
    <bf2>   DW_AT_const_value : 56
 <2><bf3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x11c2): _NL_CTYPE_OUTDIGIT6_WC
    <bf8>   DW_AT_const_value : 57
 <2><bf9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x207): _NL_CTYPE_OUTDIGIT7_WC
    <bfe>   DW_AT_const_value : 58
 <2><bff>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c00>   DW_AT_name        : (indirect string, offset: 0x1053): _NL_CTYPE_OUTDIGIT8_WC
    <c04>   DW_AT_const_value : 59
 <2><c05>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c06>   DW_AT_name        : (indirect string, offset: 0x0): _NL_CTYPE_OUTDIGIT9_WC
    <c0a>   DW_AT_const_value : 60
 <2><c0b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x15a6): _NL_CTYPE_TRANSLIT_TAB_SIZE
    <c10>   DW_AT_const_value : 61
 <2><c11>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c12>   DW_AT_name        : (indirect string, offset: 0x1e10): _NL_CTYPE_TRANSLIT_FROM_IDX
    <c16>   DW_AT_const_value : 62
 <2><c17>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c18>   DW_AT_name        : (indirect string, offset: 0x1f0b): _NL_CTYPE_TRANSLIT_FROM_TBL
    <c1c>   DW_AT_const_value : 63
 <2><c1d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c1e>   DW_AT_name        : (indirect string, offset: 0x1c75): _NL_CTYPE_TRANSLIT_TO_IDX
    <c22>   DW_AT_const_value : 64
 <2><c23>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c24>   DW_AT_name        : (indirect string, offset: 0x1d93): _NL_CTYPE_TRANSLIT_TO_TBL
    <c28>   DW_AT_const_value : 65
 <2><c29>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x1938): _NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN
    <c2e>   DW_AT_const_value : 66
 <2><c2f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c30>   DW_AT_name        : (indirect string, offset: 0x21f4): _NL_CTYPE_TRANSLIT_DEFAULT_MISSING
    <c34>   DW_AT_const_value : 67
 <2><c35>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c36>   DW_AT_name        : (indirect string, offset: 0x199e): _NL_CTYPE_TRANSLIT_IGNORE_LEN
    <c3a>   DW_AT_const_value : 68
 <2><c3b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x1a6d): _NL_CTYPE_TRANSLIT_IGNORE
    <c40>   DW_AT_const_value : 69
 <2><c41>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c42>   DW_AT_name        : (indirect string, offset: 0xd04): _NL_CTYPE_MAP_TO_NONASCII
    <c46>   DW_AT_const_value : 70
 <2><c47>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c48>   DW_AT_name        : (indirect string, offset: 0x67e): _NL_CTYPE_NONASCII_CASE
    <c4c>   DW_AT_const_value : 71
 <2><c4d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c4e>   DW_AT_name        : (indirect string, offset: 0x20c5): _NL_CTYPE_EXTRA_MAP_1
    <c52>   DW_AT_const_value : 72
 <2><c53>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c54>   DW_AT_name        : (indirect string, offset: 0x51b): _NL_CTYPE_EXTRA_MAP_2
    <c58>   DW_AT_const_value : 73
 <2><c59>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x20db): _NL_CTYPE_EXTRA_MAP_3
    <c5e>   DW_AT_const_value : 74
 <2><c5f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c60>   DW_AT_name        : (indirect string, offset: 0x20f1): _NL_CTYPE_EXTRA_MAP_4
    <c64>   DW_AT_const_value : 75
 <2><c65>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c66>   DW_AT_name        : (indirect string, offset: 0x2107): _NL_CTYPE_EXTRA_MAP_5
    <c6a>   DW_AT_const_value : 76
 <2><c6b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x211d): _NL_CTYPE_EXTRA_MAP_6
    <c70>   DW_AT_const_value : 77
 <2><c71>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c72>   DW_AT_name        : (indirect string, offset: 0x2133): _NL_CTYPE_EXTRA_MAP_7
    <c76>   DW_AT_const_value : 78
 <2><c77>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c78>   DW_AT_name        : (indirect string, offset: 0x2149): _NL_CTYPE_EXTRA_MAP_8
    <c7c>   DW_AT_const_value : 79
 <2><c7d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x215f): _NL_CTYPE_EXTRA_MAP_9
    <c82>   DW_AT_const_value : 80
 <2><c83>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c84>   DW_AT_name        : (indirect string, offset: 0x1fda): _NL_CTYPE_EXTRA_MAP_10
    <c88>   DW_AT_const_value : 81
 <2><c89>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x1ff1): _NL_CTYPE_EXTRA_MAP_11
    <c8e>   DW_AT_const_value : 82
 <2><c8f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c90>   DW_AT_name        : (indirect string, offset: 0x2008): _NL_CTYPE_EXTRA_MAP_12
    <c94>   DW_AT_const_value : 83
 <2><c95>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c96>   DW_AT_name        : (indirect string, offset: 0x201f): _NL_CTYPE_EXTRA_MAP_13
    <c9a>   DW_AT_const_value : 84
 <2><c9b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x2036): _NL_CTYPE_EXTRA_MAP_14
    <ca0>   DW_AT_const_value : 85
 <2><ca1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x1029): _NL_NUM_LC_CTYPE
    <ca6>   DW_AT_const_value : 86
 <2><ca7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x7ad): __INT_CURR_SYMBOL
    <cac>   DW_AT_const_value : 0x40000
 <2><cb0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xce6): __CURRENCY_SYMBOL
    <cb5>   DW_AT_const_value : 0x40001
 <2><cb9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cba>   DW_AT_name        : (indirect string, offset: 0x43e): __MON_DECIMAL_POINT
    <cbe>   DW_AT_const_value : 0x40002
 <2><cc2>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x1bcf): __MON_THOUSANDS_SEP
    <cc7>   DW_AT_const_value : 0x40003
 <2><ccb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x1b62): __MON_GROUPING
    <cd0>   DW_AT_const_value : 0x40004
 <2><cd4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x183a): __POSITIVE_SIGN
    <cd9>   DW_AT_const_value : 0x40005
 <2><cdd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cde>   DW_AT_name        : (indirect string, offset: 0x1a5d): __NEGATIVE_SIGN
    <ce2>   DW_AT_const_value : 0x40006
 <2><ce6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x10aa): __INT_FRAC_DIGITS
    <ceb>   DW_AT_const_value : 0x40007
 <2><cef>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xfa5): __FRAC_DIGITS
    <cf4>   DW_AT_const_value : 0x40008
 <2><cf8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x75d): __P_CS_PRECEDES
    <cfd>   DW_AT_const_value : 0x40009
 <2><d01>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d02>   DW_AT_name        : (indirect string, offset: 0x1660): __P_SEP_BY_SPACE
    <d06>   DW_AT_const_value : 0x4000a
 <2><d0a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x1c3d): __N_CS_PRECEDES
    <d0f>   DW_AT_const_value : 0x4000b
 <2><d13>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d14>   DW_AT_name        : (indirect string, offset: 0x33d): __N_SEP_BY_SPACE
    <d18>   DW_AT_const_value : 0x4000c
 <2><d1c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x5d9): __P_SIGN_POSN
    <d21>   DW_AT_const_value : 0x4000d
 <2><d25>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d26>   DW_AT_name        : (indirect string, offset: 0x1c67): __N_SIGN_POSN
    <d2a>   DW_AT_const_value : 0x4000e
 <2><d2e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x550): _NL_MONETARY_CRNCYSTR
    <d33>   DW_AT_const_value : 0x4000f
 <2><d37>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d38>   DW_AT_name        : (indirect string, offset: 0x1b71): __INT_P_CS_PRECEDES
    <d3c>   DW_AT_const_value : 0x40010
 <2><d40>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d41>   DW_AT_name        : (indirect string, offset: 0x3ff): __INT_P_SEP_BY_SPACE
    <d45>   DW_AT_const_value : 0x40011
 <2><d49>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x1d1c): __INT_N_CS_PRECEDES
    <d4e>   DW_AT_const_value : 0x40012
 <2><d52>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d53>   DW_AT_name        : (indirect string, offset: 0x164b): __INT_N_SEP_BY_SPACE
    <d57>   DW_AT_const_value : 0x40013
 <2><d5b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x18e6): __INT_P_SIGN_POSN
    <d60>   DW_AT_const_value : 0x40014
 <2><d64>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d65>   DW_AT_name        : (indirect string, offset: 0xdc6): __INT_N_SIGN_POSN
    <d69>   DW_AT_const_value : 0x40015
 <2><d6d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x1a3c): _NL_MONETARY_DUO_INT_CURR_SYMBOL
    <d72>   DW_AT_const_value : 0x40016
 <2><d76>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0x204d): _NL_MONETARY_DUO_CURRENCY_SYMBOL
    <d7b>   DW_AT_const_value : 0x40017
 <2><d7f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d80>   DW_AT_name        : (indirect string, offset: 0x149e): _NL_MONETARY_DUO_INT_FRAC_DIGITS
    <d84>   DW_AT_const_value : 0x40018
 <2><d88>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0x1cff): _NL_MONETARY_DUO_FRAC_DIGITS
    <d8d>   DW_AT_const_value : 0x40019
 <2><d91>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x1513): _NL_MONETARY_DUO_P_CS_PRECEDES
    <d96>   DW_AT_const_value : 0x4001a
 <2><d9a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x1291): _NL_MONETARY_DUO_P_SEP_BY_SPACE
    <d9f>   DW_AT_const_value : 0x4001b
 <2><da3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <da4>   DW_AT_name        : (indirect string, offset: 0x1468): _NL_MONETARY_DUO_N_CS_PRECEDES
    <da8>   DW_AT_const_value : 0x4001c
 <2><dac>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dad>   DW_AT_name        : (indirect string, offset: 0xd1e): _NL_MONETARY_DUO_N_SEP_BY_SPACE
    <db1>   DW_AT_const_value : 0x4001d
 <2><db5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x10f3): _NL_MONETARY_DUO_INT_P_CS_PRECEDES
    <dba>   DW_AT_const_value : 0x4001e
 <2><dbe>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x48f): _NL_MONETARY_DUO_INT_P_SEP_BY_SPACE
    <dc3>   DW_AT_const_value : 0x4001f
 <2><dc7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x107f): _NL_MONETARY_DUO_INT_N_CS_PRECEDES
    <dcc>   DW_AT_const_value : 0x40020
 <2><dd0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x115c): _NL_MONETARY_DUO_INT_N_SEP_BY_SPACE
    <dd5>   DW_AT_const_value : 0x40021
 <2><dd9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dda>   DW_AT_name        : (indirect string, offset: 0x10bc): _NL_MONETARY_DUO_P_SIGN_POSN
    <dde>   DW_AT_const_value : 0x40022
 <2><de2>: Abbrev Number: 18 (DW_TAG_enumerator)
    <de3>   DW_AT_name        : (indirect string, offset: 0x705): _NL_MONETARY_DUO_N_SIGN_POSN
    <de7>   DW_AT_const_value : 0x40023
 <2><deb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dec>   DW_AT_name        : (indirect string, offset: 0x98d): _NL_MONETARY_DUO_INT_P_SIGN_POSN
    <df0>   DW_AT_const_value : 0x40024
 <2><df4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <df5>   DW_AT_name        : (indirect string, offset: 0x2226): _NL_MONETARY_DUO_INT_N_SIGN_POSN
    <df9>   DW_AT_const_value : 0x40025
 <2><dfd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x1129): _NL_MONETARY_UNO_VALID_FROM
    <e02>   DW_AT_const_value : 0x40026
 <2><e06>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e07>   DW_AT_name        : (indirect string, offset: 0x621): _NL_MONETARY_UNO_VALID_TO
    <e0b>   DW_AT_const_value : 0x40027
 <2><e0f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0x13d9): _NL_MONETARY_DUO_VALID_FROM
    <e14>   DW_AT_const_value : 0x40028
 <2><e18>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e19>   DW_AT_name        : (indirect string, offset: 0x180a): _NL_MONETARY_DUO_VALID_TO
    <e1d>   DW_AT_const_value : 0x40029
 <2><e21>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0x8da): _NL_MONETARY_CONVERSION_RATE
    <e26>   DW_AT_const_value : 0x4002a
 <2><e2a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e2b>   DW_AT_name        : (indirect string, offset: 0xde2): _NL_MONETARY_DECIMAL_POINT_WC
    <e2f>   DW_AT_const_value : 0x4002b
 <2><e33>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0x6b4): _NL_MONETARY_THOUSANDS_SEP_WC
    <e38>   DW_AT_const_value : 0x4002c
 <2><e3c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x1409): _NL_MONETARY_CODESET
    <e41>   DW_AT_const_value : 0x4002d
 <2><e45>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e46>   DW_AT_name        : (indirect string, offset: 0xe75): _NL_NUM_LC_MONETARY
    <e4a>   DW_AT_const_value : 0x4002e
 <2><e4e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x1b05): __DECIMAL_POINT
    <e53>   DW_AT_const_value : 0x10000
 <2><e57>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e58>   DW_AT_name        : (indirect string, offset: 0xdd8): RADIXCHAR
    <e5c>   DW_AT_const_value : 0x10000
 <2><e60>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0x103a): __THOUSANDS_SEP
    <e65>   DW_AT_const_value : 0x10001
 <2><e69>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x28e): THOUSEP
    <e6e>   DW_AT_const_value : 0x10001
 <2><e72>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e73>   DW_AT_name        : (indirect string, offset: 0x2ef): __GROUPING
    <e77>   DW_AT_const_value : 0x10002
 <2><e7b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x36b): _NL_NUMERIC_DECIMAL_POINT_WC
    <e80>   DW_AT_const_value : 0x10003
 <2><e84>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e85>   DW_AT_name        : (indirect string, offset: 0x1d76): _NL_NUMERIC_THOUSANDS_SEP_WC
    <e89>   DW_AT_const_value : 0x10004
 <2><e8d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x17df): _NL_NUMERIC_CODESET
    <e92>   DW_AT_const_value : 0x10005
 <2><e96>: Abbrev Number: 18 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x1f7f): _NL_NUM_LC_NUMERIC
    <e9b>   DW_AT_const_value : 0x10006
 <2><e9f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x141e): __YESEXPR
    <ea4>   DW_AT_const_value : 0x50000
 <2><ea8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x1d30): __NOEXPR
    <ead>   DW_AT_const_value : 0x50001
 <2><eb1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x234): __YESSTR
    <eb6>   DW_AT_const_value : 0x50002
 <2><eba>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x1449): __NOSTR
    <ebf>   DW_AT_const_value : 0x50003
 <2><ec3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x2247): _NL_MESSAGES_CODESET
    <ec8>   DW_AT_const_value : 0x50004
 <2><ecc>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x17cb): _NL_NUM_LC_MESSAGES
    <ed1>   DW_AT_const_value : 0x50005
 <2><ed5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x19cf): _NL_PAPER_HEIGHT
    <eda>   DW_AT_const_value : 0x70000
 <2><ede>: Abbrev Number: 18 (DW_TAG_enumerator)
    <edf>   DW_AT_name        : (indirect string, offset: 0x1c4d): _NL_PAPER_WIDTH
    <ee3>   DW_AT_const_value : 0x70001
 <2><ee7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ee8>   DW_AT_name        : (indirect string, offset: 0xee5): _NL_PAPER_CODESET
    <eec>   DW_AT_const_value : 0x70002
 <2><ef0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xbd5): _NL_NUM_LC_PAPER
    <ef5>   DW_AT_const_value : 0x70003
 <2><ef9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <efa>   DW_AT_name        : (indirect string, offset: 0xbf4): _NL_NAME_NAME_FMT
    <efe>   DW_AT_const_value : 0x80000
 <2><f02>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f03>   DW_AT_name        : (indirect string, offset: 0xb15): _NL_NAME_NAME_GEN
    <f07>   DW_AT_const_value : 0x80001
 <2><f0b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x22c5): _NL_NAME_NAME_MR
    <f10>   DW_AT_const_value : 0x80002
 <2><f14>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f15>   DW_AT_name        : (indirect string, offset: 0x47d): _NL_NAME_NAME_MRS
    <f19>   DW_AT_const_value : 0x80003
 <2><f1d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xb02): _NL_NAME_NAME_MISS
    <f22>   DW_AT_const_value : 0x80004
 <2><f26>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f27>   DW_AT_name        : (indirect string, offset: 0x22d6): _NL_NAME_NAME_MS
    <f2b>   DW_AT_const_value : 0x80005
 <2><f2f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0x317): _NL_NAME_CODESET
    <f34>   DW_AT_const_value : 0x80006
 <2><f38>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0x1c2d): _NL_NUM_LC_NAME
    <f3d>   DW_AT_const_value : 0x80007
 <2><f41>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0x1f68): _NL_ADDRESS_POSTAL_FMT
    <f46>   DW_AT_const_value : 0x90000
 <2><f4a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x452): _NL_ADDRESS_COUNTRY_NAME
    <f4f>   DW_AT_const_value : 0x90001
 <2><f53>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0x11d9): _NL_ADDRESS_COUNTRY_POST
    <f58>   DW_AT_const_value : 0x90002
 <2><f5c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xc1d): _NL_ADDRESS_COUNTRY_AB2
    <f61>   DW_AT_const_value : 0x90003
 <2><f65>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0xc35): _NL_ADDRESS_COUNTRY_AB3
    <f6a>   DW_AT_const_value : 0x90004
 <2><f6e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x9c8): _NL_ADDRESS_COUNTRY_CAR
    <f73>   DW_AT_const_value : 0x90005
 <2><f77>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0x20ad): _NL_ADDRESS_COUNTRY_NUM
    <f7c>   DW_AT_const_value : 0x90006
 <2><f80>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x947): _NL_ADDRESS_COUNTRY_ISBN
    <f85>   DW_AT_const_value : 0x90007
 <2><f89>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x8ff): _NL_ADDRESS_LANG_NAME
    <f8e>   DW_AT_const_value : 0x90008
 <2><f92>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f93>   DW_AT_name        : (indirect string, offset: 0x1924): _NL_ADDRESS_LANG_AB
    <f97>   DW_AT_const_value : 0x90009
 <2><f9b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x14db): _NL_ADDRESS_LANG_TERM
    <fa0>   DW_AT_const_value : 0x9000a
 <2><fa4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x34e): _NL_ADDRESS_LANG_LIB
    <fa9>   DW_AT_const_value : 0x9000b
 <2><fad>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0x66a): _NL_ADDRESS_CODESET
    <fb2>   DW_AT_const_value : 0x9000c
 <2><fb6>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x4c1): _NL_NUM_LC_ADDRESS
    <fbb>   DW_AT_const_value : 0x9000d
 <2><fbf>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x2cd): _NL_TELEPHONE_TEL_INT_FMT
    <fc4>   DW_AT_const_value : 0xa0000
 <2><fc8>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fc9>   DW_AT_name        : (indirect string, offset: 0x8c0): _NL_TELEPHONE_TEL_DOM_FMT
    <fcd>   DW_AT_const_value : 0xa0001
 <2><fd1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x1e4f): _NL_TELEPHONE_INT_SELECT
    <fd6>   DW_AT_const_value : 0xa0002
 <2><fda>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xc6f): _NL_TELEPHONE_INT_PREFIX
    <fdf>   DW_AT_const_value : 0xa0003
 <2><fe3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x189a): _NL_TELEPHONE_CODESET
    <fe8>   DW_AT_const_value : 0xa0004
 <2><fec>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fed>   DW_AT_name        : (indirect string, offset: 0x106a): _NL_NUM_LC_TELEPHONE
    <ff1>   DW_AT_const_value : 0xa0005
 <2><ff5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x1b9f): _NL_MEASUREMENT_MEASUREMENT
    <ffa>   DW_AT_const_value : 0xb0000
 <2><ffe>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fff>   DW_AT_name        : (indirect string, offset: 0x2ad): _NL_MEASUREMENT_CODESET
    <1003>   DW_AT_const_value : 0xb0001
 <2><1007>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1008>   DW_AT_name        : (indirect string, offset: 0x16b2): _NL_NUM_LC_MEASUREMENT
    <100c>   DW_AT_const_value : 0xb0002
 <2><1010>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1011>   DW_AT_name        : (indirect string, offset: 0x1612): _NL_IDENTIFICATION_TITLE
    <1015>   DW_AT_const_value : 0xc0000
 <2><1019>: Abbrev Number: 18 (DW_TAG_enumerator)
    <101a>   DW_AT_name        : (indirect string, offset: 0x19ec): _NL_IDENTIFICATION_SOURCE
    <101e>   DW_AT_const_value : 0xc0001
 <2><1022>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1023>   DW_AT_name        : (indirect string, offset: 0x414): _NL_IDENTIFICATION_ADDRESS
    <1027>   DW_AT_const_value : 0xc0002
 <2><102b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <102c>   DW_AT_name        : (indirect string, offset: 0x12ec): _NL_IDENTIFICATION_CONTACT
    <1030>   DW_AT_const_value : 0xc0003
 <2><1034>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1035>   DW_AT_name        : (indirect string, offset: 0x1a4): _NL_IDENTIFICATION_EMAIL
    <1039>   DW_AT_const_value : 0xc0004
 <2><103d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <103e>   DW_AT_name        : (indirect string, offset: 0x1e38): _NL_IDENTIFICATION_TEL
    <1042>   DW_AT_const_value : 0xc0005
 <2><1046>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1047>   DW_AT_name        : (indirect string, offset: 0xea7): _NL_IDENTIFICATION_FAX
    <104b>   DW_AT_const_value : 0xc0006
 <2><104f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1050>   DW_AT_name        : (indirect string, offset: 0xe42): _NL_IDENTIFICATION_LANGUAGE
    <1054>   DW_AT_const_value : 0xc0007
 <2><1058>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1059>   DW_AT_name        : (indirect string, offset: 0x2265): _NL_IDENTIFICATION_TERRITORY
    <105d>   DW_AT_const_value : 0xc0008
 <2><1061>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1062>   DW_AT_name        : (indirect string, offset: 0x2175): _NL_IDENTIFICATION_AUDIENCE
    <1066>   DW_AT_const_value : 0xc0009
 <2><106a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <106b>   DW_AT_name        : (indirect string, offset: 0x531): _NL_IDENTIFICATION_APPLICATION
    <106f>   DW_AT_const_value : 0xc000a
 <2><1073>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1074>   DW_AT_name        : (indirect string, offset: 0x7e8): _NL_IDENTIFICATION_ABBREVIATION
    <1078>   DW_AT_const_value : 0xc000b
 <2><107c>: Abbrev Number: 18 (DW_TAG_enumerator)
    <107d>   DW_AT_name        : (indirect string, offset: 0x6e9): _NL_IDENTIFICATION_REVISION
    <1081>   DW_AT_const_value : 0xc000c
 <2><1085>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1086>   DW_AT_name        : (indirect string, offset: 0x1882): _NL_IDENTIFICATION_DATE
    <108a>   DW_AT_const_value : 0xc000d
 <2><108e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <108f>   DW_AT_name        : (indirect string, offset: 0xf09): _NL_IDENTIFICATION_CATEGORY
    <1093>   DW_AT_const_value : 0xc000e
 <2><1097>: Abbrev Number: 18 (DW_TAG_enumerator)
    <1098>   DW_AT_name        : (indirect string, offset: 0x22aa): _NL_IDENTIFICATION_CODESET
    <109c>   DW_AT_const_value : 0xc000f
 <2><10a0>: Abbrev Number: 18 (DW_TAG_enumerator)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x10d9): _NL_NUM_LC_IDENTIFICATION
    <10a5>   DW_AT_const_value : 0xc0010
 <2><10a9>: Abbrev Number: 18 (DW_TAG_enumerator)
    <10aa>   DW_AT_name        : (indirect string, offset: 0xb73): _NL_NUM
    <10ae>   DW_AT_const_value : 0xc0011
 <2><10b2>: Abbrev Number: 0
 <1><10b3>: Abbrev Number: 21 (DW_TAG_structure_type)
    <10b4>   DW_AT_name        : tm
    <10b7>   DW_AT_byte_size   : 56
    <10b8>   DW_AT_decl_file   : 13
    <10b9>   DW_AT_decl_line   : 7
    <10ba>   DW_AT_decl_column : 8
    <10bb>   DW_AT_sibling     : <0x114f>
 <2><10bf>: Abbrev Number: 9 (DW_TAG_member)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x1180): tm_sec
    <10c4>   DW_AT_decl_file   : 13
    <10c5>   DW_AT_decl_line   : 9
    <10c6>   DW_AT_decl_column : 7
    <10c7>   DW_AT_type        : <0x65>
    <10cb>   DW_AT_data_member_location: 0
 <2><10cc>: Abbrev Number: 9 (DW_TAG_member)
    <10cd>   DW_AT_name        : (indirect string, offset: 0xf9e): tm_min
    <10d1>   DW_AT_decl_file   : 13
    <10d2>   DW_AT_decl_line   : 10
    <10d3>   DW_AT_decl_column : 7
    <10d4>   DW_AT_type        : <0x65>
    <10d8>   DW_AT_data_member_location: 4
 <2><10d9>: Abbrev Number: 9 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0x1708): tm_hour
    <10de>   DW_AT_decl_file   : 13
    <10df>   DW_AT_decl_line   : 11
    <10e0>   DW_AT_decl_column : 7
    <10e1>   DW_AT_type        : <0x65>
    <10e5>   DW_AT_data_member_location: 8
 <2><10e6>: Abbrev Number: 9 (DW_TAG_member)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x186c): tm_mday
    <10eb>   DW_AT_decl_file   : 13
    <10ec>   DW_AT_decl_line   : 12
    <10ed>   DW_AT_decl_column : 7
    <10ee>   DW_AT_type        : <0x65>
    <10f2>   DW_AT_data_member_location: 12
 <2><10f3>: Abbrev Number: 9 (DW_TAG_member)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x1372): tm_mon
    <10f8>   DW_AT_decl_file   : 13
    <10f9>   DW_AT_decl_line   : 13
    <10fa>   DW_AT_decl_column : 7
    <10fb>   DW_AT_type        : <0x65>
    <10ff>   DW_AT_data_member_location: 16
 <2><1100>: Abbrev Number: 9 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0x344a): tm_year
    <1105>   DW_AT_decl_file   : 13
    <1106>   DW_AT_decl_line   : 14
    <1107>   DW_AT_decl_column : 7
    <1108>   DW_AT_type        : <0x65>
    <110c>   DW_AT_data_member_location: 20
 <2><110d>: Abbrev Number: 9 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x1204): tm_wday
    <1112>   DW_AT_decl_file   : 13
    <1113>   DW_AT_decl_line   : 15
    <1114>   DW_AT_decl_column : 7
    <1115>   DW_AT_type        : <0x65>
    <1119>   DW_AT_data_member_location: 24
 <2><111a>: Abbrev Number: 9 (DW_TAG_member)
    <111b>   DW_AT_name        : (indirect string, offset: 0x10a2): tm_yday
    <111f>   DW_AT_decl_file   : 13
    <1120>   DW_AT_decl_line   : 16
    <1121>   DW_AT_decl_column : 7
    <1122>   DW_AT_type        : <0x65>
    <1126>   DW_AT_data_member_location: 28
 <2><1127>: Abbrev Number: 9 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0x1c08): tm_isdst
    <112c>   DW_AT_decl_file   : 13
    <112d>   DW_AT_decl_line   : 17
    <112e>   DW_AT_decl_column : 7
    <112f>   DW_AT_type        : <0x65>
    <1133>   DW_AT_data_member_location: 32
 <2><1134>: Abbrev Number: 9 (DW_TAG_member)
    <1135>   DW_AT_name        : (indirect string, offset: 0x1cb2): tm_gmtoff
    <1139>   DW_AT_decl_file   : 13
    <113a>   DW_AT_decl_line   : 20
    <113b>   DW_AT_decl_column : 12
    <113c>   DW_AT_type        : <0x6c>
    <1140>   DW_AT_data_member_location: 40
 <2><1141>: Abbrev Number: 9 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x8f7): tm_zone
    <1146>   DW_AT_decl_file   : 13
    <1147>   DW_AT_decl_line   : 21
    <1148>   DW_AT_decl_column : 15
    <1149>   DW_AT_type        : <0x31a>
    <114d>   DW_AT_data_member_location: 48
 <2><114e>: Abbrev Number: 0
 <1><114f>: Abbrev Number: 7 (DW_TAG_const_type)
    <1150>   DW_AT_type        : <0x10b3>
 <1><1154>: Abbrev Number: 22 (DW_TAG_typedef)
    <1155>   DW_AT_name        : (indirect string, offset: 0x19c4): timezone_t
    <1159>   DW_AT_decl_file   : 14
    <115a>   DW_AT_decl_line   : 867
    <115c>   DW_AT_decl_column : 25
    <115d>   DW_AT_type        : <0x1161>
 <1><1161>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1162>   DW_AT_byte_size   : 8
    <1163>   DW_AT_type        : <0x1167>
 <1><1167>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1168>   DW_AT_name        : (indirect string, offset: 0x8f7): tm_zone
    <116c>   DW_AT_declaration : 1
 <1><116c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <116d>   DW_AT_name        : (indirect string, offset: 0x278): stat
    <1171>   DW_AT_byte_size   : 144
    <1172>   DW_AT_decl_file   : 15
    <1173>   DW_AT_decl_line   : 46
    <1174>   DW_AT_decl_column : 8
    <1175>   DW_AT_sibling     : <0x123d>
 <2><1179>: Abbrev Number: 9 (DW_TAG_member)
    <117a>   DW_AT_name        : (indirect string, offset: 0x19e5): st_dev
    <117e>   DW_AT_decl_file   : 15
    <117f>   DW_AT_decl_line   : 48
    <1180>   DW_AT_decl_column : 13
    <1181>   DW_AT_type        : <0x7f>
    <1185>   DW_AT_data_member_location: 0
 <2><1186>: Abbrev Number: 9 (DW_TAG_member)
    <1187>   DW_AT_name        : (indirect string, offset: 0xcdf): st_ino
    <118b>   DW_AT_decl_file   : 15
    <118c>   DW_AT_decl_line   : 53
    <118d>   DW_AT_decl_column : 13
    <118e>   DW_AT_type        : <0xa3>
    <1192>   DW_AT_data_member_location: 8
 <2><1193>: Abbrev Number: 9 (DW_TAG_member)
    <1194>   DW_AT_name        : (indirect string, offset: 0x4fb): st_nlink
    <1198>   DW_AT_decl_file   : 15
    <1199>   DW_AT_decl_line   : 61
    <119a>   DW_AT_decl_column : 15
    <119b>   DW_AT_type        : <0xbb>
    <119f>   DW_AT_data_member_location: 16
 <2><11a0>: Abbrev Number: 9 (DW_TAG_member)
    <11a1>   DW_AT_name        : (indirect string, offset: 0x14e): st_mode
    <11a5>   DW_AT_decl_file   : 15
    <11a6>   DW_AT_decl_line   : 62
    <11a7>   DW_AT_decl_column : 14
    <11a8>   DW_AT_type        : <0xaf>
    <11ac>   DW_AT_data_member_location: 24
 <2><11ad>: Abbrev Number: 9 (DW_TAG_member)
    <11ae>   DW_AT_name        : (indirect string, offset: 0xede): st_uid
    <11b2>   DW_AT_decl_file   : 15
    <11b3>   DW_AT_decl_line   : 64
    <11b4>   DW_AT_decl_column : 13
    <11b5>   DW_AT_type        : <0x8b>
    <11b9>   DW_AT_data_member_location: 28
 <2><11ba>: Abbrev Number: 9 (DW_TAG_member)
    <11bb>   DW_AT_name        : (indirect string, offset: 0x42f): st_gid
    <11bf>   DW_AT_decl_file   : 15
    <11c0>   DW_AT_decl_line   : 65
    <11c1>   DW_AT_decl_column : 13
    <11c2>   DW_AT_type        : <0x97>
    <11c6>   DW_AT_data_member_location: 32
 <2><11c7>: Abbrev Number: 9 (DW_TAG_member)
    <11c8>   DW_AT_name        : (indirect string, offset: 0x1874): __pad0
    <11cc>   DW_AT_decl_file   : 15
    <11cd>   DW_AT_decl_line   : 67
    <11ce>   DW_AT_decl_column : 9
    <11cf>   DW_AT_type        : <0x65>
    <11d3>   DW_AT_data_member_location: 36
 <2><11d4>: Abbrev Number: 9 (DW_TAG_member)
    <11d5>   DW_AT_name        : (indirect string, offset: 0x19bc): st_rdev
    <11d9>   DW_AT_decl_file   : 15
    <11da>   DW_AT_decl_line   : 69
    <11db>   DW_AT_decl_column : 13
    <11dc>   DW_AT_type        : <0x7f>
    <11e0>   DW_AT_data_member_location: 40
 <2><11e1>: Abbrev Number: 9 (DW_TAG_member)
    <11e2>   DW_AT_name        : (indirect string, offset: 0x2e7): st_size
    <11e6>   DW_AT_decl_file   : 15
    <11e7>   DW_AT_decl_line   : 74
    <11e8>   DW_AT_decl_column : 13
    <11e9>   DW_AT_type        : <0xc7>
    <11ed>   DW_AT_data_member_location: 48
 <2><11ee>: Abbrev Number: 9 (DW_TAG_member)
    <11ef>   DW_AT_name        : (indirect string, offset: 0x39f): st_blksize
    <11f3>   DW_AT_decl_file   : 15
    <11f4>   DW_AT_decl_line   : 78
    <11f5>   DW_AT_decl_column : 17
    <11f6>   DW_AT_type        : <0xeb>
    <11fa>   DW_AT_data_member_location: 56
 <2><11fb>: Abbrev Number: 9 (DW_TAG_member)
    <11fc>   DW_AT_name        : (indirect string, offset: 0x1c5d): st_blocks
    <1200>   DW_AT_decl_file   : 15
    <1201>   DW_AT_decl_line   : 80
    <1202>   DW_AT_decl_column : 16
    <1203>   DW_AT_type        : <0xf7>
    <1207>   DW_AT_data_member_location: 64
 <2><1208>: Abbrev Number: 9 (DW_TAG_member)
    <1209>   DW_AT_name        : (indirect string, offset: 0x619): st_atim
    <120d>   DW_AT_decl_file   : 15
    <120e>   DW_AT_decl_line   : 91
    <120f>   DW_AT_decl_column : 21
    <1210>   DW_AT_type        : <0x390>
    <1214>   DW_AT_data_member_location: 72
 <2><1215>: Abbrev Number: 9 (DW_TAG_member)
    <1216>   DW_AT_name        : (indirect string, offset: 0x21cb): st_mtim
