
sort_O0_debug:     file format elf64-x86-64

Contents of the .eh_frame section (loaded from sort_O0_debug):


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000000000000014 0000001c FDE cie=00000000 pc=0000000000003ef0..0000000000003f1f
  DW_CFA_advance_loc: 4 to 0000000000003ef4
  DW_CFA_undefined: r16 (rip)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000030 0000000000000024 00000034 FDE cie=00000000 pc=0000000000003020..0000000000003780
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000003026
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000003030
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit10; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 0000000000000014 0000005c FDE cie=00000000 pc=0000000000003780..00000000000037a0
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 0000000000000014 00000074 FDE cie=00000000 pc=00000000000037a0..0000000000003ef0
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop


  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001ac51 00000000000004a6 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x12c61
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b0f7 0000000000000059 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x12d88
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b150 0000000000000042 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x12e5c
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b192 00000000000000ea 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x13279
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b27c 00000000000000e7 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x134b5
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b363 0000000000000048 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x14219
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b3ab 00000000000000aa 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x14410
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b455 0000000000000222 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x146ab
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b677 0000000000000106 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x14874
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001b77d 0000000000000644 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x15152
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001bdc1 0000000000000141 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x15304
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000001bf02 000000000000002a 
    0000000000000000 0000000000000000 

Contents of the .debug_info section (loaded from sort_O0_debug):

  Compilation Unit @ offset 0x0:
   Length:        0x7425 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xed6): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O0 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1603): src/sort.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x149a): /home/jacekline/dev/research/programs/coreutils-9.1
    <19>   DW_AT_low_pc      : 0x3fd9
    <21>   DW_AT_high_pc     : 0xb5c8
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_variable)
    <2e>   DW_AT_name        : (indirect string, offset: 0xb4b): optarg
    <32>   DW_AT_decl_file   : 3
    <33>   DW_AT_decl_line   : 36
    <34>   DW_AT_decl_column : 14
    <35>   DW_AT_type        : <0x39>
    <39>   DW_AT_external    : 1
    <39>   DW_AT_declaration : 1
 <1><39>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <3a>   DW_AT_byte_size   : 8
    <3b>   DW_AT_type        : <0x49>
 <1><3f>: Abbrev Number: 4 (DW_TAG_const_type)
    <40>   DW_AT_type        : <0x39>
 <1><44>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <45>   DW_AT_type        : <0x39>
 <1><49>: Abbrev Number: 6 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 6	(signed char)
    <4c>   DW_AT_name        : (indirect string, offset: 0xe0f): char
 <1><50>: Abbrev Number: 4 (DW_TAG_const_type)
    <51>   DW_AT_type        : <0x49>
 <1><55>: Abbrev Number: 2 (DW_TAG_variable)
    <56>   DW_AT_name        : (indirect string, offset: 0x34f4): optind
    <5a>   DW_AT_decl_file   : 3
    <5b>   DW_AT_decl_line   : 50
    <5c>   DW_AT_decl_column : 12
    <5d>   DW_AT_type        : <0x61>
    <61>   DW_AT_external    : 1
    <61>   DW_AT_declaration : 1
 <1><61>: Abbrev Number: 7 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : int
 <1><68>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <69>   DW_AT_type        : <0x61>
 <1><6d>: Abbrev Number: 4 (DW_TAG_const_type)
    <6e>   DW_AT_type        : <0x61>
 <1><72>: Abbrev Number: 9 (DW_TAG_structure_type)
    <73>   DW_AT_name        : (indirect string, offset: 0x35b4): option
    <77>   DW_AT_byte_size   : 32
    <78>   DW_AT_decl_file   : 4
    <79>   DW_AT_decl_line   : 50
    <7a>   DW_AT_decl_column : 8
    <7b>   DW_AT_sibling     : <0xb4>
 <2><7f>: Abbrev Number: 10 (DW_TAG_member)
    <80>   DW_AT_name        : (indirect string, offset: 0x5c3d): name
    <84>   DW_AT_decl_file   : 4
    <85>   DW_AT_decl_line   : 52
    <86>   DW_AT_decl_column : 15
    <87>   DW_AT_type        : <0xb9>
    <8b>   DW_AT_data_member_location: 0
 <2><8c>: Abbrev Number: 10 (DW_TAG_member)
    <8d>   DW_AT_name        : (indirect string, offset: 0x5f8): has_arg
    <91>   DW_AT_decl_file   : 4
    <92>   DW_AT_decl_line   : 55
    <93>   DW_AT_decl_column : 7
    <94>   DW_AT_type        : <0x61>
    <98>   DW_AT_data_member_location: 8
 <2><99>: Abbrev Number: 10 (DW_TAG_member)
    <9a>   DW_AT_name        : (indirect string, offset: 0x5b21): flag
    <9e>   DW_AT_decl_file   : 4
    <9f>   DW_AT_decl_line   : 56
    <a0>   DW_AT_decl_column : 8
    <a1>   DW_AT_type        : <0xc9>
    <a5>   DW_AT_data_member_location: 16
 <2><a6>: Abbrev Number: 11 (DW_TAG_member)
    <a7>   DW_AT_name        : val
    <ab>   DW_AT_decl_file   : 4
    <ac>   DW_AT_decl_line   : 57
    <ad>   DW_AT_decl_column : 7
    <ae>   DW_AT_type        : <0x61>
    <b2>   DW_AT_data_member_location: 24
 <2><b3>: Abbrev Number: 0
 <1><b4>: Abbrev Number: 4 (DW_TAG_const_type)
    <b5>   DW_AT_type        : <0x72>
 <1><b9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ba>   DW_AT_byte_size   : 8
    <bb>   DW_AT_type        : <0x50>
 <1><bf>: Abbrev Number: 4 (DW_TAG_const_type)
    <c0>   DW_AT_type        : <0xb9>
 <1><c4>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <c5>   DW_AT_type        : <0xb9>
 <1><c9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca>   DW_AT_byte_size   : 8
    <cb>   DW_AT_type        : <0x61>
 <1><cf>: Abbrev Number: 6 (DW_TAG_base_type)
    <d0>   DW_AT_byte_size   : 1
    <d1>   DW_AT_encoding    : 8	(unsigned char)
    <d2>   DW_AT_name        : (indirect string, offset: 0xe06): unsigned char
 <1><d6>: Abbrev Number: 6 (DW_TAG_base_type)
    <d7>   DW_AT_byte_size   : 2
    <d8>   DW_AT_encoding    : 7	(unsigned)
    <d9>   DW_AT_name        : (indirect string, offset: 0x1f03): short unsigned int
 <1><dd>: Abbrev Number: 4 (DW_TAG_const_type)
    <de>   DW_AT_type        : <0xd6>
 <1><e2>: Abbrev Number: 6 (DW_TAG_base_type)
    <e3>   DW_AT_byte_size   : 4
    <e4>   DW_AT_encoding    : 7	(unsigned)
    <e5>   DW_AT_name        : (indirect string, offset: 0x31a9): unsigned int
 <1><e9>: Abbrev Number: 6 (DW_TAG_base_type)
    <ea>   DW_AT_byte_size   : 8
    <eb>   DW_AT_encoding    : 7	(unsigned)
    <ec>   DW_AT_name        : (indirect string, offset: 0x31a4): long unsigned int
 <1><f0>: Abbrev Number: 6 (DW_TAG_base_type)
    <f1>   DW_AT_byte_size   : 1
    <f2>   DW_AT_encoding    : 6	(signed char)
    <f3>   DW_AT_name        : (indirect string, offset: 0xe08): signed char
 <1><f7>: Abbrev Number: 6 (DW_TAG_base_type)
    <f8>   DW_AT_byte_size   : 2
    <f9>   DW_AT_encoding    : 5	(signed)
    <fa>   DW_AT_name        : (indirect string, offset: 0x3a51): short int
 <1><fe>: Abbrev Number: 12 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x2e1c): __uint32_t
    <103>   DW_AT_decl_file   : 5
    <104>   DW_AT_decl_line   : 42
    <105>   DW_AT_decl_column : 22
    <106>   DW_AT_type        : <0xe2>
 <1><10a>: Abbrev Number: 6 (DW_TAG_base_type)
    <10b>   DW_AT_byte_size   : 8
    <10c>   DW_AT_encoding    : 5	(signed)
    <10d>   DW_AT_name        : (indirect string, offset: 0x3529): long int
 <1><111>: Abbrev Number: 12 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0xae4): __uintmax_t
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 73
    <118>   DW_AT_decl_column : 27
    <119>   DW_AT_type        : <0xe9>
 <1><11d>: Abbrev Number: 12 (DW_TAG_typedef)
    <11e>   DW_AT_name        : (indirect string, offset: 0x281f): __dev_t
    <122>   DW_AT_decl_file   : 5
    <123>   DW_AT_decl_line   : 145
    <124>   DW_AT_decl_column : 25
    <125>   DW_AT_type        : <0xe9>
 <1><129>: Abbrev Number: 12 (DW_TAG_typedef)
    <12a>   DW_AT_name        : (indirect string, offset: 0xc25): __uid_t
    <12e>   DW_AT_decl_file   : 5
    <12f>   DW_AT_decl_line   : 146
    <130>   DW_AT_decl_column : 25
    <131>   DW_AT_type        : <0xe2>
 <1><135>: Abbrev Number: 12 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x308b): __gid_t
    <13a>   DW_AT_decl_file   : 5
    <13b>   DW_AT_decl_line   : 147
    <13c>   DW_AT_decl_column : 25
    <13d>   DW_AT_type        : <0xe2>
 <1><141>: Abbrev Number: 12 (DW_TAG_typedef)
    <142>   DW_AT_name        : (indirect string, offset: 0x364e): __ino_t
    <146>   DW_AT_decl_file   : 5
    <147>   DW_AT_decl_line   : 148
    <148>   DW_AT_decl_column : 25
    <149>   DW_AT_type        : <0xe9>
 <1><14d>: Abbrev Number: 12 (DW_TAG_typedef)
    <14e>   DW_AT_name        : (indirect string, offset: 0x10dc): __mode_t
    <152>   DW_AT_decl_file   : 5
    <153>   DW_AT_decl_line   : 150
    <154>   DW_AT_decl_column : 26
    <155>   DW_AT_type        : <0xe2>
 <1><159>: Abbrev Number: 12 (DW_TAG_typedef)
    <15a>   DW_AT_name        : (indirect string, offset: 0x1713): __nlink_t
    <15e>   DW_AT_decl_file   : 5
    <15f>   DW_AT_decl_line   : 151
    <160>   DW_AT_decl_column : 27
    <161>   DW_AT_type        : <0xe9>
 <1><165>: Abbrev Number: 12 (DW_TAG_typedef)
    <166>   DW_AT_name        : (indirect string, offset: 0x4ae): __off_t
    <16a>   DW_AT_decl_file   : 5
    <16b>   DW_AT_decl_line   : 152
    <16c>   DW_AT_decl_column : 25
    <16d>   DW_AT_type        : <0x10a>
 <1><171>: Abbrev Number: 12 (DW_TAG_typedef)
    <172>   DW_AT_name        : (indirect string, offset: 0x2063): __off64_t
    <176>   DW_AT_decl_file   : 5
    <177>   DW_AT_decl_line   : 153
    <178>   DW_AT_decl_column : 27
    <179>   DW_AT_type        : <0x10a>
 <1><17d>: Abbrev Number: 12 (DW_TAG_typedef)
    <17e>   DW_AT_name        : (indirect string, offset: 0x2527): __pid_t
    <182>   DW_AT_decl_file   : 5
    <183>   DW_AT_decl_line   : 154
    <184>   DW_AT_decl_column : 25
    <185>   DW_AT_type        : <0x61>
 <1><189>: Abbrev Number: 13 (DW_TAG_array_type)
    <18a>   DW_AT_type        : <0x61>
    <18e>   DW_AT_sibling     : <0x199>
 <2><192>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <193>   DW_AT_type        : <0xe9>
    <197>   DW_AT_upper_bound : 1
 <2><198>: Abbrev Number: 0
 <1><199>: Abbrev Number: 12 (DW_TAG_typedef)
    <19a>   DW_AT_name        : (indirect string, offset: 0xb7c): __clock_t
    <19e>   DW_AT_decl_file   : 5
    <19f>   DW_AT_decl_line   : 156
    <1a0>   DW_AT_decl_column : 27
    <1a1>   DW_AT_type        : <0x10a>
 <1><1a5>: Abbrev Number: 12 (DW_TAG_typedef)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x13db): __rlim_t
    <1aa>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 157
    <1ac>   DW_AT_decl_column : 26
    <1ad>   DW_AT_type        : <0xe9>
 <1><1b1>: Abbrev Number: 12 (DW_TAG_typedef)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x1daa): __time_t
    <1b6>   DW_AT_decl_file   : 5
    <1b7>   DW_AT_decl_line   : 160
    <1b8>   DW_AT_decl_column : 26
    <1b9>   DW_AT_type        : <0x10a>
 <1><1bd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1be>   DW_AT_byte_size   : 8
 <1><1bf>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <1c0>   DW_AT_type        : <0x1bd>
 <1><1c4>: Abbrev Number: 12 (DW_TAG_typedef)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x1f44): __blksize_t
    <1c9>   DW_AT_decl_file   : 5
    <1ca>   DW_AT_decl_line   : 174
    <1cb>   DW_AT_decl_column : 29
    <1cc>   DW_AT_type        : <0x10a>
 <1><1d0>: Abbrev Number: 12 (DW_TAG_typedef)
    <1d1>   DW_AT_name        : (indirect string, offset: 0xea6): __blkcnt_t
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 179
    <1d7>   DW_AT_decl_column : 28
    <1d8>   DW_AT_type        : <0x10a>
 <1><1dc>: Abbrev Number: 12 (DW_TAG_typedef)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x19d8): __ssize_t
    <1e1>   DW_AT_decl_file   : 5
    <1e2>   DW_AT_decl_line   : 193
    <1e3>   DW_AT_decl_column : 27
    <1e4>   DW_AT_type        : <0x10a>
 <1><1e8>: Abbrev Number: 12 (DW_TAG_typedef)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x7f1): __syscall_slong_t
    <1ed>   DW_AT_decl_file   : 5
    <1ee>   DW_AT_decl_line   : 196
    <1ef>   DW_AT_decl_column : 33
    <1f0>   DW_AT_type        : <0x10a>
 <1><1f4>: Abbrev Number: 12 (DW_TAG_typedef)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x1f49): size_t
    <1f9>   DW_AT_decl_file   : 6
    <1fa>   DW_AT_decl_line   : 209
    <1fb>   DW_AT_decl_column : 23
    <1fc>   DW_AT_type        : <0xe9>
 <1><200>: Abbrev Number: 4 (DW_TAG_const_type)
    <201>   DW_AT_type        : <0x1f4>
 <1><205>: Abbrev Number: 12 (DW_TAG_typedef)
    <206>   DW_AT_name        : (indirect string, offset: 0x1dac): time_t
    <20a>   DW_AT_decl_file   : 7
    <20b>   DW_AT_decl_line   : 7
    <20c>   DW_AT_decl_column : 18
    <20d>   DW_AT_type        : <0x1b1>
 <1><211>: Abbrev Number: 9 (DW_TAG_structure_type)
    <212>   DW_AT_name        : (indirect string, offset: 0x604e): timespec
    <216>   DW_AT_byte_size   : 16
    <217>   DW_AT_decl_file   : 8
    <218>   DW_AT_decl_line   : 10
    <219>   DW_AT_decl_column : 8
    <21a>   DW_AT_sibling     : <0x239>
 <2><21e>: Abbrev Number: 10 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x3145): tv_sec
    <223>   DW_AT_decl_file   : 8
    <224>   DW_AT_decl_line   : 12
    <225>   DW_AT_decl_column : 12
    <226>   DW_AT_type        : <0x1b1>
    <22a>   DW_AT_data_member_location: 0
 <2><22b>: Abbrev Number: 10 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0x359f): tv_nsec
    <230>   DW_AT_decl_file   : 8
    <231>   DW_AT_decl_line   : 16
    <232>   DW_AT_decl_column : 21
    <233>   DW_AT_type        : <0x1e8>
    <237>   DW_AT_data_member_location: 8
 <2><238>: Abbrev Number: 0
 <1><239>: Abbrev Number: 12 (DW_TAG_typedef)
    <23a>   DW_AT_name        : (indirect string, offset: 0x2529): pid_t
    <23e>   DW_AT_decl_file   : 9
    <23f>   DW_AT_decl_line   : 38
    <240>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0x17d>
 <1><245>: Abbrev Number: 12 (DW_TAG_typedef)
    <246>   DW_AT_name        : (indirect string, offset: 0x4b0): off_t
    <24a>   DW_AT_decl_file   : 10
    <24b>   DW_AT_decl_line   : 85
    <24c>   DW_AT_decl_column : 17
    <24d>   DW_AT_type        : <0x165>
 <1><251>: Abbrev Number: 12 (DW_TAG_typedef)
    <252>   DW_AT_name        : (indirect string, offset: 0x19da): ssize_t
    <256>   DW_AT_decl_file   : 10
    <257>   DW_AT_decl_line   : 108
    <258>   DW_AT_decl_column : 19
    <259>   DW_AT_type        : <0x1dc>
 <1><25d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <25e>   DW_AT_byte_size   : 128
    <25f>   DW_AT_decl_file   : 11
    <260>   DW_AT_decl_line   : 5
    <261>   DW_AT_decl_column : 9
    <262>   DW_AT_sibling     : <0x274>
 <2><266>: Abbrev Number: 10 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x1a9c): __val
    <26b>   DW_AT_decl_file   : 11
    <26c>   DW_AT_decl_line   : 7
    <26d>   DW_AT_decl_column : 21
    <26e>   DW_AT_type        : <0x274>
    <272>   DW_AT_data_member_location: 0
 <2><273>: Abbrev Number: 0
 <1><274>: Abbrev Number: 13 (DW_TAG_array_type)
    <275>   DW_AT_type        : <0xe9>
    <279>   DW_AT_sibling     : <0x284>
 <2><27d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <27e>   DW_AT_type        : <0xe9>
    <282>   DW_AT_upper_bound : 15
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_typedef)
    <285>   DW_AT_name        : (indirect string, offset: 0x951): __sigset_t
    <289>   DW_AT_decl_file   : 11
    <28a>   DW_AT_decl_line   : 8
    <28b>   DW_AT_decl_column : 3
    <28c>   DW_AT_type        : <0x25d>
 <1><290>: Abbrev Number: 4 (DW_TAG_const_type)
    <291>   DW_AT_type        : <0x284>
 <1><295>: Abbrev Number: 12 (DW_TAG_typedef)
    <296>   DW_AT_name        : (indirect string, offset: 0x953): sigset_t
    <29a>   DW_AT_decl_file   : 12
    <29b>   DW_AT_decl_line   : 7
    <29c>   DW_AT_decl_column : 20
    <29d>   DW_AT_type        : <0x284>
 <1><2a1>: Abbrev Number: 4 (DW_TAG_const_type)
    <2a2>   DW_AT_type        : <0x295>
 <1><2a6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x1800): __pthread_internal_list
    <2ab>   DW_AT_byte_size   : 16
    <2ac>   DW_AT_decl_file   : 13
    <2ad>   DW_AT_decl_line   : 49
    <2ae>   DW_AT_decl_column : 16
    <2af>   DW_AT_sibling     : <0x2ce>
 <2><2b3>: Abbrev Number: 10 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x1818): __prev
    <2b8>   DW_AT_decl_file   : 13
    <2b9>   DW_AT_decl_line   : 51
    <2ba>   DW_AT_decl_column : 35
    <2bb>   DW_AT_type        : <0x2ce>
    <2bf>   DW_AT_data_member_location: 0
 <2><2c0>: Abbrev Number: 10 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x1cd8): __next
    <2c5>   DW_AT_decl_file   : 13
    <2c6>   DW_AT_decl_line   : 52
    <2c7>   DW_AT_decl_column : 35
    <2c8>   DW_AT_type        : <0x2ce>
    <2cc>   DW_AT_data_member_location: 8
 <2><2cd>: Abbrev Number: 0
 <1><2ce>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2cf>   DW_AT_byte_size   : 8
    <2d0>   DW_AT_type        : <0x2a6>
 <1><2d4>: Abbrev Number: 12 (DW_TAG_typedef)
    <2d5>   DW_AT_name        : (indirect string, offset: 0xa3a): __pthread_list_t
    <2d9>   DW_AT_decl_file   : 13
    <2da>   DW_AT_decl_line   : 53
    <2db>   DW_AT_decl_column : 3
    <2dc>   DW_AT_type        : <0x2a6>
 <1><2e0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x9e): __pthread_mutex_s
    <2e5>   DW_AT_byte_size   : 40
    <2e6>   DW_AT_decl_file   : 14
    <2e7>   DW_AT_decl_line   : 22
    <2e8>   DW_AT_decl_column : 8
    <2e9>   DW_AT_sibling     : <0x356>
 <2><2ed>: Abbrev Number: 10 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x9f3): __lock
    <2f2>   DW_AT_decl_file   : 14
    <2f3>   DW_AT_decl_line   : 24
    <2f4>   DW_AT_decl_column : 7
    <2f5>   DW_AT_type        : <0x61>
    <2f9>   DW_AT_data_member_location: 0
 <2><2fa>: Abbrev Number: 10 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x14dd): __count
    <2ff>   DW_AT_decl_file   : 14
    <300>   DW_AT_decl_line   : 25
    <301>   DW_AT_decl_column : 16
    <302>   DW_AT_type        : <0xe2>
    <306>   DW_AT_data_member_location: 4
 <2><307>: Abbrev Number: 10 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x878): __owner
    <30c>   DW_AT_decl_file   : 14
    <30d>   DW_AT_decl_line   : 26
    <30e>   DW_AT_decl_column : 7
    <30f>   DW_AT_type        : <0x61>
    <313>   DW_AT_data_member_location: 8
 <2><314>: Abbrev Number: 10 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x2805): __nusers
    <319>   DW_AT_decl_file   : 14
    <31a>   DW_AT_decl_line   : 28
    <31b>   DW_AT_decl_column : 16
    <31c>   DW_AT_type        : <0xe2>
    <320>   DW_AT_data_member_location: 12
 <2><321>: Abbrev Number: 10 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x1092): __kind
    <326>   DW_AT_decl_file   : 14
    <327>   DW_AT_decl_line   : 32
    <328>   DW_AT_decl_column : 7
    <329>   DW_AT_type        : <0x61>
    <32d>   DW_AT_data_member_location: 16
 <2><32e>: Abbrev Number: 10 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x27bf): __spins
    <333>   DW_AT_decl_file   : 14
    <334>   DW_AT_decl_line   : 34
    <335>   DW_AT_decl_column : 9
    <336>   DW_AT_type        : <0xf7>
    <33a>   DW_AT_data_member_location: 20
 <2><33b>: Abbrev Number: 10 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x1e72): __elision
    <340>   DW_AT_decl_file   : 14
    <341>   DW_AT_decl_line   : 35
    <342>   DW_AT_decl_column : 9
    <343>   DW_AT_type        : <0xf7>
    <347>   DW_AT_data_member_location: 22
 <2><348>: Abbrev Number: 10 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x322d): __list
    <34d>   DW_AT_decl_file   : 14
    <34e>   DW_AT_decl_line   : 36
    <34f>   DW_AT_decl_column : 20
    <350>   DW_AT_type        : <0x2d4>
    <354>   DW_AT_data_member_location: 24
 <2><355>: Abbrev Number: 0
 <1><356>: Abbrev Number: 16 (DW_TAG_structure_type)
    <357>   DW_AT_byte_size   : 8
    <358>   DW_AT_decl_file   : 13
    <359>   DW_AT_decl_line   : 97
    <35a>   DW_AT_decl_column : 5
    <35b>   DW_AT_sibling     : <0x37a>
 <2><35f>: Abbrev Number: 10 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0x2aa1): __low
    <364>   DW_AT_decl_file   : 13
    <365>   DW_AT_decl_line   : 99
    <366>   DW_AT_decl_column : 20
    <367>   DW_AT_type        : <0xe2>
    <36b>   DW_AT_data_member_location: 0
 <2><36c>: Abbrev Number: 10 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x298d): __high
    <371>   DW_AT_decl_file   : 13
    <372>   DW_AT_decl_line   : 100
    <373>   DW_AT_decl_column : 20
    <374>   DW_AT_type        : <0xe2>
    <378>   DW_AT_data_member_location: 4
 <2><379>: Abbrev Number: 0
 <1><37a>: Abbrev Number: 17 (DW_TAG_union_type)
    <37b>   DW_AT_byte_size   : 8
    <37c>   DW_AT_decl_file   : 13
    <37d>   DW_AT_decl_line   : 94
    <37e>   DW_AT_decl_column : 17
    <37f>   DW_AT_sibling     : <0x39c>
 <2><383>: Abbrev Number: 18 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0x3475): __wseq
    <388>   DW_AT_decl_file   : 13
    <389>   DW_AT_decl_line   : 96
    <38a>   DW_AT_decl_column : 42
    <38b>   DW_AT_type        : <0x39c>
 <2><38f>: Abbrev Number: 18 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x22bb): __wseq32
    <394>   DW_AT_decl_file   : 13
    <395>   DW_AT_decl_line   : 101
    <396>   DW_AT_decl_column : 7
    <397>   DW_AT_type        : <0x356>
 <2><39b>: Abbrev Number: 0
 <1><39c>: Abbrev Number: 6 (DW_TAG_base_type)
    <39d>   DW_AT_byte_size   : 8
    <39e>   DW_AT_encoding    : 7	(unsigned)
    <39f>   DW_AT_name        : (indirect string, offset: 0x319f): long long unsigned int
 <1><3a3>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3a4>   DW_AT_byte_size   : 8
    <3a5>   DW_AT_decl_file   : 13
    <3a6>   DW_AT_decl_line   : 106
    <3a7>   DW_AT_decl_column : 5
    <3a8>   DW_AT_sibling     : <0x3c7>
 <2><3ac>: Abbrev Number: 10 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x2aa1): __low
    <3b1>   DW_AT_decl_file   : 13
    <3b2>   DW_AT_decl_line   : 108
    <3b3>   DW_AT_decl_column : 20
    <3b4>   DW_AT_type        : <0xe2>
    <3b8>   DW_AT_data_member_location: 0
 <2><3b9>: Abbrev Number: 10 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x298d): __high
    <3be>   DW_AT_decl_file   : 13
    <3bf>   DW_AT_decl_line   : 109
    <3c0>   DW_AT_decl_column : 20
    <3c1>   DW_AT_type        : <0xe2>
    <3c5>   DW_AT_data_member_location: 4
 <2><3c6>: Abbrev Number: 0
 <1><3c7>: Abbrev Number: 17 (DW_TAG_union_type)
    <3c8>   DW_AT_byte_size   : 8
    <3c9>   DW_AT_decl_file   : 13
    <3ca>   DW_AT_decl_line   : 103
    <3cb>   DW_AT_decl_column : 17
    <3cc>   DW_AT_sibling     : <0x3e9>
 <2><3d0>: Abbrev Number: 18 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x2006): __g1_start
    <3d5>   DW_AT_decl_file   : 13
    <3d6>   DW_AT_decl_line   : 105
    <3d7>   DW_AT_decl_column : 42
    <3d8>   DW_AT_type        : <0x39c>
 <2><3dc>: Abbrev Number: 18 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x1e7c): __g1_start32
    <3e1>   DW_AT_decl_file   : 13
    <3e2>   DW_AT_decl_line   : 110
    <3e3>   DW_AT_decl_column : 7
    <3e4>   DW_AT_type        : <0x3a3>
 <2><3e8>: Abbrev Number: 0
 <1><3e9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x358e): __pthread_cond_s
    <3ee>   DW_AT_byte_size   : 48
    <3ef>   DW_AT_decl_file   : 13
    <3f0>   DW_AT_decl_line   : 92
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x444>
 <2><3f6>: Abbrev Number: 19 (DW_TAG_member)
    <3f7>   DW_AT_type        : <0x37a>
    <3fb>   DW_AT_data_member_location: 0
 <2><3fc>: Abbrev Number: 19 (DW_TAG_member)
    <3fd>   DW_AT_type        : <0x3c7>
    <401>   DW_AT_data_member_location: 8
 <2><402>: Abbrev Number: 10 (DW_TAG_member)
    <403>   DW_AT_name        : (indirect string, offset: 0x1484): __g_refs
    <407>   DW_AT_decl_file   : 13
    <408>   DW_AT_decl_line   : 112
    <409>   DW_AT_decl_column : 16
    <40a>   DW_AT_type        : <0x444>
    <40e>   DW_AT_data_member_location: 16
 <2><40f>: Abbrev Number: 10 (DW_TAG_member)
    <410>   DW_AT_name        : (indirect string, offset: 0x1f3b): __g_size
    <414>   DW_AT_decl_file   : 13
    <415>   DW_AT_decl_line   : 113
    <416>   DW_AT_decl_column : 16
    <417>   DW_AT_type        : <0x444>
    <41b>   DW_AT_data_member_location: 24
 <2><41c>: Abbrev Number: 10 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x118b): __g1_orig_size
    <421>   DW_AT_decl_file   : 13
    <422>   DW_AT_decl_line   : 114
    <423>   DW_AT_decl_column : 16
    <424>   DW_AT_type        : <0xe2>
    <428>   DW_AT_data_member_location: 32
 <2><429>: Abbrev Number: 10 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x1641): __wrefs
    <42e>   DW_AT_decl_file   : 13
    <42f>   DW_AT_decl_line   : 115
    <430>   DW_AT_decl_column : 16
    <431>   DW_AT_type        : <0xe2>
    <435>   DW_AT_data_member_location: 36
 <2><436>: Abbrev Number: 10 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x2d8e): __g_signals
    <43b>   DW_AT_decl_file   : 13
    <43c>   DW_AT_decl_line   : 116
    <43d>   DW_AT_decl_column : 16
    <43e>   DW_AT_type        : <0x444>
    <442>   DW_AT_data_member_location: 40
 <2><443>: Abbrev Number: 0
 <1><444>: Abbrev Number: 13 (DW_TAG_array_type)
    <445>   DW_AT_type        : <0xe2>
    <449>   DW_AT_sibling     : <0x454>
 <2><44d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <44e>   DW_AT_type        : <0xe9>
    <452>   DW_AT_upper_bound : 1
 <2><453>: Abbrev Number: 0
 <1><454>: Abbrev Number: 12 (DW_TAG_typedef)
    <455>   DW_AT_name        : (indirect string, offset: 0x63d): pthread_t
    <459>   DW_AT_decl_file   : 15
    <45a>   DW_AT_decl_line   : 27
    <45b>   DW_AT_decl_column : 27
    <45c>   DW_AT_type        : <0xe9>
 <1><460>: Abbrev Number: 17 (DW_TAG_union_type)
    <461>   DW_AT_byte_size   : 4
    <462>   DW_AT_decl_file   : 15
    <463>   DW_AT_decl_line   : 32
    <464>   DW_AT_decl_column : 9
    <465>   DW_AT_sibling     : <0x482>
 <2><469>: Abbrev Number: 18 (DW_TAG_member)
    <46a>   DW_AT_name        : (indirect string, offset: 0x1416): __size
    <46e>   DW_AT_decl_file   : 15
    <46f>   DW_AT_decl_line   : 34
    <470>   DW_AT_decl_column : 8
    <471>   DW_AT_type        : <0x482>
 <2><475>: Abbrev Number: 18 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0x27): __align
    <47a>   DW_AT_decl_file   : 15
    <47b>   DW_AT_decl_line   : 35
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x61>
 <2><481>: Abbrev Number: 0
 <1><482>: Abbrev Number: 13 (DW_TAG_array_type)
    <483>   DW_AT_type        : <0x49>
    <487>   DW_AT_sibling     : <0x492>
 <2><48b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <48c>   DW_AT_type        : <0xe9>
    <490>   DW_AT_upper_bound : 3
 <2><491>: Abbrev Number: 0
 <1><492>: Abbrev Number: 12 (DW_TAG_typedef)
    <493>   DW_AT_name        : (indirect string, offset: 0x1d7f): pthread_mutexattr_t
    <497>   DW_AT_decl_file   : 15
    <498>   DW_AT_decl_line   : 36
    <499>   DW_AT_decl_column : 3
    <49a>   DW_AT_type        : <0x460>
 <1><49e>: Abbrev Number: 4 (DW_TAG_const_type)
    <49f>   DW_AT_type        : <0x492>
 <1><4a3>: Abbrev Number: 17 (DW_TAG_union_type)
    <4a4>   DW_AT_byte_size   : 4
    <4a5>   DW_AT_decl_file   : 15
    <4a6>   DW_AT_decl_line   : 41
    <4a7>   DW_AT_decl_column : 9
    <4a8>   DW_AT_sibling     : <0x4c5>
 <2><4ac>: Abbrev Number: 18 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x1416): __size
    <4b1>   DW_AT_decl_file   : 15
    <4b2>   DW_AT_decl_line   : 43
    <4b3>   DW_AT_decl_column : 8
    <4b4>   DW_AT_type        : <0x482>
 <2><4b8>: Abbrev Number: 18 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x27): __align
    <4bd>   DW_AT_decl_file   : 15
    <4be>   DW_AT_decl_line   : 44
    <4bf>   DW_AT_decl_column : 7
    <4c0>   DW_AT_type        : <0x61>
 <2><4c4>: Abbrev Number: 0
 <1><4c5>: Abbrev Number: 12 (DW_TAG_typedef)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x218): pthread_condattr_t
    <4ca>   DW_AT_decl_file   : 15
    <4cb>   DW_AT_decl_line   : 45
    <4cc>   DW_AT_decl_column : 3
    <4cd>   DW_AT_type        : <0x4a3>
 <1><4d1>: Abbrev Number: 4 (DW_TAG_const_type)
    <4d2>   DW_AT_type        : <0x4c5>
 <1><4d6>: Abbrev Number: 20 (DW_TAG_union_type)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x3397): pthread_attr_t
    <4db>   DW_AT_byte_size   : 56
    <4dc>   DW_AT_decl_file   : 15
    <4dd>   DW_AT_decl_line   : 56
    <4de>   DW_AT_decl_column : 7
    <4df>   DW_AT_sibling     : <0x4fc>
 <2><4e3>: Abbrev Number: 18 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x1416): __size
    <4e8>   DW_AT_decl_file   : 15
    <4e9>   DW_AT_decl_line   : 58
    <4ea>   DW_AT_decl_column : 8
    <4eb>   DW_AT_type        : <0x4fc>
 <2><4ef>: Abbrev Number: 18 (DW_TAG_member)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x27): __align
    <4f4>   DW_AT_decl_file   : 15
    <4f5>   DW_AT_decl_line   : 59
    <4f6>   DW_AT_decl_column : 12
    <4f7>   DW_AT_type        : <0x10a>
 <2><4fb>: Abbrev Number: 0
 <1><4fc>: Abbrev Number: 13 (DW_TAG_array_type)
    <4fd>   DW_AT_type        : <0x49>
    <501>   DW_AT_sibling     : <0x50c>
 <2><505>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <506>   DW_AT_type        : <0xe9>
    <50a>   DW_AT_upper_bound : 55
 <2><50b>: Abbrev Number: 0
 <1><50c>: Abbrev Number: 12 (DW_TAG_typedef)
    <50d>   DW_AT_name        : (indirect string, offset: 0x3397): pthread_attr_t
    <511>   DW_AT_decl_file   : 15
    <512>   DW_AT_decl_line   : 62
    <513>   DW_AT_decl_column : 30
    <514>   DW_AT_type        : <0x4d6>
 <1><518>: Abbrev Number: 4 (DW_TAG_const_type)
    <519>   DW_AT_type        : <0x50c>
 <1><51d>: Abbrev Number: 17 (DW_TAG_union_type)
    <51e>   DW_AT_byte_size   : 40
    <51f>   DW_AT_decl_file   : 15
    <520>   DW_AT_decl_line   : 67
    <521>   DW_AT_decl_column : 9
    <522>   DW_AT_sibling     : <0x54b>
 <2><526>: Abbrev Number: 18 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0xce7): __data
    <52b>   DW_AT_decl_file   : 15
    <52c>   DW_AT_decl_line   : 69
    <52d>   DW_AT_decl_column : 28
    <52e>   DW_AT_type        : <0x2e0>
 <2><532>: Abbrev Number: 18 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x1416): __size
    <537>   DW_AT_decl_file   : 15
    <538>   DW_AT_decl_line   : 70
    <539>   DW_AT_decl_column : 8
    <53a>   DW_AT_type        : <0x54b>
 <2><53e>: Abbrev Number: 18 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x27): __align
    <543>   DW_AT_decl_file   : 15
    <544>   DW_AT_decl_line   : 71
    <545>   DW_AT_decl_column : 12
    <546>   DW_AT_type        : <0x10a>
 <2><54a>: Abbrev Number: 0
 <1><54b>: Abbrev Number: 13 (DW_TAG_array_type)
    <54c>   DW_AT_type        : <0x49>
    <550>   DW_AT_sibling     : <0x55b>
 <2><554>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <555>   DW_AT_type        : <0xe9>
    <559>   DW_AT_upper_bound : 39
 <2><55a>: Abbrev Number: 0
 <1><55b>: Abbrev Number: 12 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0xe85): pthread_mutex_t
    <560>   DW_AT_decl_file   : 15
    <561>   DW_AT_decl_line   : 72
    <562>   DW_AT_decl_column : 3
    <563>   DW_AT_type        : <0x51d>
 <1><567>: Abbrev Number: 17 (DW_TAG_union_type)
    <568>   DW_AT_byte_size   : 48
    <569>   DW_AT_decl_file   : 15
    <56a>   DW_AT_decl_line   : 75
    <56b>   DW_AT_decl_column : 9
    <56c>   DW_AT_sibling     : <0x595>
 <2><570>: Abbrev Number: 18 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0xce7): __data
    <575>   DW_AT_decl_file   : 15
    <576>   DW_AT_decl_line   : 77
    <577>   DW_AT_decl_column : 27
    <578>   DW_AT_type        : <0x3e9>
 <2><57c>: Abbrev Number: 18 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x1416): __size
    <581>   DW_AT_decl_file   : 15
    <582>   DW_AT_decl_line   : 78
    <583>   DW_AT_decl_column : 8
    <584>   DW_AT_type        : <0x595>
 <2><588>: Abbrev Number: 18 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x27): __align
    <58d>   DW_AT_decl_file   : 15
    <58e>   DW_AT_decl_line   : 79
    <58f>   DW_AT_decl_column : 31
    <590>   DW_AT_type        : <0x5a5>
 <2><594>: Abbrev Number: 0
 <1><595>: Abbrev Number: 13 (DW_TAG_array_type)
    <596>   DW_AT_type        : <0x49>
    <59a>   DW_AT_sibling     : <0x5a5>
 <2><59e>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <59f>   DW_AT_type        : <0xe9>
    <5a3>   DW_AT_upper_bound : 47
 <2><5a4>: Abbrev Number: 0
 <1><5a5>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a6>   DW_AT_byte_size   : 8
    <5a7>   DW_AT_encoding    : 5	(signed)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x3524): long long int
 <1><5ac>: Abbrev Number: 12 (DW_TAG_typedef)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x1ade): pthread_cond_t
    <5b1>   DW_AT_decl_file   : 15
    <5b2>   DW_AT_decl_line   : 80
    <5b3>   DW_AT_decl_column : 3
    <5b4>   DW_AT_type        : <0x567>
 <1><5b8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5b9>   DW_AT_byte_size   : 8
    <5ba>   DW_AT_type        : <0xdd>
 <1><5be>: Abbrev Number: 12 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x1fb7): ptrdiff_t
    <5c3>   DW_AT_decl_file   : 6
    <5c4>   DW_AT_decl_line   : 143
    <5c5>   DW_AT_decl_column : 26
    <5c6>   DW_AT_type        : <0x10a>
 <1><5ca>: Abbrev Number: 6 (DW_TAG_base_type)
    <5cb>   DW_AT_byte_size   : 16
    <5cc>   DW_AT_encoding    : 4	(float)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x25b3): long double
 <1><5d1>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <5d2>   DW_AT_prototyped  : 1
    <5d2>   DW_AT_sibling     : <0x5dc>
 <2><5d6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5d7>   DW_AT_type        : <0x1bd>
 <2><5db>: Abbrev Number: 0
 <1><5dc>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5dd>   DW_AT_byte_size   : 8
    <5de>   DW_AT_type        : <0x5d1>
 <1><5e2>: Abbrev Number: 23 (DW_TAG_typedef)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x31eb): __compar_fn_t
    <5e7>   DW_AT_decl_file   : 16
    <5e8>   DW_AT_decl_line   : 808
    <5ea>   DW_AT_decl_column : 15
    <5eb>   DW_AT_type        : <0x5ef>
 <1><5ef>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5f0>   DW_AT_byte_size   : 8
    <5f1>   DW_AT_type        : <0x5f5>
 <1><5f5>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <5f6>   DW_AT_prototyped  : 1
    <5f6>   DW_AT_type        : <0x61>
    <5fa>   DW_AT_sibling     : <0x609>
 <2><5fe>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <5ff>   DW_AT_type        : <0x609>
 <2><603>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x609>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 8
    <60b>   DW_AT_type        : <0x614>
 <1><60f>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 25 (DW_TAG_const_type)
 <1><615>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <616>   DW_AT_name        : (indirect string, offset: 0x384a): __rlimit_resource
    <61a>   DW_AT_encoding    : 7	(unsigned)
    <61b>   DW_AT_byte_size   : 4
    <61c>   DW_AT_type        : <0xe2>
    <620>   DW_AT_decl_file   : 17
    <621>   DW_AT_decl_line   : 31
    <622>   DW_AT_decl_column : 6
    <623>   DW_AT_sibling     : <0x69a>
 <2><627>: Abbrev Number: 27 (DW_TAG_enumerator)
    <628>   DW_AT_name        : (indirect string, offset: 0x2837): RLIMIT_CPU
    <62c>   DW_AT_const_value : 0
 <2><62d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <62e>   DW_AT_name        : (indirect string, offset: 0x2d4a): RLIMIT_FSIZE
    <632>   DW_AT_const_value : 1
 <2><633>: Abbrev Number: 27 (DW_TAG_enumerator)
    <634>   DW_AT_name        : (indirect string, offset: 0x5ec): RLIMIT_DATA
    <638>   DW_AT_const_value : 2
 <2><639>: Abbrev Number: 27 (DW_TAG_enumerator)
    <63a>   DW_AT_name        : (indirect string, offset: 0xa8c): RLIMIT_STACK
    <63e>   DW_AT_const_value : 3
 <2><63f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <640>   DW_AT_name        : (indirect string, offset: 0x36e2): RLIMIT_CORE
    <644>   DW_AT_const_value : 4
 <2><645>: Abbrev Number: 27 (DW_TAG_enumerator)
    <646>   DW_AT_name        : (indirect string, offset: 0x32b0): __RLIMIT_RSS
    <64a>   DW_AT_const_value : 5
 <2><64b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <64c>   DW_AT_name        : (indirect string, offset: 0x69f): RLIMIT_NOFILE
    <650>   DW_AT_const_value : 7
 <2><651>: Abbrev Number: 27 (DW_TAG_enumerator)
    <652>   DW_AT_name        : (indirect string, offset: 0x26e2): __RLIMIT_OFILE
    <656>   DW_AT_const_value : 7
 <2><657>: Abbrev Number: 27 (DW_TAG_enumerator)
    <658>   DW_AT_name        : (indirect string, offset: 0x2a8e): RLIMIT_AS
    <65c>   DW_AT_const_value : 9
 <2><65d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <65e>   DW_AT_name        : (indirect string, offset: 0x5b7): __RLIMIT_NPROC
    <662>   DW_AT_const_value : 6
 <2><663>: Abbrev Number: 27 (DW_TAG_enumerator)
    <664>   DW_AT_name        : (indirect string, offset: 0x13f8): __RLIMIT_MEMLOCK
    <668>   DW_AT_const_value : 8
 <2><669>: Abbrev Number: 27 (DW_TAG_enumerator)
    <66a>   DW_AT_name        : (indirect string, offset: 0x1b61): __RLIMIT_LOCKS
    <66e>   DW_AT_const_value : 10
 <2><66f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <670>   DW_AT_name        : (indirect string, offset: 0x1118): __RLIMIT_SIGPENDING
    <674>   DW_AT_const_value : 11
 <2><675>: Abbrev Number: 27 (DW_TAG_enumerator)
    <676>   DW_AT_name        : (indirect string, offset: 0x2aaf): __RLIMIT_MSGQUEUE
    <67a>   DW_AT_const_value : 12
 <2><67b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <67c>   DW_AT_name        : (indirect string, offset: 0x3a43): __RLIMIT_NICE
    <680>   DW_AT_const_value : 13
 <2><681>: Abbrev Number: 27 (DW_TAG_enumerator)
    <682>   DW_AT_name        : (indirect string, offset: 0x3b7e): __RLIMIT_RTPRIO
    <686>   DW_AT_const_value : 14
 <2><687>: Abbrev Number: 27 (DW_TAG_enumerator)
    <688>   DW_AT_name        : (indirect string, offset: 0x716): __RLIMIT_RTTIME
    <68c>   DW_AT_const_value : 15
 <2><68d>: Abbrev Number: 27 (DW_TAG_enumerator)
    <68e>   DW_AT_name        : (indirect string, offset: 0xe95): __RLIMIT_NLIMITS
    <692>   DW_AT_const_value : 16
 <2><693>: Abbrev Number: 27 (DW_TAG_enumerator)
    <694>   DW_AT_name        : (indirect string, offset: 0x32f): __RLIM_NLIMITS
    <698>   DW_AT_const_value : 16
 <2><699>: Abbrev Number: 0
 <1><69a>: Abbrev Number: 12 (DW_TAG_typedef)
    <69b>   DW_AT_name        : (indirect string, offset: 0x13dd): rlim_t
    <69f>   DW_AT_decl_file   : 17
    <6a0>   DW_AT_decl_line   : 131
    <6a1>   DW_AT_decl_column : 18
    <6a2>   DW_AT_type        : <0x1a5>
 <1><6a6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x37d4): rlimit
    <6ab>   DW_AT_byte_size   : 16
    <6ac>   DW_AT_decl_file   : 17
    <6ad>   DW_AT_decl_line   : 139
    <6ae>   DW_AT_decl_column : 8
    <6af>   DW_AT_sibling     : <0x6ce>
 <2><6b3>: Abbrev Number: 10 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x1f16): rlim_cur
    <6b8>   DW_AT_decl_file   : 17
    <6b9>   DW_AT_decl_line   : 142
    <6ba>   DW_AT_decl_column : 12
    <6bb>   DW_AT_type        : <0x69a>
    <6bf>   DW_AT_data_member_location: 0
 <2><6c0>: Abbrev Number: 10 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xab1): rlim_max
    <6c5>   DW_AT_decl_file   : 17
    <6c6>   DW_AT_decl_line   : 144
    <6c7>   DW_AT_decl_column : 12
    <6c8>   DW_AT_type        : <0x69a>
    <6cc>   DW_AT_data_member_location: 8
 <2><6cd>: Abbrev Number: 0
 <1><6ce>: Abbrev Number: 12 (DW_TAG_typedef)
    <6cf>   DW_AT_name        : (indirect string, offset: 0xa6d): __rlimit_resource_t
    <6d3>   DW_AT_decl_file   : 18
    <6d4>   DW_AT_decl_line   : 38
    <6d5>   DW_AT_decl_column : 32
    <6d6>   DW_AT_type        : <0x615>
 <1><6da>: Abbrev Number: 20 (DW_TAG_union_type)
    <6db>   DW_AT_name        : (indirect string, offset: 0x3a87): sigval
    <6df>   DW_AT_byte_size   : 8
    <6e0>   DW_AT_decl_file   : 19
    <6e1>   DW_AT_decl_line   : 24
    <6e2>   DW_AT_decl_column : 7
    <6e3>   DW_AT_sibling     : <0x700>
 <2><6e7>: Abbrev Number: 18 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0x1896): sival_int
    <6ec>   DW_AT_decl_file   : 19
    <6ed>   DW_AT_decl_line   : 26
    <6ee>   DW_AT_decl_column : 7
    <6ef>   DW_AT_type        : <0x61>
 <2><6f3>: Abbrev Number: 18 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xbe7): sival_ptr
    <6f8>   DW_AT_decl_file   : 19
    <6f9>   DW_AT_decl_line   : 27
    <6fa>   DW_AT_decl_column : 9
    <6fb>   DW_AT_type        : <0x1bd>
 <2><6ff>: Abbrev Number: 0
 <1><700>: Abbrev Number: 12 (DW_TAG_typedef)
    <701>   DW_AT_name        : (indirect string, offset: 0x16ca): __sigval_t
    <705>   DW_AT_decl_file   : 19
    <706>   DW_AT_decl_line   : 30
    <707>   DW_AT_decl_column : 22
    <708>   DW_AT_type        : <0x6da>
 <1><70c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <70d>   DW_AT_byte_size   : 8
    <70e>   DW_AT_decl_file   : 20
    <70f>   DW_AT_decl_line   : 56
    <710>   DW_AT_decl_column : 2
    <711>   DW_AT_sibling     : <0x730>
 <2><715>: Abbrev Number: 10 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x1fff): si_pid
    <71a>   DW_AT_decl_file   : 20
    <71b>   DW_AT_decl_line   : 58
    <71c>   DW_AT_decl_column : 14
    <71d>   DW_AT_type        : <0x17d>
    <721>   DW_AT_data_member_location: 0
 <2><722>: Abbrev Number: 10 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x2da): si_uid
    <727>   DW_AT_decl_file   : 20
    <728>   DW_AT_decl_line   : 59
    <729>   DW_AT_decl_column : 14
    <72a>   DW_AT_type        : <0x129>
    <72e>   DW_AT_data_member_location: 4
 <2><72f>: Abbrev Number: 0
 <1><730>: Abbrev Number: 16 (DW_TAG_structure_type)
    <731>   DW_AT_byte_size   : 16
    <732>   DW_AT_decl_file   : 20
    <733>   DW_AT_decl_line   : 63
    <734>   DW_AT_decl_column : 2
    <735>   DW_AT_sibling     : <0x761>
 <2><739>: Abbrev Number: 10 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x36ee): si_tid
    <73e>   DW_AT_decl_file   : 20
    <73f>   DW_AT_decl_line   : 65
    <740>   DW_AT_decl_column : 10
    <741>   DW_AT_type        : <0x61>
    <745>   DW_AT_data_member_location: 0
 <2><746>: Abbrev Number: 10 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x340a): si_overrun
    <74b>   DW_AT_decl_file   : 20
    <74c>   DW_AT_decl_line   : 66
    <74d>   DW_AT_decl_column : 10
    <74e>   DW_AT_type        : <0x61>
    <752>   DW_AT_data_member_location: 4
 <2><753>: Abbrev Number: 10 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x3a84): si_sigval
    <758>   DW_AT_decl_file   : 20
    <759>   DW_AT_decl_line   : 67
    <75a>   DW_AT_decl_column : 17
    <75b>   DW_AT_type        : <0x700>
    <75f>   DW_AT_data_member_location: 8
 <2><760>: Abbrev Number: 0
 <1><761>: Abbrev Number: 16 (DW_TAG_structure_type)
    <762>   DW_AT_byte_size   : 16
    <763>   DW_AT_decl_file   : 20
    <764>   DW_AT_decl_line   : 71
    <765>   DW_AT_decl_column : 2
    <766>   DW_AT_sibling     : <0x792>
 <2><76a>: Abbrev Number: 10 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x1fff): si_pid
    <76f>   DW_AT_decl_file   : 20
    <770>   DW_AT_decl_line   : 73
    <771>   DW_AT_decl_column : 14
    <772>   DW_AT_type        : <0x17d>
    <776>   DW_AT_data_member_location: 0
 <2><777>: Abbrev Number: 10 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x2da): si_uid
    <77c>   DW_AT_decl_file   : 20
    <77d>   DW_AT_decl_line   : 74
    <77e>   DW_AT_decl_column : 14
    <77f>   DW_AT_type        : <0x129>
    <783>   DW_AT_data_member_location: 4
 <2><784>: Abbrev Number: 10 (DW_TAG_member)
    <785>   DW_AT_name        : (indirect string, offset: 0x3a84): si_sigval
    <789>   DW_AT_decl_file   : 20
    <78a>   DW_AT_decl_line   : 75
    <78b>   DW_AT_decl_column : 17
    <78c>   DW_AT_type        : <0x700>
    <790>   DW_AT_data_member_location: 8
 <2><791>: Abbrev Number: 0
 <1><792>: Abbrev Number: 16 (DW_TAG_structure_type)
    <793>   DW_AT_byte_size   : 32
    <794>   DW_AT_decl_file   : 20
    <795>   DW_AT_decl_line   : 79
    <796>   DW_AT_decl_column : 2
    <797>   DW_AT_sibling     : <0x7dd>
 <2><79b>: Abbrev Number: 10 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x1fff): si_pid
    <7a0>   DW_AT_decl_file   : 20
    <7a1>   DW_AT_decl_line   : 81
    <7a2>   DW_AT_decl_column : 14
    <7a3>   DW_AT_type        : <0x17d>
    <7a7>   DW_AT_data_member_location: 0
 <2><7a8>: Abbrev Number: 10 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x2da): si_uid
    <7ad>   DW_AT_decl_file   : 20
    <7ae>   DW_AT_decl_line   : 82
    <7af>   DW_AT_decl_column : 14
    <7b0>   DW_AT_type        : <0x129>
    <7b4>   DW_AT_data_member_location: 4
 <2><7b5>: Abbrev Number: 10 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0x26c6): si_status
    <7ba>   DW_AT_decl_file   : 20
    <7bb>   DW_AT_decl_line   : 83
    <7bc>   DW_AT_decl_column : 10
    <7bd>   DW_AT_type        : <0x61>
    <7c1>   DW_AT_data_member_location: 8
 <2><7c2>: Abbrev Number: 10 (DW_TAG_member)
    <7c3>   DW_AT_name        : (indirect string, offset: 0x313c): si_utime
    <7c7>   DW_AT_decl_file   : 20
    <7c8>   DW_AT_decl_line   : 84
    <7c9>   DW_AT_decl_column : 19
    <7ca>   DW_AT_type        : <0x199>
    <7ce>   DW_AT_data_member_location: 16
 <2><7cf>: Abbrev Number: 10 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xc2d): si_stime
    <7d4>   DW_AT_decl_file   : 20
    <7d5>   DW_AT_decl_line   : 85
    <7d6>   DW_AT_decl_column : 19
    <7d7>   DW_AT_type        : <0x199>
    <7db>   DW_AT_data_member_location: 24
 <2><7dc>: Abbrev Number: 0
 <1><7dd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7de>   DW_AT_byte_size   : 16
    <7df>   DW_AT_decl_file   : 20
    <7e0>   DW_AT_decl_line   : 97
    <7e1>   DW_AT_decl_column : 3
    <7e2>   DW_AT_sibling     : <0x801>
 <2><7e6>: Abbrev Number: 10 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x1be8): _lower
    <7eb>   DW_AT_decl_file   : 20
    <7ec>   DW_AT_decl_line   : 99
    <7ed>   DW_AT_decl_column : 13
    <7ee>   DW_AT_type        : <0x1bd>
    <7f2>   DW_AT_data_member_location: 0
 <2><7f3>: Abbrev Number: 10 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x6d4): _upper
    <7f8>   DW_AT_decl_file   : 20
    <7f9>   DW_AT_decl_line   : 100
    <7fa>   DW_AT_decl_column : 13
    <7fb>   DW_AT_type        : <0x1bd>
    <7ff>   DW_AT_data_member_location: 8
 <2><800>: Abbrev Number: 0
 <1><801>: Abbrev Number: 17 (DW_TAG_union_type)
    <802>   DW_AT_byte_size   : 16
    <803>   DW_AT_decl_file   : 20
    <804>   DW_AT_decl_line   : 94
    <805>   DW_AT_decl_column : 6
    <806>   DW_AT_sibling     : <0x823>
 <2><80a>: Abbrev Number: 18 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0x4ec): _addr_bnd
    <80f>   DW_AT_decl_file   : 20
    <810>   DW_AT_decl_line   : 101
    <811>   DW_AT_decl_column : 7
    <812>   DW_AT_type        : <0x7dd>
 <2><816>: Abbrev Number: 18 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x26dc): _pkey
    <81b>   DW_AT_decl_file   : 20
    <81c>   DW_AT_decl_line   : 103
    <81d>   DW_AT_decl_column : 14
    <81e>   DW_AT_type        : <0xfe>
 <2><822>: Abbrev Number: 0
 <1><823>: Abbrev Number: 16 (DW_TAG_structure_type)
    <824>   DW_AT_byte_size   : 32
    <825>   DW_AT_decl_file   : 20
    <826>   DW_AT_decl_line   : 89
    <827>   DW_AT_decl_column : 2
    <828>   DW_AT_sibling     : <0x854>
 <2><82c>: Abbrev Number: 10 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x174e): si_addr
    <831>   DW_AT_decl_file   : 20
    <832>   DW_AT_decl_line   : 91
    <833>   DW_AT_decl_column : 12
    <834>   DW_AT_type        : <0x1bd>
    <838>   DW_AT_data_member_location: 0
 <2><839>: Abbrev Number: 10 (DW_TAG_member)
    <83a>   DW_AT_name        : (indirect string, offset: 0x60): si_addr_lsb
    <83e>   DW_AT_decl_file   : 20
    <83f>   DW_AT_decl_line   : 93
    <840>   DW_AT_decl_column : 16
    <841>   DW_AT_type        : <0xf7>
    <845>   DW_AT_data_member_location: 8
 <2><846>: Abbrev Number: 10 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x2053): _bounds
    <84b>   DW_AT_decl_file   : 20
    <84c>   DW_AT_decl_line   : 104
    <84d>   DW_AT_decl_column : 10
    <84e>   DW_AT_type        : <0x801>
    <852>   DW_AT_data_member_location: 16
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 16 (DW_TAG_structure_type)
    <855>   DW_AT_byte_size   : 16
    <856>   DW_AT_decl_file   : 20
    <857>   DW_AT_decl_line   : 108
    <858>   DW_AT_decl_column : 2
    <859>   DW_AT_sibling     : <0x878>
 <2><85d>: Abbrev Number: 10 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0x2c72): si_band
    <862>   DW_AT_decl_file   : 20
    <863>   DW_AT_decl_line   : 110
    <864>   DW_AT_decl_column : 21
    <865>   DW_AT_type        : <0x10a>
    <869>   DW_AT_data_member_location: 0
 <2><86a>: Abbrev Number: 10 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x31f9): si_fd
    <86f>   DW_AT_decl_file   : 20
    <870>   DW_AT_decl_line   : 111
    <871>   DW_AT_decl_column : 10
    <872>   DW_AT_type        : <0x61>
    <876>   DW_AT_data_member_location: 8
 <2><877>: Abbrev Number: 0
 <1><878>: Abbrev Number: 16 (DW_TAG_structure_type)
    <879>   DW_AT_byte_size   : 16
    <87a>   DW_AT_decl_file   : 20
    <87b>   DW_AT_decl_line   : 116
    <87c>   DW_AT_decl_column : 2
    <87d>   DW_AT_sibling     : <0x8a9>
 <2><881>: Abbrev Number: 10 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0xd4f): _call_addr
    <886>   DW_AT_decl_file   : 20
    <887>   DW_AT_decl_line   : 118
    <888>   DW_AT_decl_column : 12
    <889>   DW_AT_type        : <0x1bd>
    <88d>   DW_AT_data_member_location: 0
 <2><88e>: Abbrev Number: 10 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x8ce): _syscall
    <893>   DW_AT_decl_file   : 20
    <894>   DW_AT_decl_line   : 119
    <895>   DW_AT_decl_column : 10
    <896>   DW_AT_type        : <0x61>
    <89a>   DW_AT_data_member_location: 8
 <2><89b>: Abbrev Number: 10 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x490): _arch
    <8a0>   DW_AT_decl_file   : 20
    <8a1>   DW_AT_decl_line   : 120
    <8a2>   DW_AT_decl_column : 19
    <8a3>   DW_AT_type        : <0xe2>
    <8a7>   DW_AT_data_member_location: 12
 <2><8a8>: Abbrev Number: 0
 <1><8a9>: Abbrev Number: 17 (DW_TAG_union_type)
    <8aa>   DW_AT_byte_size   : 112
    <8ab>   DW_AT_decl_file   : 20
    <8ac>   DW_AT_decl_line   : 51
    <8ad>   DW_AT_decl_column : 5
    <8ae>   DW_AT_sibling     : <0x913>
 <2><8b2>: Abbrev Number: 18 (DW_TAG_member)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x1ddd): _pad
    <8b7>   DW_AT_decl_file   : 20
    <8b8>   DW_AT_decl_line   : 53
    <8b9>   DW_AT_decl_column : 6
    <8ba>   DW_AT_type        : <0x913>
 <2><8be>: Abbrev Number: 18 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xa67): _kill
    <8c3>   DW_AT_decl_file   : 20
    <8c4>   DW_AT_decl_line   : 60
    <8c5>   DW_AT_decl_column : 6
    <8c6>   DW_AT_type        : <0x70c>
 <2><8ca>: Abbrev Number: 18 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x7ca): _timer
    <8cf>   DW_AT_decl_file   : 20
    <8d0>   DW_AT_decl_line   : 68
    <8d1>   DW_AT_decl_column : 6
    <8d2>   DW_AT_type        : <0x730>
 <2><8d6>: Abbrev Number: 28 (DW_TAG_member)
    <8d7>   DW_AT_name        : _rt
    <8db>   DW_AT_decl_file   : 20
    <8dc>   DW_AT_decl_line   : 76
    <8dd>   DW_AT_decl_column : 6
    <8de>   DW_AT_type        : <0x761>
 <2><8e2>: Abbrev Number: 18 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x6b3): _sigchld
    <8e7>   DW_AT_decl_file   : 20
    <8e8>   DW_AT_decl_line   : 86
    <8e9>   DW_AT_decl_column : 6
    <8ea>   DW_AT_type        : <0x792>
 <2><8ee>: Abbrev Number: 18 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x3114): _sigfault
    <8f3>   DW_AT_decl_file   : 20
    <8f4>   DW_AT_decl_line   : 105
    <8f5>   DW_AT_decl_column : 6
    <8f6>   DW_AT_type        : <0x823>
 <2><8fa>: Abbrev Number: 18 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x416): _sigpoll
    <8ff>   DW_AT_decl_file   : 20
    <900>   DW_AT_decl_line   : 112
    <901>   DW_AT_decl_column : 6
    <902>   DW_AT_type        : <0x854>
 <2><906>: Abbrev Number: 18 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x2099): _sigsys
    <90b>   DW_AT_decl_file   : 20
    <90c>   DW_AT_decl_line   : 121
    <90d>   DW_AT_decl_column : 6
    <90e>   DW_AT_type        : <0x878>
 <2><912>: Abbrev Number: 0
 <1><913>: Abbrev Number: 13 (DW_TAG_array_type)
    <914>   DW_AT_type        : <0x61>
    <918>   DW_AT_sibling     : <0x923>
 <2><91c>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <91d>   DW_AT_type        : <0xe9>
    <921>   DW_AT_upper_bound : 27
 <2><922>: Abbrev Number: 0
 <1><923>: Abbrev Number: 16 (DW_TAG_structure_type)
    <924>   DW_AT_byte_size   : 128
    <925>   DW_AT_decl_file   : 20
    <926>   DW_AT_decl_line   : 36
    <927>   DW_AT_decl_column : 9
    <928>   DW_AT_sibling     : <0x96e>
 <2><92c>: Abbrev Number: 10 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0x2a98): si_signo
    <931>   DW_AT_decl_file   : 20
    <932>   DW_AT_decl_line   : 38
    <933>   DW_AT_decl_column : 9
    <934>   DW_AT_type        : <0x61>
    <938>   DW_AT_data_member_location: 0
 <2><939>: Abbrev Number: 10 (DW_TAG_member)
    <93a>   DW_AT_name        : (indirect string, offset: 0x2be4): si_errno
    <93e>   DW_AT_decl_file   : 20
    <93f>   DW_AT_decl_line   : 40
    <940>   DW_AT_decl_column : 9
    <941>   DW_AT_type        : <0x61>
    <945>   DW_AT_data_member_location: 4
 <2><946>: Abbrev Number: 10 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0x18cd): si_code
    <94b>   DW_AT_decl_file   : 20
    <94c>   DW_AT_decl_line   : 42
    <94d>   DW_AT_decl_column : 9
    <94e>   DW_AT_type        : <0x61>
    <952>   DW_AT_data_member_location: 8
 <2><953>: Abbrev Number: 10 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0x2b54): __pad0
    <958>   DW_AT_decl_file   : 20
    <959>   DW_AT_decl_line   : 48
    <95a>   DW_AT_decl_column : 9
    <95b>   DW_AT_type        : <0x61>
    <95f>   DW_AT_data_member_location: 12
 <2><960>: Abbrev Number: 10 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x2946): _sifields
    <965>   DW_AT_decl_file   : 20
    <966>   DW_AT_decl_line   : 123
    <967>   DW_AT_decl_column : 9
    <968>   DW_AT_type        : <0x8a9>
    <96c>   DW_AT_data_member_location: 16
 <2><96d>: Abbrev Number: 0
 <1><96e>: Abbrev Number: 12 (DW_TAG_typedef)
    <96f>   DW_AT_name        : (indirect string, offset: 0x34c2): siginfo_t
    <973>   DW_AT_decl_file   : 20
    <974>   DW_AT_decl_line   : 124
    <975>   DW_AT_decl_column : 5
    <976>   DW_AT_type        : <0x923>
 <1><97a>: Abbrev Number: 12 (DW_TAG_typedef)
    <97b>   DW_AT_name        : (indirect string, offset: 0x1b05): __sighandler_t
    <97f>   DW_AT_decl_file   : 21
    <980>   DW_AT_decl_line   : 72
    <981>   DW_AT_decl_column : 16
    <982>   DW_AT_type        : <0x986>
 <1><986>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <987>   DW_AT_byte_size   : 8
    <988>   DW_AT_type        : <0x98c>
 <1><98c>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <98d>   DW_AT_prototyped  : 1
    <98d>   DW_AT_sibling     : <0x997>
 <2><991>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <992>   DW_AT_type        : <0x61>
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 17 (DW_TAG_union_type)
    <998>   DW_AT_byte_size   : 8
    <999>   DW_AT_decl_file   : 22
    <99a>   DW_AT_decl_line   : 31
    <99b>   DW_AT_decl_column : 5
    <99c>   DW_AT_sibling     : <0x9b9>
 <2><9a0>: Abbrev Number: 18 (DW_TAG_member)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x2fda): sa_handler
    <9a5>   DW_AT_decl_file   : 22
    <9a6>   DW_AT_decl_line   : 34
    <9a7>   DW_AT_decl_column : 17
    <9a8>   DW_AT_type        : <0x97a>
 <2><9ac>: Abbrev Number: 18 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x22e7): sa_sigaction
    <9b1>   DW_AT_decl_file   : 22
    <9b2>   DW_AT_decl_line   : 36
    <9b3>   DW_AT_decl_column : 9
    <9b4>   DW_AT_type        : <0x9d4>
 <2><9b8>: Abbrev Number: 0
 <1><9b9>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <9ba>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_sibling     : <0x9ce>
 <2><9be>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9bf>   DW_AT_type        : <0x61>
 <2><9c3>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9c4>   DW_AT_type        : <0x9ce>
 <2><9c8>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9c9>   DW_AT_type        : <0x1bd>
 <2><9cd>: Abbrev Number: 0
 <1><9ce>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9cf>   DW_AT_byte_size   : 8
    <9d0>   DW_AT_type        : <0x96e>
 <1><9d4>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <9d5>   DW_AT_byte_size   : 8
    <9d6>   DW_AT_type        : <0x9b9>
 <1><9da>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9db>   DW_AT_name        : (indirect string, offset: 0x22ea): sigaction
    <9df>   DW_AT_byte_size   : 152
    <9e0>   DW_AT_decl_file   : 22
    <9e1>   DW_AT_decl_line   : 27
    <9e2>   DW_AT_decl_column : 8
    <9e3>   DW_AT_sibling     : <0xa1c>
 <2><9e7>: Abbrev Number: 10 (DW_TAG_member)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x24a1): __sigaction_handler
    <9ec>   DW_AT_decl_file   : 22
    <9ed>   DW_AT_decl_line   : 38
    <9ee>   DW_AT_decl_column : 5
    <9ef>   DW_AT_type        : <0x997>
    <9f3>   DW_AT_data_member_location: 0
 <2><9f4>: Abbrev Number: 10 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x164e): sa_mask
    <9f9>   DW_AT_decl_file   : 22
    <9fa>   DW_AT_decl_line   : 46
    <9fb>   DW_AT_decl_column : 16
    <9fc>   DW_AT_type        : <0x284>
    <a00>   DW_AT_data_member_location: 8
 <2><a01>: Abbrev Number: 10 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0xffd): sa_flags
    <a06>   DW_AT_decl_file   : 22
    <a07>   DW_AT_decl_line   : 49
    <a08>   DW_AT_decl_column : 9
    <a09>   DW_AT_type        : <0x61>
    <a0d>   DW_AT_data_member_location: 136
 <2><a0e>: Abbrev Number: 10 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x814): sa_restorer
    <a13>   DW_AT_decl_file   : 22
    <a14>   DW_AT_decl_line   : 52
    <a15>   DW_AT_decl_column : 12
    <a16>   DW_AT_type        : <0xa22>
    <a1a>   DW_AT_data_member_location: 144
 <2><a1b>: Abbrev Number: 0
 <1><a1c>: Abbrev Number: 4 (DW_TAG_const_type)
    <a1d>   DW_AT_type        : <0x9da>
 <1><a21>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <a22>   DW_AT_prototyped  : 1
 <1><a22>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a23>   DW_AT_byte_size   : 8
    <a24>   DW_AT_type        : <0xa21>
 <1><a28>: Abbrev Number: 9 (DW_TAG_structure_type)
    <a29>   DW_AT_name        : (indirect string, offset: 0x6ae): stat
    <a2d>   DW_AT_byte_size   : 144
    <a2e>   DW_AT_decl_file   : 23
    <a2f>   DW_AT_decl_line   : 46
    <a30>   DW_AT_decl_column : 8
    <a31>   DW_AT_sibling     : <0xaf9>
 <2><a35>: Abbrev Number: 10 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0x2d9f): st_dev
    <a3a>   DW_AT_decl_file   : 23
    <a3b>   DW_AT_decl_line   : 48
    <a3c>   DW_AT_decl_column : 13
    <a3d>   DW_AT_type        : <0x11d>
    <a41>   DW_AT_data_member_location: 0
 <2><a42>: Abbrev Number: 10 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0x1772): st_ino
    <a47>   DW_AT_decl_file   : 23
    <a48>   DW_AT_decl_line   : 53
    <a49>   DW_AT_decl_column : 13
    <a4a>   DW_AT_type        : <0x141>
    <a4e>   DW_AT_data_member_location: 8
 <2><a4f>: Abbrev Number: 10 (DW_TAG_member)
    <a50>   DW_AT_name        : (indirect string, offset: 0x86f): st_nlink
    <a54>   DW_AT_decl_file   : 23
    <a55>   DW_AT_decl_line   : 61
    <a56>   DW_AT_decl_column : 15
    <a57>   DW_AT_type        : <0x159>
    <a5b>   DW_AT_data_member_location: 16
 <2><a5c>: Abbrev Number: 10 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x1779): st_mode
    <a61>   DW_AT_decl_file   : 23
    <a62>   DW_AT_decl_line   : 62
    <a63>   DW_AT_decl_column : 14
    <a64>   DW_AT_type        : <0x14d>
    <a68>   DW_AT_data_member_location: 24
 <2><a69>: Abbrev Number: 10 (DW_TAG_member)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x1b7b): st_uid
    <a6e>   DW_AT_decl_file   : 23
    <a6f>   DW_AT_decl_line   : 64
    <a70>   DW_AT_decl_column : 13
    <a71>   DW_AT_type        : <0x129>
    <a75>   DW_AT_data_member_location: 28
 <2><a76>: Abbrev Number: 10 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0x780): st_gid
    <a7b>   DW_AT_decl_file   : 23
    <a7c>   DW_AT_decl_line   : 65
    <a7d>   DW_AT_decl_column : 13
    <a7e>   DW_AT_type        : <0x135>
    <a82>   DW_AT_data_member_location: 32
 <2><a83>: Abbrev Number: 10 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0x2b54): __pad0
    <a88>   DW_AT_decl_file   : 23
    <a89>   DW_AT_decl_line   : 67
    <a8a>   DW_AT_decl_column : 9
    <a8b>   DW_AT_type        : <0x61>
    <a8f>   DW_AT_data_member_location: 36
 <2><a90>: Abbrev Number: 10 (DW_TAG_member)
    <a91>   DW_AT_name        : (indirect string, offset: 0x2d75): st_rdev
    <a95>   DW_AT_decl_file   : 23
    <a96>   DW_AT_decl_line   : 69
    <a97>   DW_AT_decl_column : 13
    <a98>   DW_AT_type        : <0x11d>
    <a9c>   DW_AT_data_member_location: 40
 <2><a9d>: Abbrev Number: 10 (DW_TAG_member)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x501): st_size
    <aa2>   DW_AT_decl_file   : 23
    <aa3>   DW_AT_decl_line   : 74
    <aa4>   DW_AT_decl_column : 13
    <aa5>   DW_AT_type        : <0x165>
    <aa9>   DW_AT_data_member_location: 48
 <2><aaa>: Abbrev Number: 10 (DW_TAG_member)
    <aab>   DW_AT_name        : (indirect string, offset: 0x694): st_blksize
    <aaf>   DW_AT_decl_file   : 23
    <ab0>   DW_AT_decl_line   : 78
    <ab1>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x1c4>
    <ab6>   DW_AT_data_member_location: 56
 <2><ab7>: Abbrev Number: 10 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x3234): st_blocks
    <abc>   DW_AT_decl_file   : 23
    <abd>   DW_AT_decl_line   : 80
    <abe>   DW_AT_decl_column : 16
    <abf>   DW_AT_type        : <0x1d0>
    <ac3>   DW_AT_data_member_location: 64
 <2><ac4>: Abbrev Number: 10 (DW_TAG_member)
    <ac5>   DW_AT_name        : (indirect string, offset: 0xaf0): st_atim
    <ac9>   DW_AT_decl_file   : 23
    <aca>   DW_AT_decl_line   : 91
    <acb>   DW_AT_decl_column : 21
    <acc>   DW_AT_type        : <0x211>
    <ad0>   DW_AT_data_member_location: 72
 <2><ad1>: Abbrev Number: 10 (DW_TAG_member)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x3a3b): st_mtim
    <ad6>   DW_AT_decl_file   : 23
    <ad7>   DW_AT_decl_line   : 92
    <ad8>   DW_AT_decl_column : 21
    <ad9>   DW_AT_type        : <0x211>
    <add>   DW_AT_data_member_location: 88
 <2><ade>: Abbrev Number: 10 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x90c): st_ctim
    <ae3>   DW_AT_decl_file   : 23
    <ae4>   DW_AT_decl_line   : 93
    <ae5>   DW_AT_decl_column : 21
    <ae6>   DW_AT_type        : <0x211>
    <aea>   DW_AT_data_member_location: 104
 <2><aeb>: Abbrev Number: 10 (DW_TAG_member)
    <aec>   DW_AT_name        : (indirect string, offset: 0x2842): __glibc_reserved
    <af0>   DW_AT_decl_file   : 23
    <af1>   DW_AT_decl_line   : 106
    <af2>   DW_AT_decl_column : 23
    <af3>   DW_AT_type        : <0xaf9>
    <af7>   DW_AT_data_member_location: 120
 <2><af8>: Abbrev Number: 0
 <1><af9>: Abbrev Number: 13 (DW_TAG_array_type)
    <afa>   DW_AT_type        : <0x1e8>
    <afe>   DW_AT_sibling     : <0xb09>
 <2><b02>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <b03>   DW_AT_type        : <0xe9>
    <b07>   DW_AT_upper_bound : 2
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b0a>   DW_AT_byte_size   : 8
    <b0b>   DW_AT_type        : <0x39>
 <1><b0f>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <b10>   DW_AT_type        : <0xb09>
 <1><b14>: Abbrev Number: 2 (DW_TAG_variable)
    <b15>   DW_AT_name        : (indirect string, offset: 0x1006): Version
    <b19>   DW_AT_decl_file   : 24
    <b1a>   DW_AT_decl_line   : 1
    <b1b>   DW_AT_decl_column : 20
    <b1c>   DW_AT_type        : <0xb9>
    <b20>   DW_AT_external    : 1
    <b20>   DW_AT_declaration : 1
 <1><b20>: Abbrev Number: 2 (DW_TAG_variable)
    <b21>   DW_AT_name        : (indirect string, offset: 0x1348): exit_failure
    <b25>   DW_AT_decl_file   : 25
    <b26>   DW_AT_decl_line   : 18
    <b27>   DW_AT_decl_column : 21
    <b28>   DW_AT_type        : <0x68>
    <b2c>   DW_AT_external    : 1
    <b2c>   DW_AT_declaration : 1
 <1><b2c>: Abbrev Number: 13 (DW_TAG_array_type)
    <b2d>   DW_AT_type        : <0x49>
    <b31>   DW_AT_sibling     : <0xb3c>
 <2><b35>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <b36>   DW_AT_type        : <0xe9>
    <b3a>   DW_AT_upper_bound : 255
 <2><b3b>: Abbrev Number: 0
 <1><b3c>: Abbrev Number: 12 (DW_TAG_typedef)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x2e1e): uint32_t
    <b41>   DW_AT_decl_file   : 26
    <b42>   DW_AT_decl_line   : 26
    <b43>   DW_AT_decl_column : 20
    <b44>   DW_AT_type        : <0xfe>
 <1><b48>: Abbrev Number: 12 (DW_TAG_typedef)
    <b49>   DW_AT_name        : (indirect string, offset: 0xae6): uintmax_t
    <b4d>   DW_AT_decl_file   : 27
    <b4e>   DW_AT_decl_line   : 102
    <b4f>   DW_AT_decl_column : 22
    <b50>   DW_AT_type        : <0x111>
 <1><b54>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b55>   DW_AT_encoding    : 7	(unsigned)
    <b56>   DW_AT_byte_size   : 4
    <b57>   DW_AT_type        : <0xe2>
    <b5b>   DW_AT_decl_file   : 28
    <b5c>   DW_AT_decl_line   : 41
    <b5d>   DW_AT_decl_column : 6
    <b5e>   DW_AT_sibling     : <0xb6c>
 <2><b62>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x2981): TIMESPEC_HZ
    <b67>   DW_AT_const_value : 0x3b9aca00
 <2><b6b>: Abbrev Number: 0
 <1><b6c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b6d>   DW_AT_encoding    : 7	(unsigned)
    <b6e>   DW_AT_byte_size   : 4
    <b6f>   DW_AT_type        : <0xe2>
    <b73>   DW_AT_decl_file   : 28
    <b74>   DW_AT_decl_line   : 42
    <b75>   DW_AT_decl_column : 6
    <b76>   DW_AT_sibling     : <0xb81>
 <2><b7a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x297b): LOG10_TIMESPEC_HZ
    <b7f>   DW_AT_const_value : 9
 <2><b80>: Abbrev Number: 0
 <1><b81>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b82>   DW_AT_encoding    : 7	(unsigned)
    <b83>   DW_AT_byte_size   : 4
    <b84>   DW_AT_type        : <0xe2>
    <b88>   DW_AT_decl_file   : 29
    <b89>   DW_AT_decl_line   : 47
    <b8a>   DW_AT_decl_column : 1
    <b8b>   DW_AT_sibling     : <0xbe0>
 <2><b8f>: Abbrev Number: 32 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0x188d): _ISupper
    <b94>   DW_AT_const_value : 256
 <2><b96>: Abbrev Number: 32 (DW_TAG_enumerator)
    <b97>   DW_AT_name        : (indirect string, offset: 0x2ee7): _ISlower
    <b9b>   DW_AT_const_value : 512
 <2><b9d>: Abbrev Number: 32 (DW_TAG_enumerator)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x1089): _ISalpha
    <ba2>   DW_AT_const_value : 1024
 <2><ba4>: Abbrev Number: 32 (DW_TAG_enumerator)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x35eb): _ISdigit
    <ba9>   DW_AT_const_value : 2048
 <2><bab>: Abbrev Number: 32 (DW_TAG_enumerator)
    <bac>   DW_AT_name        : (indirect string, offset: 0x145e): _ISxdigit
    <bb0>   DW_AT_const_value : 4096
 <2><bb2>: Abbrev Number: 32 (DW_TAG_enumerator)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x127f): _ISspace
    <bb7>   DW_AT_const_value : 8192
 <2><bb9>: Abbrev Number: 32 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0x11a7): _ISprint
    <bbe>   DW_AT_const_value : 16384
 <2><bc0>: Abbrev Number: 32 (DW_TAG_enumerator)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x2ad2): _ISgraph
    <bc5>   DW_AT_const_value : 32768
 <2><bc7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <bc8>   DW_AT_name        : (indirect string, offset: 0xdfd): _ISblank
    <bcc>   DW_AT_const_value : 1
 <2><bcd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <bce>   DW_AT_name        : (indirect string, offset: 0x183b): _IScntrl
    <bd2>   DW_AT_const_value : 2
 <2><bd3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x352): _ISpunct
    <bd8>   DW_AT_const_value : 4
 <2><bd9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <bda>   DW_AT_name        : (indirect string, offset: 0x11c2): _ISalnum
    <bde>   DW_AT_const_value : 8
 <2><bdf>: Abbrev Number: 0
 <1><be0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <be1>   DW_AT_name        : (indirect string, offset: 0x21): lconv
    <be5>   DW_AT_byte_size   : 96
    <be6>   DW_AT_decl_file   : 30
    <be7>   DW_AT_decl_line   : 51
    <be8>   DW_AT_decl_column : 8
    <be9>   DW_AT_sibling     : <0xd26>
 <2><bed>: Abbrev Number: 10 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0x24d8): decimal_point
    <bf2>   DW_AT_decl_file   : 30
    <bf3>   DW_AT_decl_line   : 55
    <bf4>   DW_AT_decl_column : 9
    <bf5>   DW_AT_type        : <0x39>
    <bf9>   DW_AT_data_member_location: 0
 <2><bfa>: Abbrev Number: 10 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xb02): thousands_sep
    <bff>   DW_AT_decl_file   : 30
    <c00>   DW_AT_decl_line   : 56
    <c01>   DW_AT_decl_column : 9
    <c02>   DW_AT_type        : <0x39>
    <c06>   DW_AT_data_member_location: 8
 <2><c07>: Abbrev Number: 10 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0x1db7): grouping
    <c0c>   DW_AT_decl_file   : 30
    <c0d>   DW_AT_decl_line   : 62
    <c0e>   DW_AT_decl_column : 9
    <c0f>   DW_AT_type        : <0x39>
    <c13>   DW_AT_data_member_location: 16
 <2><c14>: Abbrev Number: 10 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x1326): int_curr_symbol
    <c19>   DW_AT_decl_file   : 30
    <c1a>   DW_AT_decl_line   : 68
    <c1b>   DW_AT_decl_column : 9
    <c1c>   DW_AT_type        : <0x39>
    <c20>   DW_AT_data_member_location: 24
 <2><c21>: Abbrev Number: 10 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0xcb4): currency_symbol
    <c26>   DW_AT_decl_file   : 30
    <c27>   DW_AT_decl_line   : 69
    <c28>   DW_AT_decl_column : 9
    <c29>   DW_AT_type        : <0x39>
    <c2d>   DW_AT_data_member_location: 32
 <2><c2e>: Abbrev Number: 10 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x24d4): mon_decimal_point
    <c33>   DW_AT_decl_file   : 30
    <c34>   DW_AT_decl_line   : 70
    <c35>   DW_AT_decl_column : 9
    <c36>   DW_AT_type        : <0x39>
    <c3a>   DW_AT_data_member_location: 40
 <2><c3b>: Abbrev Number: 10 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x15f1): mon_thousands_sep
    <c40>   DW_AT_decl_file   : 30
    <c41>   DW_AT_decl_line   : 71
    <c42>   DW_AT_decl_column : 9
    <c43>   DW_AT_type        : <0x39>
    <c47>   DW_AT_data_member_location: 48
 <2><c48>: Abbrev Number: 10 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x1db3): mon_grouping
    <c4d>   DW_AT_decl_file   : 30
    <c4e>   DW_AT_decl_line   : 72
    <c4f>   DW_AT_decl_column : 9
    <c50>   DW_AT_type        : <0x39>
    <c54>   DW_AT_data_member_location: 56
 <2><c55>: Abbrev Number: 10 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x2fa3): positive_sign
    <c5a>   DW_AT_decl_file   : 30
    <c5b>   DW_AT_decl_line   : 73
    <c5c>   DW_AT_decl_column : 9
    <c5d>   DW_AT_type        : <0x39>
    <c61>   DW_AT_data_member_location: 64
 <2><c62>: Abbrev Number: 10 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x122d): negative_sign
    <c67>   DW_AT_decl_file   : 30
    <c68>   DW_AT_decl_line   : 74
    <c69>   DW_AT_decl_column : 9
    <c6a>   DW_AT_type        : <0x39>
    <c6e>   DW_AT_data_member_location: 72
 <2><c6f>: Abbrev Number: 10 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x37f7): int_frac_digits
    <c74>   DW_AT_decl_file   : 30
    <c75>   DW_AT_decl_line   : 75
    <c76>   DW_AT_decl_column : 8
    <c77>   DW_AT_type        : <0x49>
    <c7b>   DW_AT_data_member_location: 80
 <2><c7c>: Abbrev Number: 10 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x37fb): frac_digits
    <c81>   DW_AT_decl_file   : 30
    <c82>   DW_AT_decl_line   : 76
    <c83>   DW_AT_decl_column : 8
    <c84>   DW_AT_type        : <0x49>
    <c88>   DW_AT_data_member_location: 81
 <2><c89>: Abbrev Number: 10 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x3a5f): p_cs_precedes
    <c8e>   DW_AT_decl_file   : 30
    <c8f>   DW_AT_decl_line   : 78
    <c90>   DW_AT_decl_column : 8
    <c91>   DW_AT_type        : <0x49>
    <c95>   DW_AT_data_member_location: 82
 <2><c96>: Abbrev Number: 10 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x209): p_sep_by_space
    <c9b>   DW_AT_decl_file   : 30
    <c9c>   DW_AT_decl_line   : 80
    <c9d>   DW_AT_decl_column : 8
    <c9e>   DW_AT_type        : <0x49>
    <ca2>   DW_AT_data_member_location: 83
 <2><ca3>: Abbrev Number: 10 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0xd5e): n_cs_precedes
    <ca8>   DW_AT_decl_file   : 30
    <ca9>   DW_AT_decl_line   : 82
    <caa>   DW_AT_decl_column : 8
    <cab>   DW_AT_type        : <0x49>
    <caf>   DW_AT_data_member_location: 84
 <2><cb0>: Abbrev Number: 10 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x32d1): n_sep_by_space
    <cb5>   DW_AT_decl_file   : 30
    <cb6>   DW_AT_decl_line   : 84
    <cb7>   DW_AT_decl_column : 8
    <cb8>   DW_AT_type        : <0x49>
    <cbc>   DW_AT_data_member_location: 85
 <2><cbd>: Abbrev Number: 10 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x23cd): p_sign_posn
    <cc2>   DW_AT_decl_file   : 30
    <cc3>   DW_AT_decl_line   : 91
    <cc4>   DW_AT_decl_column : 8
    <cc5>   DW_AT_type        : <0x49>
    <cc9>   DW_AT_data_member_location: 86
 <2><cca>: Abbrev Number: 10 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x2af9): n_sign_posn
    <ccf>   DW_AT_decl_file   : 30
    <cd0>   DW_AT_decl_line   : 92
    <cd1>   DW_AT_decl_column : 8
    <cd2>   DW_AT_type        : <0x49>
    <cd6>   DW_AT_data_member_location: 87
 <2><cd7>: Abbrev Number: 10 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x3a5b): int_p_cs_precedes
    <cdc>   DW_AT_decl_file   : 30
    <cdd>   DW_AT_decl_line   : 95
    <cde>   DW_AT_decl_column : 8
    <cdf>   DW_AT_type        : <0x49>
    <ce3>   DW_AT_data_member_location: 88
 <2><ce4>: Abbrev Number: 10 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x205): int_p_sep_by_space
    <ce9>   DW_AT_decl_file   : 30
    <cea>   DW_AT_decl_line   : 97
    <ceb>   DW_AT_decl_column : 8
    <cec>   DW_AT_type        : <0x49>
    <cf0>   DW_AT_data_member_location: 89
 <2><cf1>: Abbrev Number: 10 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xd5a): int_n_cs_precedes
    <cf6>   DW_AT_decl_file   : 30
    <cf7>   DW_AT_decl_line   : 99
    <cf8>   DW_AT_decl_column : 8
    <cf9>   DW_AT_type        : <0x49>
    <cfd>   DW_AT_data_member_location: 90
 <2><cfe>: Abbrev Number: 10 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x32cd): int_n_sep_by_space
    <d03>   DW_AT_decl_file   : 30
    <d04>   DW_AT_decl_line   : 101
    <d05>   DW_AT_decl_column : 8
    <d06>   DW_AT_type        : <0x49>
    <d0a>   DW_AT_data_member_location: 91
 <2><d0b>: Abbrev Number: 10 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x23c9): int_p_sign_posn
    <d10>   DW_AT_decl_file   : 30
    <d11>   DW_AT_decl_line   : 108
    <d12>   DW_AT_decl_column : 8
    <d13>   DW_AT_type        : <0x49>
    <d17>   DW_AT_data_member_location: 92
 <2><d18>: Abbrev Number: 10 (DW_TAG_member)
    <d19>   DW_AT_name        : (indirect string, offset: 0x2af5): int_n_sign_posn
    <d1d>   DW_AT_decl_file   : 30
    <d1e>   DW_AT_decl_line   : 109
    <d1f>   DW_AT_decl_column : 8
    <d20>   DW_AT_type        : <0x49>
    <d24>   DW_AT_data_member_location: 93
 <2><d25>: Abbrev Number: 0
 <1><d26>: Abbrev Number: 4 (DW_TAG_const_type)
    <d27>   DW_AT_type        : <0xbe0>
 <1><d2b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x28eb): _IO_FILE
    <d30>   DW_AT_byte_size   : 216
    <d31>   DW_AT_decl_file   : 31
    <d32>   DW_AT_decl_line   : 49
    <d33>   DW_AT_decl_column : 8
    <d34>   DW_AT_sibling     : <0xeb2>
 <2><d38>: Abbrev Number: 10 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0xfff): _flags
    <d3d>   DW_AT_decl_file   : 31
    <d3e>   DW_AT_decl_line   : 51
    <d3f>   DW_AT_decl_column : 7
    <d40>   DW_AT_type        : <0x61>
    <d44>   DW_AT_data_member_location: 0
 <2><d45>: Abbrev Number: 10 (DW_TAG_member)
    <d46>   DW_AT_name        : (indirect string, offset: 0x32e0): _IO_read_ptr
    <d4a>   DW_AT_decl_file   : 31
    <d4b>   DW_AT_decl_line   : 54
    <d4c>   DW_AT_decl_column : 9
    <d4d>   DW_AT_type        : <0x39>
    <d51>   DW_AT_data_member_location: 8
 <2><d52>: Abbrev Number: 10 (DW_TAG_member)
    <d53>   DW_AT_name        : (indirect string, offset: 0x287f): _IO_read_end
    <d57>   DW_AT_decl_file   : 31
    <d58>   DW_AT_decl_line   : 55
    <d59>   DW_AT_decl_column : 9
    <d5a>   DW_AT_type        : <0x39>
    <d5e>   DW_AT_data_member_location: 16
 <2><d5f>: Abbrev Number: 10 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0x20a6): _IO_read_base
    <d64>   DW_AT_decl_file   : 31
    <d65>   DW_AT_decl_line   : 56
    <d66>   DW_AT_decl_column : 9
    <d67>   DW_AT_type        : <0x39>
    <d6b>   DW_AT_data_member_location: 24
 <2><d6c>: Abbrev Number: 10 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x2193): _IO_write_base
    <d71>   DW_AT_decl_file   : 31
    <d72>   DW_AT_decl_line   : 57
    <d73>   DW_AT_decl_column : 9
    <d74>   DW_AT_type        : <0x39>
    <d78>   DW_AT_data_member_location: 32
 <2><d79>: Abbrev Number: 10 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x1206): _IO_write_ptr
    <d7e>   DW_AT_decl_file   : 31
    <d7f>   DW_AT_decl_line   : 58
    <d80>   DW_AT_decl_column : 9
    <d81>   DW_AT_type        : <0x39>
    <d85>   DW_AT_data_member_location: 40
 <2><d86>: Abbrev Number: 10 (DW_TAG_member)
    <d87>   DW_AT_name        : (indirect string, offset: 0x820): _IO_write_end
    <d8b>   DW_AT_decl_file   : 31
    <d8c>   DW_AT_decl_line   : 59
    <d8d>   DW_AT_decl_column : 9
    <d8e>   DW_AT_type        : <0x39>
    <d92>   DW_AT_data_member_location: 48
 <2><d93>: Abbrev Number: 10 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0x27d1): _IO_buf_base
    <d98>   DW_AT_decl_file   : 31
    <d99>   DW_AT_decl_line   : 60
    <d9a>   DW_AT_decl_column : 9
    <d9b>   DW_AT_type        : <0x39>
    <d9f>   DW_AT_data_member_location: 56
 <2><da0>: Abbrev Number: 10 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x323): _IO_buf_end
    <da5>   DW_AT_decl_file   : 31
    <da6>   DW_AT_decl_line   : 61
    <da7>   DW_AT_decl_column : 9
    <da8>   DW_AT_type        : <0x39>
    <dac>   DW_AT_data_member_location: 64
 <2><dad>: Abbrev Number: 10 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0x1594): _IO_save_base
    <db2>   DW_AT_decl_file   : 31
    <db3>   DW_AT_decl_line   : 64
    <db4>   DW_AT_decl_column : 9
    <db5>   DW_AT_type        : <0x39>
    <db9>   DW_AT_data_member_location: 72
 <2><dba>: Abbrev Number: 10 (DW_TAG_member)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x32bd): _IO_backup_base
    <dbf>   DW_AT_decl_file   : 31
    <dc0>   DW_AT_decl_line   : 65
    <dc1>   DW_AT_decl_column : 9
    <dc2>   DW_AT_type        : <0x39>
    <dc6>   DW_AT_data_member_location: 80
 <2><dc7>: Abbrev Number: 10 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x1ca8): _IO_save_end
    <dcc>   DW_AT_decl_file   : 31
    <dcd>   DW_AT_decl_line   : 66
    <dce>   DW_AT_decl_column : 9
    <dcf>   DW_AT_type        : <0x39>
    <dd3>   DW_AT_data_member_location: 88
 <2><dd4>: Abbrev Number: 10 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x2c08): _markers
    <dd9>   DW_AT_decl_file   : 31
    <dda>   DW_AT_decl_line   : 68
    <ddb>   DW_AT_decl_column : 22
    <ddc>   DW_AT_type        : <0xecb>
    <de0>   DW_AT_data_member_location: 96
 <2><de1>: Abbrev Number: 10 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0xd48): _chain
    <de6>   DW_AT_decl_file   : 31
    <de7>   DW_AT_decl_line   : 70
    <de8>   DW_AT_decl_column : 20
    <de9>   DW_AT_type        : <0xed1>
    <ded>   DW_AT_data_member_location: 104
 <2><dee>: Abbrev Number: 10 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x96): _fileno
    <df3>   DW_AT_decl_file   : 31
    <df4>   DW_AT_decl_line   : 72
    <df5>   DW_AT_decl_column : 7
    <df6>   DW_AT_type        : <0x61>
    <dfa>   DW_AT_data_member_location: 112
 <2><dfb>: Abbrev Number: 10 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x353e): _flags2
    <e00>   DW_AT_decl_file   : 31
    <e01>   DW_AT_decl_line   : 73
    <e02>   DW_AT_decl_column : 7
    <e03>   DW_AT_type        : <0x61>
    <e07>   DW_AT_data_member_location: 116
 <2><e08>: Abbrev Number: 10 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x347c): _old_offset
    <e0d>   DW_AT_decl_file   : 31
    <e0e>   DW_AT_decl_line   : 74
    <e0f>   DW_AT_decl_column : 11
    <e10>   DW_AT_type        : <0x165>
    <e14>   DW_AT_data_member_location: 120
 <2><e15>: Abbrev Number: 10 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x31c6): _cur_column
    <e1a>   DW_AT_decl_file   : 31
    <e1b>   DW_AT_decl_line   : 77
    <e1c>   DW_AT_decl_column : 18
    <e1d>   DW_AT_type        : <0xd6>
    <e21>   DW_AT_data_member_location: 128
 <2><e22>: Abbrev Number: 10 (DW_TAG_member)
    <e23>   DW_AT_name        : (indirect string, offset: 0x3abb): _vtable_offset
    <e27>   DW_AT_decl_file   : 31
    <e28>   DW_AT_decl_line   : 78
    <e29>   DW_AT_decl_column : 15
    <e2a>   DW_AT_type        : <0xf0>
    <e2e>   DW_AT_data_member_location: 130
 <2><e2f>: Abbrev Number: 10 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x33e): _shortbuf
    <e34>   DW_AT_decl_file   : 31
    <e35>   DW_AT_decl_line   : 79
    <e36>   DW_AT_decl_column : 8
    <e37>   DW_AT_type        : <0xed7>
    <e3b>   DW_AT_data_member_location: 131
 <2><e3c>: Abbrev Number: 10 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x9f4): _lock
    <e41>   DW_AT_decl_file   : 31
    <e42>   DW_AT_decl_line   : 81
    <e43>   DW_AT_decl_column : 15
    <e44>   DW_AT_type        : <0xee7>
    <e48>   DW_AT_data_member_location: 136
 <2><e49>: Abbrev Number: 10 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x3480): _offset
    <e4e>   DW_AT_decl_file   : 31
    <e4f>   DW_AT_decl_line   : 89
    <e50>   DW_AT_decl_column : 13
    <e51>   DW_AT_type        : <0x171>
    <e55>   DW_AT_data_member_location: 144
 <2><e56>: Abbrev Number: 10 (DW_TAG_member)
    <e57>   DW_AT_name        : (indirect string, offset: 0x2543): _codecvt
    <e5b>   DW_AT_decl_file   : 31
    <e5c>   DW_AT_decl_line   : 91
    <e5d>   DW_AT_decl_column : 23
    <e5e>   DW_AT_type        : <0xef2>
    <e62>   DW_AT_data_member_location: 152
 <2><e63>: Abbrev Number: 10 (DW_TAG_member)
    <e64>   DW_AT_name        : (indirect string, offset: 0x2901): _wide_data
    <e68>   DW_AT_decl_file   : 31
    <e69>   DW_AT_decl_line   : 92
    <e6a>   DW_AT_decl_column : 25
    <e6b>   DW_AT_type        : <0xefd>
    <e6f>   DW_AT_data_member_location: 160
 <2><e70>: Abbrev Number: 10 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0x335b): _freeres_list
    <e75>   DW_AT_decl_file   : 31
    <e76>   DW_AT_decl_line   : 93
    <e77>   DW_AT_decl_column : 20
    <e78>   DW_AT_type        : <0xed1>
    <e7c>   DW_AT_data_member_location: 168
 <2><e7d>: Abbrev Number: 10 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x30f8): _freeres_buf
    <e82>   DW_AT_decl_file   : 31
    <e83>   DW_AT_decl_line   : 94
    <e84>   DW_AT_decl_column : 9
    <e85>   DW_AT_type        : <0x1bd>
    <e89>   DW_AT_data_member_location: 176
 <2><e8a>: Abbrev Number: 10 (DW_TAG_member)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x2b5b): __pad5
    <e8f>   DW_AT_decl_file   : 31
    <e90>   DW_AT_decl_line   : 95
    <e91>   DW_AT_decl_column : 10
    <e92>   DW_AT_type        : <0x1f4>
    <e96>   DW_AT_data_member_location: 184
 <2><e97>: Abbrev Number: 10 (DW_TAG_member)
    <e98>   DW_AT_name        : (indirect string, offset: 0x177b): _mode
    <e9c>   DW_AT_decl_file   : 31
    <e9d>   DW_AT_decl_line   : 96
    <e9e>   DW_AT_decl_column : 7
    <e9f>   DW_AT_type        : <0x61>
    <ea3>   DW_AT_data_member_location: 192
 <2><ea4>: Abbrev Number: 10 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x6c): _unused2
    <ea9>   DW_AT_decl_file   : 31
    <eaa>   DW_AT_decl_line   : 98
    <eab>   DW_AT_decl_column : 8
    <eac>   DW_AT_type        : <0xf03>
    <eb0>   DW_AT_data_member_location: 196
 <2><eb1>: Abbrev Number: 0
 <1><eb2>: Abbrev Number: 12 (DW_TAG_typedef)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x6a8): FILE
    <eb7>   DW_AT_decl_file   : 32
    <eb8>   DW_AT_decl_line   : 7
    <eb9>   DW_AT_decl_column : 25
    <eba>   DW_AT_type        : <0xd2b>
 <1><ebe>: Abbrev Number: 33 (DW_TAG_typedef)
    <ebf>   DW_AT_name        : (indirect string, offset: 0xebc): _IO_lock_t
    <ec3>   DW_AT_decl_file   : 31
    <ec4>   DW_AT_decl_line   : 43
    <ec5>   DW_AT_decl_column : 14
 <1><ec6>: Abbrev Number: 34 (DW_TAG_structure_type)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x23be): _IO_marker
    <ecb>   DW_AT_declaration : 1
 <1><ecb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ecc>   DW_AT_byte_size   : 8
    <ecd>   DW_AT_type        : <0xec6>
 <1><ed1>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ed2>   DW_AT_byte_size   : 8
    <ed3>   DW_AT_type        : <0xd2b>
 <1><ed7>: Abbrev Number: 13 (DW_TAG_array_type)
    <ed8>   DW_AT_type        : <0x49>
    <edc>   DW_AT_sibling     : <0xee7>
 <2><ee0>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <ee1>   DW_AT_type        : <0xe9>
    <ee5>   DW_AT_upper_bound : 0
 <2><ee6>: Abbrev Number: 0
 <1><ee7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ee8>   DW_AT_byte_size   : 8
    <ee9>   DW_AT_type        : <0xebe>
 <1><eed>: Abbrev Number: 34 (DW_TAG_structure_type)
    <eee>   DW_AT_name        : (indirect string, offset: 0x2540): _IO_codecvt
    <ef2>   DW_AT_declaration : 1
 <1><ef2>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ef3>   DW_AT_byte_size   : 8
    <ef4>   DW_AT_type        : <0xeed>
 <1><ef8>: Abbrev Number: 34 (DW_TAG_structure_type)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x28fe): _IO_wide_data
    <efd>   DW_AT_declaration : 1
 <1><efd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <efe>   DW_AT_byte_size   : 8
    <eff>   DW_AT_type        : <0xef8>
 <1><f03>: Abbrev Number: 13 (DW_TAG_array_type)
    <f04>   DW_AT_type        : <0x49>
    <f08>   DW_AT_sibling     : <0xf13>
 <2><f0c>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <f0d>   DW_AT_type        : <0xe9>
    <f11>   DW_AT_upper_bound : 19
 <2><f12>: Abbrev Number: 0
 <1><f13>: Abbrev Number: 2 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0x20be): stdin
    <f18>   DW_AT_decl_file   : 33
    <f19>   DW_AT_decl_line   : 137
    <f1a>   DW_AT_decl_column : 14
    <f1b>   DW_AT_type        : <0xf1f>
    <f1f>   DW_AT_external    : 1
    <f1f>   DW_AT_declaration : 1
 <1><f1f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f20>   DW_AT_byte_size   : 8
    <f21>   DW_AT_type        : <0xeb2>
 <1><f25>: Abbrev Number: 5 (DW_TAG_restrict_type)
    <f26>   DW_AT_type        : <0xf1f>
 <1><f2a>: Abbrev Number: 4 (DW_TAG_const_type)
    <f2b>   DW_AT_type        : <0xf1f>
 <1><f2f>: Abbrev Number: 2 (DW_TAG_variable)
    <f30>   DW_AT_name        : (indirect string, offset: 0x207f): stdout
    <f34>   DW_AT_decl_file   : 33
    <f35>   DW_AT_decl_line   : 138
    <f36>   DW_AT_decl_column : 14
    <f37>   DW_AT_type        : <0xf1f>
    <f3b>   DW_AT_external    : 1
    <f3b>   DW_AT_declaration : 1
 <1><f3b>: Abbrev Number: 2 (DW_TAG_variable)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x1c4e): stderr
    <f40>   DW_AT_decl_file   : 33
    <f41>   DW_AT_decl_line   : 139
    <f42>   DW_AT_decl_column : 14
    <f43>   DW_AT_type        : <0xf1f>
    <f47>   DW_AT_external    : 1
    <f47>   DW_AT_declaration : 1
 <1><f47>: Abbrev Number: 35 (DW_TAG_enumeration_type)
    <f48>   DW_AT_encoding    : 5	(signed)
    <f49>   DW_AT_byte_size   : 4
    <f4a>   DW_AT_type        : <0x61>
    <f4e>   DW_AT_decl_file   : 1
    <f4f>   DW_AT_decl_line   : 330
    <f51>   DW_AT_decl_column : 1
    <f52>   DW_AT_sibling     : <0xf65>
 <2><f56>: Abbrev Number: 36 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x3b3f): GETOPT_HELP_CHAR
    <f5b>   DW_AT_const_value : -130
 <2><f5d>: Abbrev Number: 36 (DW_TAG_enumerator)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x1aa7): GETOPT_VERSION_CHAR
    <f62>   DW_AT_const_value : -131
 <2><f64>: Abbrev Number: 0
 <1><f65>: Abbrev Number: 2 (DW_TAG_variable)
    <f66>   DW_AT_name        : (indirect string, offset: 0x2c65): program_name
    <f6a>   DW_AT_decl_file   : 34
    <f6b>   DW_AT_decl_line   : 32
    <f6c>   DW_AT_decl_column : 20
    <f6d>   DW_AT_type        : <0xb9>
    <f71>   DW_AT_external    : 1
    <f71>   DW_AT_declaration : 1
 <1><f71>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <f72>   DW_AT_name        : (indirect string, offset: 0x2855): quoting_style
    <f76>   DW_AT_encoding    : 7	(unsigned)
    <f77>   DW_AT_byte_size   : 4
    <f78>   DW_AT_type        : <0xe2>
    <f7c>   DW_AT_decl_file   : 35
    <f7d>   DW_AT_decl_line   : 32
    <f7e>   DW_AT_decl_column : 6
    <f7f>   DW_AT_sibling     : <0xfc6>
 <2><f83>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0x256c): literal_quoting_style
    <f88>   DW_AT_const_value : 0
 <2><f89>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x175e): shell_quoting_style
    <f8e>   DW_AT_const_value : 1
 <2><f8f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f90>   DW_AT_name        : (indirect string, offset: 0xe5a): shell_always_quoting_style
    <f94>   DW_AT_const_value : 2
 <2><f95>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f96>   DW_AT_name        : (indirect string, offset: 0x2c46): shell_escape_quoting_style
    <f9a>   DW_AT_const_value : 3
 <2><f9b>: Abbrev Number: 27 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x2b21): shell_escape_always_quoting_style
    <fa0>   DW_AT_const_value : 4
 <2><fa1>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x2853): c_quoting_style
    <fa6>   DW_AT_const_value : 5
 <2><fa7>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x20f2): c_maybe_quoting_style
    <fac>   DW_AT_const_value : 6
 <2><fad>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0x2c4c): escape_quoting_style
    <fb2>   DW_AT_const_value : 7
 <2><fb3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xfa2): locale_quoting_style
    <fb8>   DW_AT_const_value : 8
 <2><fb9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0xfa1): clocale_quoting_style
    <fbe>   DW_AT_const_value : 9
 <2><fbf>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x14fd): custom_quoting_style
    <fc4>   DW_AT_const_value : 10
 <2><fc5>: Abbrev Number: 0
 <1><fc6>: Abbrev Number: 12 (DW_TAG_typedef)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x803): argmatch_exit_fn
    <fcb>   DW_AT_decl_file   : 36
    <fcc>   DW_AT_decl_line   : 67
    <fcd>   DW_AT_decl_column : 16
    <fce>   DW_AT_type        : <0xa22>
 <1><fd2>: Abbrev Number: 2 (DW_TAG_variable)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x3c26): argmatch_die
    <fd7>   DW_AT_decl_file   : 36
    <fd8>   DW_AT_decl_line   : 68
    <fd9>   DW_AT_decl_column : 25
    <fda>   DW_AT_type        : <0xfc6>
    <fde>   DW_AT_external    : 1
    <fde>   DW_AT_declaration : 1
 <1><fde>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <fdf>   DW_AT_encoding    : 7	(unsigned)
    <fe0>   DW_AT_byte_size   : 4
    <fe1>   DW_AT_type        : <0xe2>
    <fe5>   DW_AT_decl_file   : 37
    <fe6>   DW_AT_decl_line   : 45
    <fe7>   DW_AT_decl_column : 14
    <fe8>   DW_AT_sibling     : <0x1011>
 <2><fec>: Abbrev Number: 27 (DW_TAG_enumerator)
    <fed>   DW_AT_name        : (indirect string, offset: 0x1b2b): FADVISE_NORMAL
    <ff1>   DW_AT_const_value : 0
 <2><ff2>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x3129): FADVISE_SEQUENTIAL
    <ff7>   DW_AT_const_value : 2
 <2><ff8>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x1b51): FADVISE_NOREUSE
    <ffd>   DW_AT_const_value : 5
 <2><ffe>: Abbrev Number: 27 (DW_TAG_enumerator)
